{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\laxfr\Desktop\All-Comers\Analysis\Final Analysis Log.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}20 Jan 2026, 06:54:46

{com}. do "C:\Users\laxfr\AppData\Local\Temp\STD3620_000002.tmp"
{txt}
{com}. clear
{txt}
{com}. 
. use "C:\Users\laxfr\Desktop\All-Comers\Onc-BMT\Stata\Data\All Admitted Onc-BMT Modified Table 1 Data (Updated).dta"
{txt}
{com}. 
. append using "C:\Users\laxfr\Desktop\All-Comers\Trisomy\Stata\Data\All Trisomy Patients Modified Table 1 (Updated).dta"
{txt}(label {bf:{txt}Ethnicity} already defined)
(label {bf:{txt}Gender} already defined)

{com}. 
. append using "C:\Users\laxfr\Desktop\All-Comers\Trauma\Stata\Data\All Trauma Patients Modified Table 1 (Updated).dta"
{txt}{p 0 7 2}
(variable
{bf:DxCodeICD} was {bf:str5}, now {bf:str7} to accommodate using data's values)
{p_end}
(label {bf:{txt}Ethnicity} already defined)
(label {bf:{txt}Gender} already defined)

{com}. 
. browse
{txt}
{com}. 
. merge m:m DischargeID using "C:\Users\laxfr\Desktop\All-Comers\All Patients\Stata\Data\All High Patients with ECMO Dx All Table 1 (Updated).dta"
{res}{txt}(label {bf:{txt}Ethnicity} already defined)
(label {bf:{txt}Gender} already defined)

{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}       1,771,513
{txt}{col 9}from master{col 30}{res}         139,472{txt}  (_merge==1)
{col 9}from using{col 30}{res}       1,632,041{txt}  (_merge==2)

{col 5}Matched{col 30}{res}         208,127{txt}  (_merge==3)
{col 5}{hline 41}

{com}. 
. rename _merge _merge_all
{res}{txt}
{com}. 
. merge m:m DischargeID using "C:\Users\laxfr\Desktop\Fellowship Files\CHEAR Fellowship\Research\ECMO Practica 1\Data\All Hospital\Stata\Data\All ECMO Cases pulled by Px and Date.dta"
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}       1,921,585
{txt}{col 9}from master{col 30}{res}       1,918,310{txt}  (_merge==1)
{col 9}from using{col 30}{res}           3,275{txt}  (_merge==2)

{col 5}Matched{col 30}{res}          61,341{txt}  (_merge==3)
{col 5}{hline 41}

{com}. 
. rename _merge _merge_ecmo
{res}{txt}
{com}. 
. set seed 12345
{txt}
{com}. 
. 
. drop if HospitalNumber ==.
{txt}(3 observations deleted)

{com}. drop if DischargeID ==.
{txt}(0 observations deleted)

{com}. 
. 
. replace YearOfService = 1 if YearOfService == 2016
{txt}(5,415 real changes made)

{com}. replace YearOfService = 2 if YearOfService == 2017
{txt}(6,538 real changes made)

{com}. replace YearOfService = 3 if YearOfService == 2018
{txt}(7,284 real changes made)

{com}. replace YearOfService = 4 if YearOfService == 2019
{txt}(7,039 real changes made)

{com}. replace YearOfService = 5 if YearOfService == 2020
{txt}(6,924 real changes made)

{com}. replace YearOfService = 6 if YearOfService == 2021
{txt}(7,901 real changes made)

{com}. replace YearOfService = 7 if YearOfService == 2022
{txt}(8,869 real changes made)

{com}. replace YearOfService = 8 if YearOfService == 2023
{txt}(8,172 real changes made)

{com}. replace YearOfService = 9 if YearOfService == 2024
{txt}(6,471 real changes made)

{com}. 
. 
. label define YearOfService 1 "2016" 2 "2017" 3 "2018" 4 "2019" 5 "2020" 6 "2021" 7 "2022" 8 "2023" 9 "2024"
{txt}
{com}. label values YearOfService YearOfService
{txt}
{com}. 
. replace AdmitYear = 1 if AdmitYear == 2016
{txt}(183,527 real changes made)

{com}. replace AdmitYear = 2 if AdmitYear == 2017
{txt}(204,250 real changes made)

{com}. replace AdmitYear = 3 if AdmitYear == 2018
{txt}(219,106 real changes made)

{com}. replace AdmitYear = 4 if AdmitYear == 2019
{txt}(234,054 real changes made)

{com}. replace AdmitYear = 5 if AdmitYear == 2020
{txt}(183,234 real changes made)

{com}. replace AdmitYear = 6 if AdmitYear == 2021
{txt}(225,839 real changes made)

{com}. replace AdmitYear = 7 if AdmitYear == 2022
{txt}(258,868 real changes made)

{com}. replace AdmitYear = 8 if AdmitYear == 2023
{txt}(244,168 real changes made)

{com}. replace AdmitYear = 9 if AdmitYear == 2024
{txt}(226,602 real changes made)

{com}. 
. drop if AdmitYear ==.
{txt}(3,275 observations deleted)

{com}. 
. 
. label define AdmitYear 1 "2016" 2 "2017" 3 "2018" 4 "2019" 5 "2020" 6 "2021" 7 "2022" 8 "2023" 9 "2024"
{txt}
{com}. label values AdmitYear AdmitYear
{txt}
{com}. 
. tab AdmitYear YearOfService

           {txt}{c |}                                          Year Of Service
Admit Year {c |}      2016       2017       2018       2019       2020       2021       2022       2023       2024 {c |}     Total
{hline 11}{c +}{hline 99}{c +}{hline 10}
      2016 {c |}{res}     5,051        273          0          0          0          0          0          0          0 {txt}{c |}{res}     5,324 
{txt}      2017 {c |}{res}         0      5,919        326          0          0          0          0          0          0 {txt}{c |}{res}     6,245 
{txt}      2018 {c |}{res}         0          0      6,573        312          9          0          0          0          0 {txt}{c |}{res}     6,894 
{txt}      2019 {c |}{res}         0          0          0      6,353        292          0          0          0          0 {txt}{c |}{res}     6,645 
{txt}      2020 {c |}{res}         0          0          0          0      6,262        460          9          0          0 {txt}{c |}{res}     6,731 
{txt}      2021 {c |}{res}         0          0          0          0          0      7,107        435          3          0 {txt}{c |}{res}     7,545 
{txt}      2022 {c |}{res}         0          0          0          0          0          0      8,032        437          0 {txt}{c |}{res}     8,469 
{txt}      2023 {c |}{res}         0          0          0          0          0          0          0      7,371        436 {txt}{c |}{res}     7,807 
{txt}      2024 {c |}{res}         0          0          0          0          0          0          0          0      5,678 {txt}{c |}{res}     5,678 
{txt}{hline 11}{c +}{hline 99}{c +}{hline 10}
     Total {c |}{res}     5,051      6,192      6,899      6,665      6,563      7,567      8,476      7,811      6,114 {txt}{c |}{res}    61,338 
{txt}
{com}. 
. replace YearOfService = AdmitYear if YearOfService ==.
{txt}(1,918,310 real changes made)

{com}. 
. 
. tab high_risk_group high_risk_group

{txt}high_risk_ {c |}         high_risk_group
     group {c |}         0          1          2 {c |}     Total
{hline 11}{c +}{hline 33}{c +}{hline 10}
         0 {c |}{res}    13,196          0          0 {txt}{c |}{res}    13,196 
{txt}         1 {c |}{res}         0    289,123          0 {txt}{c |}{res}   289,123 
{txt}         2 {c |}{res}         0          0     45,278 {txt}{c |}{res}    45,278 
{txt}{hline 11}{c +}{hline 33}{c +}{hline 10}
     Total {c |}{res}    13,196    289,123     45,278 {txt}{c |}{res}   347,597 
{txt}
{com}. 
. replace high_risk_group =3 if high_risk_group ==.
{txt}(1,632,051 real changes made)

{com}. 
. tab high_risk_group high_risk_group

{txt}high_risk_ {c |}               high_risk_group
     group {c |}         0          1          2          3 {c |}     Total
{hline 11}{c +}{hline 44}{c +}{hline 10}
         0 {c |}{res}    13,196          0          0          0 {txt}{c |}{res}    13,196 
{txt}         1 {c |}{res}         0    289,123          0          0 {txt}{c |}{res}   289,123 
{txt}         2 {c |}{res}         0          0     45,278          0 {txt}{c |}{res}    45,278 
{txt}         3 {c |}{res}         0          0          0  1,632,051 {txt}{c |}{res} 1,632,051 
{txt}{hline 11}{c +}{hline 44}{c +}{hline 10}
     Total {c |}{res}    13,196    289,123     45,278  1,632,051 {txt}{c |}{res} 1,979,648 
{txt}
{com}. 
. label define high_risk_group 0 "T13/18" 1 "Trauma" 2 "Onc/HSCT" 3 "Not High Risk"
{txt}
{com}. label values high_risk_group high_risk_group
{txt}
{com}. 
. replace ECMO_dx_y_n =0 if ECMO_dx_y_n ==.
{txt}(139,472 real changes made)

{com}. 
. tab high_risk_group ECMO_dx_y_n

{txt}high_risk_gro {c |}      ECMO_dx_y_n
           up {c |}         0          1 {c |}     Total
{hline 14}{c +}{hline 22}{c +}{hline 10}
       T13/18 {c |}{res}       284     12,912 {txt}{c |}{res}    13,196 
{txt}       Trauma {c |}{res}   113,986    175,137 {txt}{c |}{res}   289,123 
{txt}     Onc/HSCT {c |}{res}    25,202     20,076 {txt}{c |}{res}    45,278 
{txt}Not High Risk {c |}{res}         0  1,632,051 {txt}{c |}{res} 1,632,051 
{txt}{hline 14}{c +}{hline 22}{c +}{hline 10}
        Total {c |}{res}   139,472  1,840,176 {txt}{c |}{res} 1,979,648 
{txt}
{com}. 
. replace ecmo_type1=7 if ecmo_type1==.
{txt}(1,918,310 real changes made)

{com}. 
. **relabeling ecmo_type1**
. label define ecmo_type1 0 "Unspeficied ECMO" 1 "Central VA ECMO" 2 "Peripheral VA ECMO" 3 "Peripheral VV ECMO" 4 "Central VA Intraoperative" 5 "Peripheral VA Intraoperative" 6 "Peripheral VV Intraoperative" 7 "no ECMO"
{txt}
{com}. label values ecmo_type1 ecmo_type1
{txt}
{com}. 
. **gen ECMO_y_n**
. gen ECMO_y_n =.
{txt}(1,979,648 missing values generated)

{com}. replace ECMO_y_n =1 if ecmo_type1 < 7
{txt}(61,338 real changes made)

{com}. replace ECMO_y_n =0 if ecmo_type1 ==7
{txt}(1,918,310 real changes made)

{com}. 
. **relabeling ECMO_y_n**
. label define ECMO_y_n 0 "No ECMO" 1 "ECMO"
{txt}
{com}. label values ECMO_y_n ECMO_y_n
{txt}
{com}. 
. *merging New York*
. 
. replace HospitalNumber = 2026 if HospitalNumber == 9026
{txt}(18,662 real changes made)

{com}. 
. *generate first encounter*
. bysort DischargeID: gen first= _n==1
{txt}
{com}. drop if first ==0
{txt}(1,274,701 observations deleted)

{com}. 
. **TOTAL ECMO**
. *generating total number of ecmo cases by center*
. bysort HospitalNumber (DischargeID): egen center_totalecmo = sum(ECMO_y_n) if first ==1
{txt}
{com}. bysort HospitalNumber (DischargeID): replace center_totalecmo = center_totalecmo[1]
{txt}(0 real changes made)

{com}. 
. **ADMITS BY HIGH RISK GROUP**
. *generating number of onc/bmt cases by center*
. bysort HospitalNumber (DischargeID): egen number_of_casesonc = count(DischargeID) if first ==1 & high_risk_group ==2
{txt}(670,279 missing values generated)

{com}. bysort HospitalNumber (number_of_casesonc): replace number_of_casesonc = number_of_casesonc[1]
{txt}(670,279 real changes made)

{com}. 
. *generating number of t13/18 cases by center*
. bysort HospitalNumber (DischargeID): egen number_of_casest1318 = count(DischargeID) if first ==1 & high_risk_group ==0
{txt}(701,456 missing values generated)

{com}. bysort HospitalNumber (number_of_casest1318): replace number_of_casest1318 = number_of_casest1318[1]
{txt}(701,456 real changes made)

{com}. 
. *generating number of trauma cases by center*
. bysort HospitalNumber: egen number_of_casestrauma = count(DischargeID) if first ==1 & high_risk_group ==1
{txt}(634,339 missing values generated)

{com}. bysort HospitalNumber (number_of_casestrauma): replace number_of_casestrauma = number_of_casestrauma[1]
{txt}(634,339 real changes made)

{com}. 
. **TRAUMA ECMO**
. 
. *generating number of ECMO by trauma 2016*
. bysort HospitalNumber (DischargeID): egen ecmo_cases_trauma_2016 = count(DischargeID) if high_risk_group ==1 & ECMO_y_n == 1 & YearOfService ==1
{txt}(704,822 missing values generated)

{com}. bysort HospitalNumber (ecmo_cases_trauma_2016): replace ecmo_cases_trauma_2016 = ecmo_cases_trauma_2016[1]
{txt}(598,123 real changes made)

{com}. 
. *generating number of ECMO by trauma 2017*
. bysort HospitalNumber: egen ecmo_cases_trauma_2017 = count(DischargeID) if high_risk_group ==1 & ECMO_y_n == 1 & YearOfService ==2
{txt}(704,798 missing values generated)

{com}. bysort HospitalNumber (ecmo_cases_trauma_2017): replace ecmo_cases_trauma_2017 = ecmo_cases_trauma_2017[1]
{txt}(635,067 real changes made)

{com}. 
. *generating number of ECMO by trauma 2018*
. bysort HospitalNumber: egen ecmo_cases_trauma_2018 = count(DischargeID) if high_risk_group ==1 & ECMO_y_n == 1 & YearOfService ==3
{txt}(704,766 missing values generated)

{com}. bysort HospitalNumber (ecmo_cases_trauma_2018): replace ecmo_cases_trauma_2018 = ecmo_cases_trauma_2018[1]
{txt}(652,284 real changes made)

{com}. 
. *generating number of ECMO by trauma 2019*
. bysort HospitalNumber: egen ecmo_cases_trauma_2019 = count(DischargeID) if high_risk_group ==1 & ECMO_y_n == 1 & YearOfService ==4
{txt}(704,744 missing values generated)

{com}. bysort HospitalNumber (ecmo_cases_trauma_2019): replace ecmo_cases_trauma_2019 = ecmo_cases_trauma_2019[1]
{txt}(615,624 real changes made)

{com}. 
. *generating number of ECMO by trauma 2020*
. bysort HospitalNumber: egen ecmo_cases_trauma_2020 = count(DischargeID) if high_risk_group ==1 & ECMO_y_n == 1 & YearOfService ==5
{txt}(704,804 missing values generated)

{com}. bysort HospitalNumber (ecmo_cases_trauma_2020): replace ecmo_cases_trauma_2020 = ecmo_cases_trauma_2020[1]
{txt}(628,288 real changes made)

{com}. 
. *generating number of ECMO by trauma 2021*
. bysort HospitalNumber: egen ecmo_cases_trauma_2021 = count(DischargeID) if high_risk_group ==1 & ECMO_y_n == 1 & YearOfService ==6
{txt}(704,780 missing values generated)

{com}. bysort HospitalNumber (ecmo_cases_trauma_2021): replace ecmo_cases_trauma_2021 = ecmo_cases_trauma_2021[1]
{txt}(673,779 real changes made)

{com}. 
. *generating number of ECMO by trauma 2022*
. bysort HospitalNumber: egen ecmo_cases_trauma_2022 = count(DischargeID) if high_risk_group ==1 & ECMO_y_n == 1 & YearOfService ==7
{txt}(704,774 missing values generated)

{com}. bysort HospitalNumber (ecmo_cases_trauma_2022): replace ecmo_cases_trauma_2022 = ecmo_cases_trauma_2022[1]
{txt}(637,852 real changes made)

{com}. 
. *generating number of ECMO by trauma 2023*
. bysort HospitalNumber: egen ecmo_cases_trauma_2023 = count(DischargeID) if high_risk_group ==1 & ECMO_y_n == 1 & YearOfService ==8
{txt}(704,789 missing values generated)

{com}. bysort HospitalNumber (ecmo_cases_trauma_2016): replace ecmo_cases_trauma_2023 = ecmo_cases_trauma_2023[1]
{txt}(158 real changes made, 158 to missing)

{com}. 
. *generating number of ECMO by trauma 2024*
. bysort HospitalNumber: egen ecmo_cases_trauma_2024 = count(DischargeID) if high_risk_group ==1 & ECMO_y_n == 1 & YearOfService ==9
{txt}(704,820 missing values generated)

{com}. bysort HospitalNumber (ecmo_cases_trauma_2024): replace ecmo_cases_trauma_2024 = ecmo_cases_trauma_2024[1]
{txt}(637,566 real changes made)

{com}. 
. **TRISOMY ECMO**
. *generating number of ECMO by trisomy 2016*
. bysort HospitalNumber: egen ecmo_cases_trisomy_2016 = count(DischargeID) if high_risk_group ==0 & ECMO_y_n == 1 & YearOfService ==1
{txt}(704,946 missing values generated)

{com}. bysort HospitalNumber (ecmo_cases_trisomy_2016): replace ecmo_cases_trisomy_2016 = ecmo_cases_trisomy_2016[1]
{txt}(46,623 real changes made)

{com}. 
. *generating number of ECMO by trisomy 2017*
. bysort HospitalNumber: egen ecmo_cases_trisomy_2017 = count(DischargeID) if high_risk_group ==0 & ECMO_y_n == 1 & YearOfService ==2
{txt}(704,947 missing values generated)

{com}. bysort HospitalNumber (ecmo_cases_trisomy_2017): replace ecmo_cases_trisomy_2017 = ecmo_cases_trisomy_2017[1]
{txt}(0 real changes made)

{com}. 
. *generating number of ECMO by trisomy 2018*
. bysort HospitalNumber: egen ecmo_cases_trisomy_2018 = count(DischargeID) if high_risk_group ==0 & ECMO_y_n == 1 & YearOfService ==3
{txt}(704,943 missing values generated)

{com}. bysort HospitalNumber (ecmo_cases_trisomy_2018): replace ecmo_cases_trisomy_2018 = ecmo_cases_trisomy_2018[1]
{txt}(17,070 real changes made)

{com}. 
. *generating number of ECMO by trisomy 2019*
. bysort HospitalNumber: egen ecmo_cases_trisomy_2019 = count(DischargeID) if high_risk_group ==0 & ECMO_y_n == 1 & YearOfService ==4
{txt}(704,946 missing values generated)

{com}. bysort HospitalNumber (ecmo_cases_trisomy_2019): replace ecmo_cases_trisomy_2019 = ecmo_cases_trisomy_2019[1]
{txt}(6,721 real changes made)

{com}. 
. *generating number of ECMO by trisomy 2020*
. bysort HospitalNumber: egen ecmo_cases_trisomy_2020 = count(DischargeID) if high_risk_group ==0 & ECMO_y_n == 1 & YearOfService ==5
{txt}(704,944 missing values generated)

{com}. bysort HospitalNumber (ecmo_cases_trisomy_2020): replace ecmo_cases_trisomy_2020 = ecmo_cases_trisomy_2020[1]
{txt}(49,833 real changes made)

{com}. 
. *generating number of ECMO by trisomy 2021*
. bysort HospitalNumber: egen ecmo_cases_trisomy_2021 = count(DischargeID) if high_risk_group ==0 & ECMO_y_n == 1 & YearOfService ==6
{txt}(704,943 missing values generated)

{com}. bysort HospitalNumber (ecmo_cases_trisomy_2021): replace ecmo_cases_trisomy_2021 = ecmo_cases_trisomy_2021[1]
{txt}(96,483 real changes made)

{com}. 
. *generating number of ECMO by trisomy 2022*
. bysort HospitalNumber: egen ecmo_cases_trisomy_2022 = count(DischargeID) if high_risk_group ==0 & ECMO_y_n == 1 & YearOfService ==7
{txt}(704,946 missing values generated)

{com}. bysort HospitalNumber (ecmo_cases_trisomy_2022): replace ecmo_cases_trisomy_2022 = ecmo_cases_trisomy_2022[1]
{txt}(21,755 real changes made)

{com}. 
. *generating number of ECMO by trisomy 2023*
. bysort HospitalNumber: egen ecmo_cases_trisomy_2023 = count(DischargeID) if high_risk_group ==0 & ECMO_y_n == 1 & YearOfService ==8
{txt}(704,944 missing values generated)

{com}. bysort HospitalNumber (ecmo_cases_trisomy_2016): replace ecmo_cases_trisomy_2023 = ecmo_cases_trisomy_2023[1]
{txt}(3 real changes made, 3 to missing)

{com}. 
. *generating number of ECMO by trisomy 2024*
. bysort HospitalNumber: egen ecmo_cases_trisomy_2024 = count(DischargeID) if high_risk_group ==0 & ECMO_y_n == 1 & YearOfService ==9
{txt}(704,946 missing values generated)

{com}. bysort HospitalNumber (ecmo_cases_trisomy_2024): replace ecmo_cases_trisomy_2024 = ecmo_cases_trisomy_2024[1]
{txt}(11,977 real changes made)

{com}. 
. **ONC ECMO**
. *generating number of ECMO by onc 2016*
. bysort HospitalNumber: egen ecmo_cases_onc_2016 = count(DischargeID) if high_risk_group ==2 & ECMO_y_n == 1 & YearOfService ==1
{txt}(704,936 missing values generated)

{com}. bysort HospitalNumber (ecmo_cases_onc_2016): replace ecmo_cases_onc_2016 = ecmo_cases_onc_2016[1]
{txt}(173,033 real changes made)

{com}. 
. *generating number of ECMO by onc 2017*
. bysort HospitalNumber: egen ecmo_cases_onc_2017 = count(DischargeID) if high_risk_group ==2 & ECMO_y_n == 1 & YearOfService ==2
{txt}(704,936 missing values generated)

{com}. bysort HospitalNumber (ecmo_cases_onc_2017): replace ecmo_cases_onc_2017 = ecmo_cases_onc_2017[1]
{txt}(194,391 real changes made)

{com}. 
. *generating number of ECMO by onc 2018*
. bysort HospitalNumber: egen ecmo_cases_onc_2018 = count(DischargeID) if high_risk_group ==2 & ECMO_y_n == 1 & YearOfService ==3
{txt}(704,942 missing values generated)

{com}. bysort HospitalNumber (ecmo_cases_onc_2018): replace ecmo_cases_onc_2018 = ecmo_cases_onc_2018[1]
{txt}(120,445 real changes made)

{com}. 
. *generating number of ECMO by onc 2019*
. bysort HospitalNumber: egen ecmo_cases_onc_2019 = count(DischargeID) if high_risk_group ==2 & ECMO_y_n == 1 & YearOfService ==4
{txt}(704,935 missing values generated)

{com}. bysort HospitalNumber (ecmo_cases_onc_2019): replace ecmo_cases_onc_2019 = ecmo_cases_onc_2019[1]
{txt}(148,035 real changes made)

{com}. 
. *generating number of ECMO by onc 2020*
. bysort HospitalNumber: egen ecmo_cases_onc_2020 = count(DischargeID) if high_risk_group ==2 & ECMO_y_n == 1 & YearOfService ==5
{txt}(704,936 missing values generated)

{com}. bysort HospitalNumber (ecmo_cases_onc_2020): replace ecmo_cases_onc_2020 = ecmo_cases_onc_2020[1]
{txt}(160,021 real changes made)

{com}. 
. *generating number of ECMO by onc 2021*
. bysort HospitalNumber: egen ecmo_cases_onc_2021 = count(DischargeID) if high_risk_group ==2 & ECMO_y_n == 1 & YearOfService ==6
{txt}(704,938 missing values generated)

{com}. bysort HospitalNumber (ecmo_cases_onc_2021): replace ecmo_cases_onc_2021 = ecmo_cases_onc_2021[1]
{txt}(169,196 real changes made)

{com}. 
. *generating number of ECMO by onc 2022*
. bysort HospitalNumber: egen ecmo_cases_onc_2022 = count(DischargeID) if high_risk_group ==2 & ECMO_y_n == 1 & YearOfService ==7
{txt}(704,929 missing values generated)

{com}. bysort HospitalNumber (ecmo_cases_onc_2022): replace ecmo_cases_onc_2022 = ecmo_cases_onc_2022[1]
{txt}(248,478 real changes made)

{com}. 
. *generating number of ECMO by onc 2023*
. bysort HospitalNumber: egen ecmo_cases_onc_2023 = count(DischargeID) if high_risk_group ==2 & ECMO_y_n == 1 & YearOfService ==8
{txt}(704,932 missing values generated)

{com}. bysort HospitalNumber (ecmo_cases_onc_2016): replace ecmo_cases_onc_2023 = ecmo_cases_onc_2023[1]
{txt}(15 real changes made, 15 to missing)

{com}. 
. *generating number of ECMO by onc 2024*
. bysort HospitalNumber: egen ecmo_cases_onc_2024 = count(DischargeID) if high_risk_group ==2 & ECMO_y_n == 1 & YearOfService ==9
{txt}(704,934 missing values generated)

{com}. bysort HospitalNumber (ecmo_cases_onc_2024): replace ecmo_cases_onc_2024 = ecmo_cases_onc_2024[1]
{txt}(182,025 real changes made)

{com}. 
. **NOT HIGH RISK ECMO**
. *generating number of ECMO by not_high_risk 2016*
. bysort HospitalNumber: egen ecmo_cases_not_high_risk_2016 = count(DischargeID) if high_risk_group ==3 & ECMO_y_n == 1 & YearOfService ==1
{txt}(704,182 missing values generated)

{com}. bysort HospitalNumber (ecmo_cases_not_high_risk_2016): replace ecmo_cases_not_high_risk_2016 = ecmo_cases_not_high_risk_2016[1]
{txt}(688,514 real changes made)

{com}. 
. *generating number of ECMO by not_high_risk 2017*
. bysort HospitalNumber: egen ecmo_cases_not_high_risk_2017 = count(DischargeID) if high_risk_group ==3 & ECMO_y_n == 1 & YearOfService ==2
{txt}(704,034 missing values generated)

{com}. bysort HospitalNumber (ecmo_cases_not_high_risk_2017): replace ecmo_cases_not_high_risk_2017 = ecmo_cases_not_high_risk_2017[1]
{txt}(691,500 real changes made)

{com}. 
. *generating number of ECMO by not_high_risk 2018*
. bysort HospitalNumber: egen ecmo_cases_not_high_risk_2018 = count(DischargeID) if high_risk_group ==3 & ECMO_y_n == 1 & YearOfService ==3
{txt}(703,942 missing values generated)

{com}. bysort HospitalNumber (ecmo_cases_not_high_risk_2018): replace ecmo_cases_not_high_risk_2018 = ecmo_cases_not_high_risk_2018[1]
{txt}(683,639 real changes made)

{com}. 
. *generating number of ECMO by not_high_risk 2019*
. bysort HospitalNumber: egen ecmo_cases_not_high_risk_2019 = count(DischargeID) if high_risk_group ==3 & ECMO_y_n == 1 & YearOfService ==4
{txt}(703,996 missing values generated)

{com}. bysort HospitalNumber (ecmo_cases_not_high_risk_2019): replace ecmo_cases_not_high_risk_2019 = ecmo_cases_not_high_risk_2019[1]
{txt}(689,925 real changes made)

{com}. 
. *generating number of ECMO by not_high_risk 2020*
. bysort HospitalNumber: egen ecmo_cases_not_high_risk_2020 = count(DischargeID) if high_risk_group ==3 & ECMO_y_n == 1 & YearOfService ==5
{txt}(704,016 missing values generated)

{com}. bysort HospitalNumber (ecmo_cases_not_high_risk_2020): replace ecmo_cases_not_high_risk_2020 = ecmo_cases_not_high_risk_2020[1]
{txt}(697,695 real changes made)

{com}. 
. *generating number of ECMO by not_high_risk 2021*
. bysort HospitalNumber: egen ecmo_cases_not_high_risk_2021 = count(DischargeID) if high_risk_group ==3 & ECMO_y_n == 1 & YearOfService ==6
{txt}(703,799 missing values generated)

{com}. bysort HospitalNumber (ecmo_cases_not_high_risk_2021): replace ecmo_cases_not_high_risk_2021 = ecmo_cases_not_high_risk_2021[1]
{txt}(701,145 real changes made)

{com}. 
. *generating number of ECMO by not_high_risk 2022*
. bysort HospitalNumber: egen ecmo_cases_not_high_risk_2022 = count(DischargeID) if high_risk_group ==3 & ECMO_y_n == 1 & YearOfService ==7
{txt}(703,662 missing values generated)

{com}. bysort HospitalNumber (ecmo_cases_not_high_risk_2022): replace ecmo_cases_not_high_risk_2022 = ecmo_cases_not_high_risk_2022[1]
{txt}(702,605 real changes made)

{com}. 
. *generating number of ECMO by not_high_risk 2023*
. bysort HospitalNumber: egen ecmo_cases_not_high_risk_2023 = count(DischargeID) if high_risk_group ==3 & ECMO_y_n == 1 & YearOfService ==8
{txt}(703,775 missing values generated)

{com}. bysort HospitalNumber (ecmo_cases_not_high_risk_2016): replace ecmo_cases_not_high_risk_2023 = ecmo_cases_not_high_risk_2023[1]
{txt}(1,172 real changes made, 1,172 to missing)

{com}. 
. *generating number of ECMO by not_high_risk 2024*
. bysort HospitalNumber: egen ecmo_cases_not_high_risk_2024 = count(DischargeID) if high_risk_group ==3 & ECMO_y_n == 1 & YearOfService ==9
{txt}(703,947 missing values generated)

{com}. bysort HospitalNumber (ecmo_cases_not_high_risk_2024): replace ecmo_cases_not_high_risk_2024 = ecmo_cases_not_high_risk_2024[1]
{txt}(679,098 real changes made)

{com}. 
. **GENERATING CENTER TOTAL ADMISSIONS**
. bysort HospitalNumber: egen center_admissions = count(DischargeID) if AdmitYear == 1 | AdmitYear == 2 | AdmitYear == 3 | AdmitYear == 4 | AdmitYear == 5 | AdmitYear == 6 | AdmitYear == 7 | AdmitYear == 8 | AdmitYear == 9
{txt}
{com}. 
. **CENTER ADMISSIONS BY YEAR**
. 
. *generating center number of admissions by year (2016)*
. bysort HospitalNumber: egen center_admissions_2016= count(DischargeID) if AdmitYear ==1
{txt}(637,429 missing values generated)

{com}. bysort HospitalNumber (center_admissions_2016): replace center_admissions_2016= center_admissions_2016[1]
{txt}(631,108 real changes made)

{com}. 
. *generating center number of admissions by year (2017)*
. bysort HospitalNumber: egen center_admissions_2017= count(DischargeID) if AdmitYear ==2
{txt}(630,625 missing values generated)

{com}. bysort HospitalNumber (center_admissions_2017): replace center_admissions_2017 = center_admissions_2017[1]
{txt}(624,304 real changes made)

{com}. 
. *generating center number of admissions by year (2018)*
. bysort HospitalNumber: egen center_admissions_2018= count(DischargeID) if AdmitYear ==3
{txt}(626,242 missing values generated)

{com}. bysort HospitalNumber (center_admissions_2018): replace center_admissions_2018 = center_admissions_2018[1]
{txt}(619,921 real changes made)

{com}. 
. *generating center number of admissions by year (2019)*
. bysort HospitalNumber: egen center_admissions_2019= count(DischargeID) if AdmitYear ==4
{txt}(621,916 missing values generated)

{com}. bysort HospitalNumber (center_admissions_2019): replace center_admissions_2019 = center_admissions_2019[1]
{txt}(615,595 real changes made)

{com}. 
. *generating center number of admissions by year (2020)*
. bysort HospitalNumber: egen center_admissions_2020= count(DischargeID) if AdmitYear ==5
{txt}(642,665 missing values generated)

{com}. bysort HospitalNumber (center_admissions_2020): replace center_admissions_2020 = center_admissions_2020[1]
{txt}(640,011 real changes made)

{com}. 
. *generating center number of admissions by year (2021)*
. bysort HospitalNumber: egen center_admissions_2021= count(DischargeID) if AdmitYear ==6
{txt}(625,315 missing values generated)

{com}. bysort HospitalNumber (center_admissions_2021): replace center_admissions_2021 = center_admissions_2021[1]
{txt}(624,258 real changes made)

{com}. 
. *generating center number of admissions by year (2022)*
. bysort HospitalNumber: egen center_admissions_2022= count(DischargeID) if AdmitYear ==7
{txt}(615,125 missing values generated)

{com}. bysort HospitalNumber (center_admissions_2022): replace center_admissions_2022 = center_admissions_2022[1]
{txt}(615,125 real changes made)

{com}. 
. *generating center number of admissions by year (2023)*
. bysort HospitalNumber: egen center_admissions_2023= count(DischargeID) if AdmitYear ==8
{txt}(618,287 missing values generated)

{com}. bysort HospitalNumber (center_admissions_2023): replace center_admissions_2023= center_admissions_2023[1]
{txt}(618,287 real changes made)

{com}. 
. *generating center number of admissions by year (2024)*
. bysort HospitalNumber: egen center_admissions_2024= count(DischargeID) if AdmitYear ==9
{txt}(621,972 missing values generated)

{com}. bysort HospitalNumber (center_admissions_2024): replace center_admissions_2024 = center_admissions_2024[1]
{txt}(621,972 real changes made)

{com}. 
. egen total_admissions= count(DischargeID)
{txt}
{com}. 
. **CENTER ECMO CASES BY YEAR**
. 
. *generating center number of ecmo cases by year (2016)*
. bysort HospitalNumber: egen center_total_ecmo_2016= count(DischargeID) if YearOfService ==1 & ECMO_y_n ==1
{txt}(704,045 missing values generated)

{com}. bysort HospitalNumber (center_total_ecmo_2016): replace center_total_ecmo_2016= center_total_ecmo_2016[1]
{txt}(688,377 real changes made)

{com}. 
. *generating center number of ecmo cases by year (2017)*
. bysort HospitalNumber: egen center_total_ecmo_2017= count(DischargeID) if YearOfService ==2 & ECMO_y_n ==1
{txt}(703,874 missing values generated)

{com}. bysort HospitalNumber (center_total_ecmo_2017): replace center_total_ecmo_2017= center_total_ecmo_2017[1]
{txt}(691,340 real changes made)

{com}. 
. *generating center number of ecmo cases by year (2018)*
. bysort HospitalNumber: egen center_total_ecmo_2018= count(DischargeID) if YearOfService ==3 & ECMO_y_n ==1
{txt}(703,752 missing values generated)

{com}. bysort HospitalNumber (center_total_ecmo_2018): replace center_total_ecmo_2018= center_total_ecmo_2018[1]
{txt}(683,449 real changes made)

{com}. 
. *generating center number of ecmo cases by year (2019)*
. bysort HospitalNumber: egen center_total_ecmo_2019= count(DischargeID) if YearOfService ==4 & ECMO_y_n ==1
{txt}(703,780 missing values generated)

{com}. bysort HospitalNumber (center_total_ecmo_2019): replace center_total_ecmo_2019= center_total_ecmo_2019[1]
{txt}(697,459 real changes made)

{com}. 
. *generating center number of ecmo cases by year (2020)*
. bysort HospitalNumber: egen center_total_ecmo_2020= count(DischargeID) if YearOfService ==5 & ECMO_y_n ==1
{txt}(703,859 missing values generated)

{com}. bysort HospitalNumber (center_total_ecmo_2020): replace center_total_ecmo_2020 = center_total_ecmo_2020[1]
{txt}(697,538 real changes made)

{com}. 
. *generating center number of ecmo cases by year (2021)*
. bysort HospitalNumber: egen center_total_ecmo_2021= count(DischargeID) if YearOfService ==6 & ECMO_y_n ==1
{txt}(703,619 missing values generated)

{com}. bysort HospitalNumber (center_total_ecmo_2021): replace center_total_ecmo_2021 = center_total_ecmo_2021[1]
{txt}(700,965 real changes made)

{com}. 
. *generating center number of ecmo cases by year (2022)*
. bysort HospitalNumber: egen center_total_ecmo_2022= count(DischargeID) if YearOfService ==7 & ECMO_y_n ==1
{txt}(703,470 missing values generated)

{com}. bysort HospitalNumber (center_total_ecmo_2022): replace center_total_ecmo_2022 = center_total_ecmo_2022[1]
{txt}(702,413 real changes made)

{com}. 
. *generating center number of ecmo cases by year (2023)*
. bysort HospitalNumber: egen center_total_ecmo_2023= count(DischargeID) if YearOfService ==8 & ECMO_y_n ==1
{txt}(703,599 missing values generated)

{com}. bysort HospitalNumber (center_total_ecmo_2023): replace center_total_ecmo_2023 = center_total_ecmo_2023[1]
{txt}(703,599 real changes made)

{com}. 
. *generating center number of ecmo cases by year (2024)*
. bysort HospitalNumber: egen center_total_ecmo_2024= count(DischargeID) if YearOfService ==9 & ECMO_y_n ==1
{txt}(703,806 missing values generated)

{com}. bysort HospitalNumber (center_total_ecmo_2024): replace center_total_ecmo_2024 = center_total_ecmo_2024[1]
{txt}(678,957 real changes made)

{com}. 
. **GENERATING MEAN CENTER ADMISSIONS**
. 
. *generating mean number of admissions*
. egen mean_center_admissions = mean(center_admissions)
{txt}
{com}. 
. **GENERATING MEAN CENTER ECMO**
. *generating  mean number of ecmo cases*
. egen mean_center_totalecmo = mean(center_totalecmo)
{txt}
{com}. 
. *generating mean number of t13/t18 admissions*
. egen mean_number_of_casest1318 = mean(number_of_casest1318)
{txt}
{com}. 
. *generating mean number of trauma admissions*
. egen mean_number_of_casestrauma = mean(number_of_casestrauma)
{txt}
{com}. 
. *generating mean number of onc admissions*
. egen mean_number_of_casesonc = mean(number_of_casesonc)
{txt}
{com}. 
. **--**
. 
. *Generating Total Number of ECMO Cases - ALL CENTERS*
. egen total_ECMO = sum(ECMO_y_n)
{txt}
{com}. 
. *Generating Total Number of ECMO Cases T1318 - ALL CENTERS*
. egen total_ECMO_T1318 = sum(ECMO_y_n) if high_risk_group ==0
{txt}(701,456 missing values generated)

{com}. bysort total_ECMO_T1318: replace total_ECMO_T1318 = total_ECMO_T1318[1]
{txt}(0 real changes made)

{com}. 
. *Generating Total Number of ECMO Cases trauma - ALL CENTERS*
. egen total_ECMO_trauma = sum(ECMO_y_n) if high_risk_group ==1
{txt}(634,339 missing values generated)

{com}. bysort total_ECMO_trauma: replace total_ECMO_trauma = total_ECMO_trauma[1]
{txt}(0 real changes made)

{com}. 
. *Generating Total Number of ECMO Cases Onc - ALL CENTERS*
. egen total_ECMO_onc = sum(ECMO_y_n) if high_risk_group ==2
{txt}(670,279 missing values generated)

{com}. bysort total_ECMO_onc: replace total_ECMO_onc = total_ECMO_onc[1]
{txt}(0 real changes made)

{com}. 
. *Generating Total Number of ECMO Cases Not High Risk- ALL CENTERS*
. egen total_ECMO_not_hr = sum(ECMO_y_n) if high_risk_group ==3
{txt}(108,767 missing values generated)

{com}. bysort total_ECMO_not_hr: replace total_ECMO_not_hr = total_ECMO_not_hr[1]
{txt}(0 real changes made)

{com}. 
. bysort DischargeID: gen obsnum = _n
{txt}
{com}. 
. **GENERATING TOTAL ADMISSIONS BY YEAR **
. *2016*
. bysort obsnum: egen total_admissions_2016 = count(DischargeID) if YearOfService ==1 
{txt}(637,467 missing values generated)

{com}. sort total_admissions_2016 
{txt}
{com}. replace total_admissions_2016 = total_admissions_2016[1]
{txt}(637,467 real changes made)

{com}. 
. *2017*
. bysort obsnum: egen total_admissions_2017 = count(DischargeID) if YearOfService ==2 
{txt}(630,634 missing values generated)

{com}. sort total_admissions_2017 
{txt}
{com}. replace total_admissions_2017 = total_admissions_2017[1]
{txt}(630,634 real changes made)

{com}. 
. *2018*
. bysort obsnum: egen total_admissions_2018 = count(DischargeID) if YearOfService ==3 
{txt}(626,234 missing values generated)

{com}. sort total_admissions_2018 
{txt}
{com}. replace total_admissions_2018 = total_admissions_2018[1]
{txt}(626,234 real changes made)

{com}. 
. *2019*
. bysort obsnum: egen total_admissions_2019 = count(DischargeID) if YearOfService ==4 
{txt}(621,917 missing values generated)

{com}. sort total_admissions_2019 
{txt}
{com}. replace total_admissions_2019 = total_admissions_2019[1]
{txt}(621,917 real changes made)

{com}. 
. *2020*
. bysort obsnum: egen total_admissions_2020 = count(DischargeID) if YearOfService ==5 
{txt}(642,682 missing values generated)

{com}. sort total_admissions_2020 
{txt}
{com}. replace total_admissions_2020 = total_admissions_2020[1]
{txt}(642,682 real changes made)

{com}. 
. *2021*
. bysort obsnum: egen total_admissions_2021 = count(DischargeID) if YearOfService ==6 
{txt}(625,318 missing values generated)

{com}. sort total_admissions_2021 
{txt}
{com}. replace total_admissions_2021 = total_admissions_2021[1]
{txt}(625,318 real changes made)

{com}. 
. *2022*
. bysort obsnum: egen total_admissions_2022 = count(DischargeID) if YearOfService ==7 
{txt}(615,122 missing values generated)

{com}. sort total_admissions_2022 
{txt}
{com}. replace total_admissions_2022 = total_admissions_2022[1]
{txt}(615,122 real changes made)

{com}. 
. *2023*
. bysort obsnum: egen total_admissions_2023 = count(DischargeID) if YearOfService ==8 
{txt}(618,291 missing values generated)

{com}. sort total_admissions_2023 
{txt}
{com}. replace total_admissions_2023 = total_admissions_2023[1]
{txt}(618,291 real changes made)

{com}. 
. *2024*
. bysort obsnum: egen total_admissions_2024 = count(DischargeID) if YearOfService ==9 
{txt}(621,911 missing values generated)

{com}. sort total_admissions_2024 
{txt}
{com}. replace total_admissions_2024 = total_admissions_2024[1]
{txt}(621,911 real changes made)

{com}. 
. 
. *generating annual total admissions - All Patients*
. gen annual_total_admissions = .
{txt}(704,947 missing values generated)

{com}. 
. *2016
. replace annual_total_admissions = total_admissions_2016 if YearOfService ==1 
{txt}(67,480 real changes made)

{com}. bysort DischargeID: replace annual_total_admissions = annual_total_admissions[1]
{txt}(0 real changes made)

{com}. 
. *2017*
. replace annual_total_admissions = total_admissions_2017 if YearOfService ==2 
{txt}(74,313 real changes made)

{com}. bysort DischargeID: replace annual_total_admissions = annual_total_admissions[1]
{txt}(0 real changes made)

{com}. 
. *2018
. replace annual_total_admissions = total_admissions_2018 if YearOfService ==3 
{txt}(78,713 real changes made)

{com}. bysort DischargeID: replace annual_total_admissions = annual_total_admissions[1]
{txt}(0 real changes made)

{com}. 
. *2019*
. replace annual_total_admissions = total_admissions_2019 if YearOfService ==4 
{txt}(83,030 real changes made)

{com}. bysort DischargeID: replace annual_total_admissions = annual_total_admissions[1]
{txt}(0 real changes made)

{com}. 
. *2020*
. replace annual_total_admissions = total_admissions_2020 if YearOfService ==5 
{txt}(62,265 real changes made)

{com}. bysort DischargeID: replace annual_total_admissions = annual_total_admissions[1]
{txt}(0 real changes made)

{com}. 
. *2021*
. replace annual_total_admissions = total_admissions_2021 if YearOfService ==6 
{txt}(79,629 real changes made)

{com}. bysort DischargeID: replace annual_total_admissions = annual_total_admissions[1]
{txt}(0 real changes made)

{com}. 
. *2022*
. replace annual_total_admissions = total_admissions_2022 if YearOfService ==7 
{txt}(89,825 real changes made)

{com}. bysort DischargeID: replace annual_total_admissions = annual_total_admissions[1]
{txt}(0 real changes made)

{com}. 
. *2023*
. replace annual_total_admissions = total_admissions_2023 if YearOfService ==8 
{txt}(86,656 real changes made)

{com}. bysort DischargeID: replace annual_total_admissions = annual_total_admissions[1]
{txt}(0 real changes made)

{com}. 
. *2024*
. replace annual_total_admissions = total_admissions_2024 if YearOfService ==9 
{txt}(83,036 real changes made)

{com}. bysort DischargeID: replace annual_total_admissions = annual_total_admissions[1]
{txt}(0 real changes made)

{com}. 
. 
. **GENERATING TOTAL ECMO CASES BY YEAR - ALL CENTERS**
. *2016 ECMO Cases*
. bysort obsnum: egen total_ECMO_2016 = count(DischargeID) if ECMO_y_n == 1 & YearOfService ==1  
{txt}(704,045 missing values generated)

{com}. sort total_ECMO_2016
{txt}
{com}. replace total_ECMO_2016 = total_ECMO_2016[1]
{txt}(704,045 real changes made)

{com}. 
. 
. 
. *2017 ECMO Cases*
. bysort obsnum: egen total_ECMO_2017 = count(DischargeID) if ECMO_y_n == 1 & YearOfService ==2 
{txt}(703,874 missing values generated)

{com}. sort total_ECMO_2017
{txt}
{com}. replace total_ECMO_2017 = total_ECMO_2017[1]
{txt}(703,874 real changes made)

{com}. 
. 
. *2018 ECMO Cases*
. bysort obsnum: egen total_ECMO_2018 = count(DischargeID) if ECMO_y_n == 1 & YearOfService ==3 
{txt}(703,752 missing values generated)

{com}. sort total_ECMO_2018
{txt}
{com}. replace total_ECMO_2018 = total_ECMO_2018[1]
{txt}(703,752 real changes made)

{com}. 
. *2019 ECMO Cases*
. bysort obsnum: egen total_ECMO_2019 = count(DischargeID) if ECMO_y_n == 1 & YearOfService ==4 
{txt}(703,780 missing values generated)

{com}. sort total_ECMO_2019
{txt}
{com}. replace total_ECMO_2019 = total_ECMO_2019[1]
{txt}(703,780 real changes made)

{com}. 
. 
. *2020 ECMO Cases*
. bysort obsnum: egen total_ECMO_2020 = count(DischargeID) if ECMO_y_n == 1 & YearOfService ==5 
{txt}(703,859 missing values generated)

{com}. sort total_ECMO_2020
{txt}
{com}. replace total_ECMO_2020 = total_ECMO_2020[1]
{txt}(703,859 real changes made)

{com}. 
. 
. 
. *2021 ECMO Cases*
. bysort obsnum: egen total_ECMO_2021 = count(DischargeID) if ECMO_y_n == 1 & YearOfService ==6 
{txt}(703,619 missing values generated)

{com}. sort total_ECMO_2021
{txt}
{com}. replace total_ECMO_2021 = total_ECMO_2021[1]
{txt}(703,619 real changes made)

{com}. 
. 
. *2022 ECMO Cases*
. bysort obsnum: egen total_ECMO_2022 = count(DischargeID) if ECMO_y_n == 1 & YearOfService ==7 
{txt}(703,470 missing values generated)

{com}. sort total_ECMO_2022
{txt}
{com}. replace total_ECMO_2022 = total_ECMO_2022[1]
{txt}(703,470 real changes made)

{com}. 
. *2023 ECMO Cases*
. bysort obsnum: egen total_ECMO_2023 = count(DischargeID) if ECMO_y_n == 1 & YearOfService ==8 
{txt}(703,599 missing values generated)

{com}. sort total_ECMO_2023
{txt}
{com}. replace total_ECMO_2023 = total_ECMO_2023[1]
{txt}(703,599 real changes made)

{com}. 
. 
. *2024 ECMO Cases*
. bysort obsnum: egen total_ECMO_2024 = count(DischargeID) if ECMO_y_n == 1 & YearOfService ==9 
{txt}(703,806 missing values generated)

{com}. sort total_ECMO_2024
{txt}
{com}. replace total_ECMO_2024 = total_ECMO_2024[1]
{txt}(703,806 real changes made)

{com}. 
. **GENERATING ANNUAL TOTAL ECMO CASES BY YEAR**
. gen annual_total_ECMO =.
{txt}(704,947 missing values generated)

{com}. replace annual_total_ECMO = total_ECMO_2016 if YearOfService ==1  
{txt}(67,480 real changes made)

{com}. bysort HospitalNumber(obsnum): replace annual_total_ECMO = annual_total_ECMO
{txt}(0 real changes made)

{com}. replace annual_total_ECMO = total_ECMO_2017 if YearOfService ==2 
{txt}(74,313 real changes made)

{com}. bysort HospitalNumber(obsnum): replace annual_total_ECMO = annual_total_ECMO
{txt}(0 real changes made)

{com}. replace annual_total_ECMO = total_ECMO_2018 if YearOfService ==3
{txt}(78,713 real changes made)

{com}. bysort HospitalNumber(obsnum): replace annual_total_ECMO = annual_total_ECMO
{txt}(0 real changes made)

{com}. replace annual_total_ECMO = total_ECMO_2019 if YearOfService ==4 
{txt}(83,030 real changes made)

{com}. bysort HospitalNumber(obsnum): replace annual_total_ECMO = annual_total_ECMO
{txt}(0 real changes made)

{com}. replace annual_total_ECMO = total_ECMO_2020 if YearOfService ==5 
{txt}(62,265 real changes made)

{com}. bysort HospitalNumber(obsnum): replace annual_total_ECMO = annual_total_ECMO
{txt}(0 real changes made)

{com}. replace annual_total_ECMO = total_ECMO_2021 if YearOfService ==6 
{txt}(79,629 real changes made)

{com}. bysort HospitalNumber(obsnum): replace annual_total_ECMO = annual_total_ECMO
{txt}(0 real changes made)

{com}. replace annual_total_ECMO = total_ECMO_2022 if YearOfService ==7 
{txt}(89,825 real changes made)

{com}. bysort HospitalNumber(obsnum): replace annual_total_ECMO = annual_total_ECMO
{txt}(0 real changes made)

{com}. replace annual_total_ECMO = total_ECMO_2023 if YearOfService ==8 
{txt}(86,656 real changes made)

{com}. bysort HospitalNumber(obsnum): replace annual_total_ECMO = annual_total_ECMO
{txt}(0 real changes made)

{com}. replace annual_total_ECMO = total_ECMO_2024 if YearOfService ==9 
{txt}(83,036 real changes made)

{com}. bysort HospitalNumber(obsnum): replace annual_total_ECMO = annual_total_ECMO
{txt}(0 real changes made)

{com}. 
. **NOT HR**
. *Generating Not High Risk Admissions - ALL HOSPITALS*
. 
. **GENERATING TOTAL ADMISSIONS BY YEAR **
. *2016*
. **GENERATING TOTAL ADMISSIONS BY YEAR **
. *2016*
. bysort obsnum: egen total_admissions_2016_not_hr = count(DischargeID) if high_risk_group ==3 & YearOfService ==1 
{txt}(648,888 missing values generated)

{com}. sort total_admissions_2016_not_hr 
{txt}
{com}. replace total_admissions_2016_not_hr = total_admissions_2016_not_hr[1]
{txt}(648,888 real changes made)

{com}. 
. *2017*
. bysort obsnum: egen total_admissions_2017_not_hr = count(DischargeID) if high_risk_group ==3 & YearOfService ==2 
{txt}(643,130 missing values generated)

{com}. sort total_admissions_2017_not_hr 
{txt}
{com}. replace total_admissions_2017_not_hr = total_admissions_2017_not_hr[1]
{txt}(643,130 real changes made)

{com}. 
. *2018*
. bysort obsnum: egen total_admissions_2018_not_hr = count(DischargeID) if high_risk_group ==3 & YearOfService ==3 
{txt}(638,573 missing values generated)

{com}. sort total_admissions_2018_not_hr 
{txt}
{com}. replace total_admissions_2018_not_hr = total_admissions_2018_not_hr[1]
{txt}(638,573 real changes made)

{com}. 
. *2019*
. bysort obsnum: egen total_admissions_2019_not_hr = count(DischargeID) if high_risk_group ==3 & YearOfService ==4 
{txt}(634,221 missing values generated)

{com}. sort total_admissions_2019_not_hr 
{txt}
{com}. replace total_admissions_2019_not_hr = total_admissions_2019_not_hr[1]
{txt}(634,221 real changes made)

{com}. 
. *2020*
. bysort obsnum: egen total_admissions_2020_not_hr = count(DischargeID) if high_risk_group ==3 & YearOfService ==5 
{txt}(653,996 missing values generated)

{com}. sort total_admissions_2020_not_hr 
{txt}
{com}. replace total_admissions_2020_not_hr = total_admissions_2020_not_hr[1]
{txt}(653,996 real changes made)

{com}. 
. *2021*
. bysort obsnum: egen total_admissions_2021_not_hr = count(DischargeID) if high_risk_group ==3 & YearOfService ==6 
{txt}(637,661 missing values generated)

{com}. sort total_admissions_2021_not_hr 
{txt}
{com}. replace total_admissions_2021_not_hr = total_admissions_2021_not_hr[1]
{txt}(637,661 real changes made)

{com}. 
. *2022*
. bysort obsnum: egen total_admissions_2022_not_hr = count(DischargeID) if high_risk_group ==3 & YearOfService ==7 
{txt}(627,539 missing values generated)

{com}. sort total_admissions_2022_not_hr 
{txt}
{com}. replace total_admissions_2022_not_hr = total_admissions_2022_not_hr[1]
{txt}(627,539 real changes made)

{com}. 
. *2023*
. bysort obsnum: egen total_admissions_2023_not_hr = count(DischargeID) if high_risk_group ==3 & YearOfService ==8 
{txt}(630,733 missing values generated)

{com}. sort total_admissions_2023_not_hr 
{txt}
{com}. replace total_admissions_2023_not_hr = total_admissions_2023_not_hr[1]
{txt}(630,733 real changes made)

{com}. 
. *2024*
. bysort obsnum: egen total_admissions_2024_not_hr = count(DischargeID) if high_risk_group ==3 & YearOfService ==8 
{txt}(630,733 missing values generated)

{com}. sort total_admissions_2024_not_hr 
{txt}
{com}. replace total_admissions_2024_not_hr = total_admissions_2024_not_hr[1]
{txt}(630,733 real changes made)

{com}. 
. 
. *generating annual total admissions variable Not High Risk*
. gen annual_total_admissions_not_hr = .
{txt}(704,947 missing values generated)

{com}. *2016
. bysort DischargeID: replace annual_total_admissions_not_hr = total_admissions_2016_not_hr if YearOfService ==1 
{txt}(67,480 real changes made)

{com}. bysort DischargeID: replace annual_total_admissions_not_hr = annual_total_admissions_not_hr[1]
{txt}(0 real changes made)

{com}. 
. *2017*
. bysort DischargeID: replace annual_total_admissions_not_hr = total_admissions_2017_not_hr if YearOfService ==2 
{txt}(74,313 real changes made)

{com}. bysort DischargeID: replace annual_total_admissions_not_hr = annual_total_admissions_not_hr[1]
{txt}(0 real changes made)

{com}. 
. *2018
. bysort DischargeID: replace annual_total_admissions_not_hr = total_admissions_2018_not_hr if YearOfService ==3 
{txt}(78,713 real changes made)

{com}. 
. bysort DischargeID: replace annual_total_admissions_not_hr = annual_total_admissions_not_hr[1]
{txt}(0 real changes made)

{com}. 
. *2019*
. bysort DischargeID: replace annual_total_admissions_not_hr = total_admissions_2019_not_hr if YearOfService ==4 
{txt}(83,030 real changes made)

{com}. bysort DischargeID: replace annual_total_admissions_not_hr = annual_total_admissions_not_hr[1]
{txt}(0 real changes made)

{com}. 
. *2020*
. bysort DischargeID: replace annual_total_admissions_not_hr = total_admissions_2020_not_hr if YearOfService ==5 
{txt}(62,265 real changes made)

{com}. bysort DischargeID: replace annual_total_admissions_not_hr = annual_total_admissions_not_hr[1]
{txt}(0 real changes made)

{com}. 
. *2021*
. bysort DischargeID: replace annual_total_admissions_not_hr = total_admissions_2021_not_hr if YearOfService ==6 
{txt}(79,629 real changes made)

{com}. bysort DischargeID: replace annual_total_admissions_not_hr = annual_total_admissions_not_hr[1]
{txt}(0 real changes made)

{com}. 
. *2022*
. bysort DischargeID: replace annual_total_admissions_not_hr = total_admissions_2022_not_hr if YearOfService ==7 
{txt}(89,825 real changes made)

{com}. bysort DischargeID: replace annual_total_admissions_not_hr = annual_total_admissions_not_hr[1]
{txt}(0 real changes made)

{com}. 
. *2023*
. bysort DischargeID: replace annual_total_admissions_not_hr = total_admissions_2023_not_hr if YearOfService ==8 
{txt}(86,656 real changes made)

{com}. bysort DischargeID: replace annual_total_admissions_not_hr = annual_total_admissions_not_hr[1]
{txt}(0 real changes made)

{com}. 
. *2024*
. bysort DischargeID: replace annual_total_admissions_not_hr = total_admissions_2024_not_hr if YearOfService ==9 
{txt}(83,036 real changes made)

{com}. bysort DischargeID: replace annual_total_admissions_not_hr = annual_total_admissions_not_hr[1]
{txt}(0 real changes made)

{com}. 
. 
. **NOT HR ECMO**
. 
. **GENERATING TOTAL ECMO CASES NOT HIGH RISK BY YEAR - ALL CENTERS**
. *2016 ECMO Cases*
. *2016 ECMO Cases*
. bysort obsnum: egen total_ECMO_2016_not_hr_not_hr = count(DischargeID) if ECMO_y_n == 1 & high_risk_group ==3 & YearOfService ==1 
{txt}(704,182 missing values generated)

{com}. sort total_ECMO_2016_not_hr
{txt}
{com}. replace total_ECMO_2016_not_hr = total_ECMO_2016_not_hr[1]
{txt}(704,182 real changes made)

{com}. 
. *2017 ECMO Cases*
. bysort obsnum: egen total_ECMO_2017_not_hr = count(DischargeID) if ECMO_y_n == 1 & high_risk_group ==3 & YearOfService ==2 
{txt}(704,034 missing values generated)

{com}. sort total_ECMO_2017_not_hr
{txt}
{com}. replace total_ECMO_2017_not_hr = total_ECMO_2017_not_hr[1]
{txt}(704,034 real changes made)

{com}. 
. 
. *2018 ECMO Cases*
. bysort obsnum: egen total_ECMO_2018_not_hr = count(DischargeID) if ECMO_y_n == 1 & high_risk_group ==3 & YearOfService ==3 
{txt}(703,942 missing values generated)

{com}. sort total_ECMO_2018_not_hr
{txt}
{com}. replace total_ECMO_2018_not_hr = total_ECMO_2018_not_hr[1]
{txt}(703,942 real changes made)

{com}. 
. *2019 ECMO Cases*
. bysort obsnum: egen total_ECMO_2019_not_hr = count(DischargeID) if ECMO_y_n == 1 & high_risk_group ==3 & YearOfService ==4 
{txt}(703,996 missing values generated)

{com}. sort total_ECMO_2019_not_hr
{txt}
{com}. replace total_ECMO_2019_not_hr = total_ECMO_2019_not_hr[1]
{txt}(703,996 real changes made)

{com}. 
. 
. *2020 ECMO Cases*
. bysort obsnum: egen total_ECMO_2020_not_hr = count(DischargeID) if ECMO_y_n == 1 & high_risk_group ==3 & YearOfService ==5 
{txt}(704,016 missing values generated)

{com}. sort total_ECMO_2020_not_hr
{txt}
{com}. replace total_ECMO_2020_not_hr = total_ECMO_2020_not_hr[1]
{txt}(704,016 real changes made)

{com}. 
. 
. *2021 ECMO Cases*
. bysort obsnum: egen total_ECMO_2021_not_hr = count(DischargeID) if ECMO_y_n == 1 & high_risk_group ==3 & YearOfService ==6 
{txt}(703,799 missing values generated)

{com}. sort total_ECMO_2021_not_hr
{txt}
{com}. replace total_ECMO_2021_not_hr = total_ECMO_2021_not_hr[1]
{txt}(703,799 real changes made)

{com}. 
. 
. *2022 ECMO Cases*
. bysort obsnum: egen total_ECMO_2022_not_hr = count(DischargeID) if ECMO_y_n == 1 & high_risk_group ==3 & YearOfService ==7 
{txt}(703,662 missing values generated)

{com}. sort total_ECMO_2022_not_hr
{txt}
{com}. replace total_ECMO_2022_not_hr = total_ECMO_2022_not_hr[1]
{txt}(703,662 real changes made)

{com}. 
. *2023 ECMO Cases*
. bysort obsnum: egen total_ECMO_2023_not_hr = count(DischargeID) if ECMO_y_n == 1 & high_risk_group ==3 & YearOfService ==8 
{txt}(703,775 missing values generated)

{com}. sort total_ECMO_2023_not_hr
{txt}
{com}. replace total_ECMO_2023_not_hr = total_ECMO_2023_not_hr[1]
{txt}(703,775 real changes made)

{com}. 
. 
. *2024 ECMO Cases*
. bysort obsnum: egen total_ECMO_2024_not_hr = count(DischargeID) if ECMO_y_n == 1 & high_risk_group ==3 & YearOfService ==9 
{txt}(703,947 missing values generated)

{com}. sort total_ECMO_2024_not_hr
{txt}
{com}. replace total_ECMO_2024_not_hr = total_ECMO_2024_not_hr[1]
{txt}(703,947 real changes made)

{com}. 
. 
. **GENERATING ANNUAL TOTAL NOT HIGH RISK ECMO CASES BY YEAR**
. 
. bysort DischargeID: gen annual_total_ECMO_not_hr = total_ECMO_2016_not_hr if YearOfService ==1  
{txt}(637,467 missing values generated)

{com}. bysort DischargeID: replace annual_total_ECMO_not_hr = annual_total_ECMO_not_hr[1]
{txt}(0 real changes made)

{com}. replace annual_total_ECMO_not_hr = total_ECMO_2017_not_hr if YearOfService ==2 
{txt}(74,313 real changes made)

{com}. bysort DischargeID: replace annual_total_ECMO_not_hr = annual_total_ECMO_not_hr[1]
{txt}(0 real changes made)

{com}. replace annual_total_ECMO_not_hr = total_ECMO_2018_not_hr if YearOfService ==3
{txt}(78,713 real changes made)

{com}. bysort DischargeID: replace annual_total_ECMO_not_hr = annual_total_ECMO_not_hr[1]
{txt}(0 real changes made)

{com}. replace annual_total_ECMO_not_hr = total_ECMO_2019_not_hr if YearOfService ==4 
{txt}(83,030 real changes made)

{com}. bysort DischargeID: replace annual_total_ECMO_not_hr = annual_total_ECMO_not_hr[1]
{txt}(0 real changes made)

{com}. replace annual_total_ECMO_not_hr = total_ECMO_2020_not_hr if YearOfService ==5 
{txt}(62,265 real changes made)

{com}. bysort DischargeID: replace annual_total_ECMO_not_hr = annual_total_ECMO_not_hr[1]
{txt}(0 real changes made)

{com}. replace annual_total_ECMO_not_hr = total_ECMO_2021_not_hr if YearOfService ==6 
{txt}(79,629 real changes made)

{com}. bysort DischargeID: replace annual_total_ECMO_not_hr = annual_total_ECMO_not_hr[1]
{txt}(0 real changes made)

{com}. replace annual_total_ECMO_not_hr = total_ECMO_2022_not_hr if YearOfService ==7 
{txt}(89,825 real changes made)

{com}. bysort DischargeID: replace annual_total_ECMO_not_hr = annual_total_ECMO_not_hr[1]
{txt}(0 real changes made)

{com}. replace annual_total_ECMO_not_hr = total_ECMO_2023_not_hr if YearOfService ==8 
{txt}(86,656 real changes made)

{com}. bysort DischargeID: replace annual_total_ECMO_not_hr = annual_total_ECMO_not_hr[1]
{txt}(0 real changes made)

{com}. replace annual_total_ECMO_not_hr = total_ECMO_2024_not_hr if YearOfService ==9 
{txt}(83,036 real changes made)

{com}. bysort DischargeID: replace annual_total_ECMO_not_hr = annual_total_ECMO_not_hr[1]
{txt}(0 real changes made)

{com}.         
. **NOT HR REGRESSION**
. 
. **GENERATING SINGLE VARIABLE REGRESSION FOR ANNUAL TOTAL ECMO NOT HIGH RISK - ALL PATIENTS**
. 
. preserve
{txt}
{com}. 
. bysort YearOfService: keep if _n==1
{txt}(704,938 observations deleted)

{com}. browse
{txt}
{com}. 
. 
. drop if annual_total_ECMO_not_hr ==.
{txt}(0 observations deleted)

{com}. 
. tab annual_total_ECMO_not_hr YearOfService

{txt}annual_tot {c |}
al_ECMO_no {c |}                                          Year Of Service
      t_hr {c |}      2016       2017       2018       2019       2020       2021       2022       2023       2024 {c |}     Total
{hline 11}{c +}{hline 99}{c +}{hline 10}
       765 {c |}{res}         1          0          0          0          0          0          0          0          0 {txt}{c |}{res}         1 
{txt}       913 {c |}{res}         0          1          0          0          0          0          0          0          0 {txt}{c |}{res}         1 
{txt}       931 {c |}{res}         0          0          0          0          1          0          0          0          0 {txt}{c |}{res}         1 
{txt}       951 {c |}{res}         0          0          0          1          0          0          0          0          0 {txt}{c |}{res}         1 
{txt}      1000 {c |}{res}         0          0          0          0          0          0          0          0          1 {txt}{c |}{res}         1 
{txt}      1005 {c |}{res}         0          0          1          0          0          0          0          0          0 {txt}{c |}{res}         1 
{txt}      1148 {c |}{res}         0          0          0          0          0          1          0          0          0 {txt}{c |}{res}         1 
{txt}      1172 {c |}{res}         0          0          0          0          0          0          0          1          0 {txt}{c |}{res}         1 
{txt}      1285 {c |}{res}         0          0          0          0          0          0          1          0          0 {txt}{c |}{res}         1 
{txt}{hline 11}{c +}{hline 99}{c +}{hline 10}
     Total {c |}{res}         1          1          1          1          1          1          1          1          1 {txt}{c |}{res}         9 
{txt}
{com}. tab annual_total_admissions_not_hr YearOfService

{txt}annual_tot {c |}
al_admissi {c |}                                          Year Of Service
ons_not_hr {c |}      2016       2017       2018       2019       2020       2021       2022       2023       2024 {c |}     Total
{hline 11}{c +}{hline 99}{c +}{hline 10}
     50951 {c |}{res}         0          0          0          0          1          0          0          0          0 {txt}{c |}{res}         1 
{txt}     56059 {c |}{res}         1          0          0          0          0          0          0          0          0 {txt}{c |}{res}         1 
{txt}     61817 {c |}{res}         0          1          0          0          0          0          0          0          0 {txt}{c |}{res}         1 
{txt}     66374 {c |}{res}         0          0          1          0          0          0          0          0          0 {txt}{c |}{res}         1 
{txt}     67286 {c |}{res}         0          0          0          0          0          1          0          0          0 {txt}{c |}{res}         1 
{txt}     70726 {c |}{res}         0          0          0          1          0          0          0          0          0 {txt}{c |}{res}         1 
{txt}     74214 {c |}{res}         0          0          0          0          0          0          0          1          1 {txt}{c |}{res}         2 
{txt}     77408 {c |}{res}         0          0          0          0          0          0          1          0          0 {txt}{c |}{res}         1 
{txt}{hline 11}{c +}{hline 99}{c +}{hline 10}
     Total {c |}{res}         1          1          1          1          1          1          1          1          1 {txt}{c |}{res}         9 
{txt}
{com}. reg annual_total_ECMO_not_hr

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}         9
{txt}{hline 13}{c +}{hline 34}   F(0, 8)         = {res}     0.00
{txt}       Model {c |} {res}          0         0           .   {txt}Prob > F        ={res}         .
{txt}    Residual {c |} {res} 199482.889         8  24935.3611   {txt}R-squared       ={res}    0.0000
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0000
{txt}       Total {c |} {res} 199482.889         8  24935.3611   {txt}Root MSE        =   {res} 157.91

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}ann~O_not_hr{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}_cons {c |}{col 14}{res}{space 2} 1018.889{col 26}{space 2} 52.63645{col 37}{space 1}   19.36{col 46}{space 3}0.000{col 54}{space 4}  897.509{col 67}{space 3} 1140.269
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. reg annual_total_admissions_not_hr

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}         9
{txt}{hline 13}{c +}{hline 34}   F(0, 8)         = {res}     0.00
{txt}       Model {c |} {res}          0         0           .   {txt}Prob > F        ={res}         .
{txt}    Residual {c |} {res}  629171686         8  78646460.8   {txt}R-squared       ={res}    0.0000
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0000
{txt}       Total {c |} {res}  629171686         8  78646460.8   {txt}Root MSE        =   {res} 8868.3

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}ann~s_not_hr{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}_cons {c |}{col 14}{res}{space 2}    66561{col 26}{space 2} 2956.095{col 37}{space 1}   22.52{col 46}{space 3}0.000{col 54}{space 4} 59744.23{col 67}{space 3} 73377.77
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. reg annual_total_admissions_not_hr YearOfService

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}         9
{txt}{hline 13}{c +}{hline 34}   F(1, 7)         = {res}     5.43
{txt}       Model {c |} {res}  274942945         1   274942945   {txt}Prob > F        ={res}    0.0525
{txt}    Residual {c |} {res}  354228741         7  50604105.8   {txt}R-squared       ={res}    0.4370
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.3566
{txt}       Total {c |} {res}  629171686         8  78646460.8   {txt}Root MSE        =   {res} 7113.7

{txt}{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}annu~s_not_hr{col 15}{c |} Coefficient{col 27}  Std. err.{col 39}      t{col 47}   P>|t|{col 55}     [95% con{col 68}f. interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
YearOfService {c |}{col 15}{res}{space 2}  2140.65{col 27}{space 2} 918.3691{col 38}{space 1}    2.33{col 47}{space 3}0.053{col 55}{space 4}-30.94779{col 68}{space 3} 4312.248
{txt}{space 8}_cons {c |}{col 15}{res}{space 2} 55857.75{col 27}{space 2} 5167.951{col 38}{space 1}   10.81{col 47}{space 3}0.000{col 55}{space 4} 43637.49{col 68}{space 3} 68078.01
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. reg annual_total_ECMO_not_hr YearOfService annual_total_admissions_not_hr

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}         9
{txt}{hline 13}{c +}{hline 34}   F(2, 6)         = {res}     5.25
{txt}       Model {c |} {res} 126943.349         2  63471.6744   {txt}Prob > F        ={res}    0.0481
{txt}    Residual {c |} {res} 72539.5402         6  12089.9234   {txt}R-squared       ={res}    0.6364
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.5151
{txt}       Total {c |} {res} 199482.889         8  24935.3611   {txt}Root MSE        =   {res} 109.95

{txt}{hline 31}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}      annual_total_ECMO_not_hr{col 32}{c |} Coefficient{col 44}  Std. err.{col 56}      t{col 64}   P>|t|{col 72}     [95% con{col 85}f. interval]
{hline 31}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 17}YearOfService {c |}{col 32}{res}{space 2}  23.2743{col 44}{space 2} 18.91816{col 55}{space 1}    1.23{col 64}{space 3}0.265{col 72}{space 4}-23.01677{col 85}{space 3} 69.56536
{txt}annual_total_admissions_not_hr {c |}{col 32}{res}{space 2} .0083895{col 44}{space 2} .0058421{col 55}{space 1}    1.44{col 64}{space 3}0.201{col 72}{space 4}-.0059056{col 85}{space 3} .0226847
{txt}{space 25}_cons {c |}{col 32}{res}{space 2} 344.1022{col 44}{space 2} 335.9617{col 55}{space 1}    1.02{col 64}{space 3}0.345{col 72}{space 4}-477.9664{col 85}{space 3} 1166.171
{txt}{hline 31}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. restore
{txt}
{com}. 
. 
. *Generating Trisomy 13/18 Admissions - ALL HOSPITALS*
. 
. **GENERATING TOTAL ADMISSIONS BY YEAR **
. *2016*
. bysort obsnum: egen total_admissions_2016_T1318 = count(DischargeID) if high_risk_group ==0 & YearOfService ==1 
{txt}(704,680 missing values generated)

{com}. sort total_admissions_2016_T1318 
{txt}
{com}. replace total_admissions_2016_T1318 = total_admissions_2016_T1318[1]
{txt}(704,680 real changes made)

{com}. 
. *2017*
. bysort obsnum: egen total_admissions_2017_T1318 = count(DischargeID) if high_risk_group ==0 & YearOfService ==2 
{txt}(704,639 missing values generated)

{com}. sort total_admissions_2017_T1318 
{txt}
{com}. replace total_admissions_2017_T1318 = total_admissions_2017_T1318[1]
{txt}(704,639 real changes made)

{com}. 
. *2018*
. bysort obsnum: egen total_admissions_2018_T1318 = count(DischargeID) if high_risk_group ==0 & YearOfService ==3 
{txt}(704,565 missing values generated)

{com}. sort total_admissions_2018_T1318 
{txt}
{com}. replace total_admissions_2018_T1318 = total_admissions_2018_T1318[1]
{txt}(704,565 real changes made)

{com}. 
. *2019*
. bysort obsnum: egen total_admissions_2019_T1318 = count(DischargeID) if high_risk_group ==0 & YearOfService ==4 
{txt}(704,551 missing values generated)

{com}. sort total_admissions_2019_T1318 
{txt}
{com}. replace total_admissions_2019_T1318 = total_admissions_2019_T1318[1]
{txt}(704,551 real changes made)

{com}. 
. *2020*
. bysort obsnum: egen total_admissions_2020_T1318 = count(DischargeID) if high_risk_group ==0 & YearOfService ==5 
{txt}(704,637 missing values generated)

{com}. sort total_admissions_2020_T1318 
{txt}
{com}. replace total_admissions_2020_T1318 = total_admissions_2020_T1318[1]
{txt}(704,637 real changes made)

{com}. 
. *2021*
. bysort obsnum: egen total_admissions_2021_T1318 = count(DischargeID) if high_risk_group ==0 & YearOfService ==6 
{txt}(704,569 missing values generated)

{com}. sort total_admissions_2021_T1318 
{txt}
{com}. replace total_admissions_2021_T1318 = total_admissions_2021_T1318[1]
{txt}(704,569 real changes made)

{com}. 
. *2022*
. bysort obsnum: egen total_admissions_2022_T1318 = count(DischargeID) if high_risk_group ==0 & YearOfService ==7 
{txt}(704,501 missing values generated)

{com}. sort total_admissions_2022_T1318 
{txt}
{com}. replace total_admissions_2022_T1318 = total_admissions_2022_T1318[1]
{txt}(704,501 real changes made)

{com}. 
. *2023*
. bysort obsnum: egen total_admissions_2023_T1318 = count(DischargeID) if high_risk_group ==0 & YearOfService ==8 
{txt}(704,409 missing values generated)

{com}. sort total_admissions_2023_T1318 
{txt}
{com}. replace total_admissions_2023_T1318 = total_admissions_2023_T1318[1]
{txt}(704,409 real changes made)

{com}. 
. *2024*
. bysort obsnum: egen total_admissions_2024_T1318 = count(DischargeID) if high_risk_group ==0 & YearOfService ==8 
{txt}(704,409 missing values generated)

{com}. sort total_admissions_2024_T1318 
{txt}
{com}. replace total_admissions_2024_T1318 = total_admissions_2024_T1318[1]
{txt}(704,409 real changes made)

{com}. 
. 
. *generating annual total admissions variable t13/18*
. gen annual_total_admissions_T1318 = .
{txt}(704,947 missing values generated)

{com}. *2016
. bysort DischargeID: replace annual_total_admissions_T1318 = total_admissions_2016_T1318 if YearOfService ==1 
{txt}(67,480 real changes made)

{com}. bysort DischargeID: replace annual_total_admissions_T1318 = annual_total_admissions_T1318[1]
{txt}(0 real changes made)

{com}. 
. *2017*
. bysort DischargeID: replace annual_total_admissions_T1318 = total_admissions_2017_T1318 if YearOfService ==2 
{txt}(74,313 real changes made)

{com}. bysort DischargeID: replace annual_total_admissions_T1318 = annual_total_admissions_T1318[1]
{txt}(0 real changes made)

{com}. 
. *2018
. bysort DischargeID: replace annual_total_admissions_T1318 = total_admissions_2018_T1318 if YearOfService ==3
{txt}(78,713 real changes made)

{com}. bysort DischargeID: replace annual_total_admissions_T1318 = annual_total_admissions_T1318[1]
{txt}(0 real changes made)

{com}. 
. *2019*
. bysort DischargeID: replace annual_total_admissions_T1318 = total_admissions_2019_T1318 if YearOfService ==4 
{txt}(83,030 real changes made)

{com}. bysort DischargeID: replace annual_total_admissions_T1318 = annual_total_admissions_T1318[1]
{txt}(0 real changes made)

{com}. 
. *2020*
. bysort DischargeID: replace annual_total_admissions_T1318 = total_admissions_2020_T1318 if YearOfService ==5 
{txt}(62,265 real changes made)

{com}. bysort DischargeID: replace annual_total_admissions_T1318 = annual_total_admissions_T1318[1]
{txt}(0 real changes made)

{com}. 
. *2021*
. bysort DischargeID: replace annual_total_admissions_T1318 = total_admissions_2021_T1318 if YearOfService ==6 
{txt}(79,629 real changes made)

{com}. bysort DischargeID: replace annual_total_admissions_T1318 = annual_total_admissions_T1318[1]
{txt}(0 real changes made)

{com}. 
. *2022*
. bysort DischargeID: replace annual_total_admissions_T1318 = total_admissions_2022_T1318 if YearOfService ==7 
{txt}(89,825 real changes made)

{com}. bysort DischargeID: replace annual_total_admissions_T1318 = annual_total_admissions_T1318[1]
{txt}(0 real changes made)

{com}. 
. *2023*
. bysort DischargeID: replace annual_total_admissions_T1318 = total_admissions_2023_T1318 if YearOfService ==8 
{txt}(86,656 real changes made)

{com}. bysort DischargeID: replace annual_total_admissions_T1318 = annual_total_admissions_T1318[1]
{txt}(0 real changes made)

{com}. 
. *2024*
. bysort DischargeID: replace annual_total_admissions_T1318 = total_admissions_2024_T1318 if YearOfService ==9 
{txt}(83,036 real changes made)

{com}. bysort DischargeID: replace annual_total_admissions_T1318 = annual_total_admissions_T1318[1]
{txt}(0 real changes made)

{com}. **ECMO**
. 
. **GENERATING TOTAL ECMO CASES TRISOMY 13/18 BY YEAR - ALL CENTERS**
. *2016 ECMO Cases*
. *2016 ECMO Cases*
. bysort obsnum: egen total_ECMO_2016_T1318 = count(DischargeID) if ECMO_y_n == 1 & high_risk_group ==0 & YearOfService ==1 
{txt}(704,946 missing values generated)

{com}. sort total_ECMO_2016_T1318
{txt}
{com}. replace total_ECMO_2016_T1318 = total_ECMO_2016_T1318[1]
{txt}(704,946 real changes made)

{com}. replace total_ECMO_2016_T1318 = 0 if total_ECMO_2016_T1318 ==.
{txt}(0 real changes made)

{com}. 
. *2017 ECMO Cases*
. bysort obsnum: egen total_ECMO_2017_T1318 = count(DischargeID) if ECMO_y_n == 1 & high_risk_group ==0 & YearOfService ==2 
{txt}(704,947 missing values generated)

{com}. sort total_ECMO_2017_T1318
{txt}
{com}. replace total_ECMO_2017_T1318 = total_ECMO_2016_T1318[1]
{txt}(704,947 real changes made)

{com}. replace total_ECMO_2017_T1318 = 0 if total_ECMO_2017_T1318 ==.
{txt}(0 real changes made)

{com}. 
. *2018 ECMO Cases*
. bysort obsnum: egen total_ECMO_2018_T1318 = count(DischargeID) if ECMO_y_n == 1 & high_risk_group ==0 & YearOfService ==3 
{txt}(704,943 missing values generated)

{com}. sort total_ECMO_2018_T1318
{txt}
{com}. replace total_ECMO_2018_T1318 = total_ECMO_2018_T1318[1]
{txt}(704,943 real changes made)

{com}. 
. *2019 ECMO Cases*
. bysort obsnum: egen total_ECMO_2019_T1318 = count(DischargeID) if ECMO_y_n == 1 & high_risk_group ==0 & YearOfService ==4 
{txt}(704,946 missing values generated)

{com}. sort total_ECMO_2019_T1318
{txt}
{com}. replace total_ECMO_2019_T1318 = total_ECMO_2019_T1318[1]
{txt}(704,946 real changes made)

{com}. 
. 
. *2020 ECMO Cases*
. bysort obsnum: egen total_ECMO_2020_T1318 = count(DischargeID) if ECMO_y_n == 1 & high_risk_group ==0 & YearOfService ==5 
{txt}(704,944 missing values generated)

{com}. sort total_ECMO_2020_T1318
{txt}
{com}. replace total_ECMO_2020_T1318 = total_ECMO_2020_T1318[1]
{txt}(704,944 real changes made)

{com}. 
. 
. *2021 ECMO Cases*
. bysort obsnum: egen total_ECMO_2021_T1318 = count(DischargeID) if ECMO_y_n == 1 & high_risk_group ==0 & YearOfService ==6 
{txt}(704,943 missing values generated)

{com}. sort total_ECMO_2021_T1318
{txt}
{com}. replace total_ECMO_2021_T1318 = total_ECMO_2021_T1318[1]
{txt}(704,943 real changes made)

{com}. 
. 
. *2022 ECMO Cases*
. bysort obsnum: egen total_ECMO_2022_T1318 = count(DischargeID) if ECMO_y_n == 1 & high_risk_group ==0 & YearOfService ==7 
{txt}(704,946 missing values generated)

{com}. sort total_ECMO_2022_T1318
{txt}
{com}. replace total_ECMO_2022_T1318 = total_ECMO_2022_T1318[1]
{txt}(704,946 real changes made)

{com}. 
. *2023 ECMO Cases*
. bysort obsnum: egen total_ECMO_2023_T1318 = count(DischargeID) if ECMO_y_n == 1 & high_risk_group ==0 & YearOfService ==8 
{txt}(704,944 missing values generated)

{com}. sort total_ECMO_2023_T1318
{txt}
{com}. replace total_ECMO_2023_T1318 = total_ECMO_2023_T1318[1]
{txt}(704,944 real changes made)

{com}. 
. 
. *2024 ECMO Cases*
. bysort obsnum: egen total_ECMO_2024_T1318 = count(DischargeID) if ECMO_y_n == 1 & high_risk_group ==0 & YearOfService ==9 
{txt}(704,946 missing values generated)

{com}. sort total_ECMO_2024_T1318
{txt}
{com}. replace total_ECMO_2024_T1318 = total_ECMO_2024_T1318[1]
{txt}(704,946 real changes made)

{com}. 
. 
. **GENERATING ANNUAL TOTAL TRISOMY 1318 ECMO CASES **
. gen annual_total_ECMO_T1318 =.
{txt}(704,947 missing values generated)

{com}. 
. replace annual_total_ECMO_T1318 = total_ECMO_2016_T1318 if YearOfService ==1 
{txt}(67,480 real changes made)

{com}. replace annual_total_ECMO_T1318 = total_ECMO_2017_T1318 if YearOfService ==2 
{txt}(74,313 real changes made)

{com}. replace annual_total_ECMO_T1318 = total_ECMO_2018_T1318 if YearOfService ==3
{txt}(78,713 real changes made)

{com}. replace annual_total_ECMO_T1318 = total_ECMO_2019_T1318 if YearOfService ==4 
{txt}(83,030 real changes made)

{com}. replace annual_total_ECMO_T1318 = total_ECMO_2020_T1318 if YearOfService ==5 
{txt}(62,265 real changes made)

{com}. replace annual_total_ECMO_T1318 = total_ECMO_2021_T1318 if YearOfService ==6 
{txt}(79,629 real changes made)

{com}. replace annual_total_ECMO_T1318 = total_ECMO_2022_T1318 if YearOfService ==7 
{txt}(89,825 real changes made)

{com}. replace annual_total_ECMO_T1318 = total_ECMO_2023_T1318 if YearOfService ==8 
{txt}(86,656 real changes made)

{com}. replace annual_total_ECMO_T1318 = total_ECMO_2024_T1318 if YearOfService ==9 
{txt}(83,036 real changes made)

{com}. 
. **GENERATING SINGLE VARIABLE REGRESSION FOR ANNUAL TOTAL ECMO T1318 - ALL PATIENTS**
. 
. preserve
{txt}
{com}. 
. bysort YearOfService: keep if _n==1
{txt}(704,938 observations deleted)

{com}. browse
{txt}
{com}. 
. drop if annual_total_ECMO_T1318 ==.
{txt}(0 observations deleted)

{com}. 
. tab annual_total_ECMO_T1318 YearOfService

{txt}annual_tot {c |}
al_ECMO_T1 {c |}                                          Year Of Service
       318 {c |}      2016       2017       2018       2019       2020       2021       2022       2023       2024 {c |}     Total
{hline 11}{c +}{hline 99}{c +}{hline 10}
         1 {c |}{res}         1          1          0          1          0          0          1          0          1 {txt}{c |}{res}         5 
{txt}         3 {c |}{res}         0          0          0          0          1          0          0          1          0 {txt}{c |}{res}         2 
{txt}         4 {c |}{res}         0          0          1          0          0          1          0          0          0 {txt}{c |}{res}         2 
{txt}{hline 11}{c +}{hline 99}{c +}{hline 10}
     Total {c |}{res}         1          1          1          1          1          1          1          1          1 {txt}{c |}{res}         9 
{txt}
{com}. tab annual_total_admissions_T1318 YearOfService

{txt}annual_tot {c |}
al_admissi {c |}                                          Year Of Service
 ons_T1318 {c |}      2016       2017       2018       2019       2020       2021       2022       2023       2024 {c |}     Total
{hline 11}{c +}{hline 99}{c +}{hline 10}
       267 {c |}{res}         1          0          0          0          0          0          0          0          0 {txt}{c |}{res}         1 
{txt}       308 {c |}{res}         0          1          0          0          0          0          0          0          0 {txt}{c |}{res}         1 
{txt}       310 {c |}{res}         0          0          0          0          1          0          0          0          0 {txt}{c |}{res}         1 
{txt}       378 {c |}{res}         0          0          0          0          0          1          0          0          0 {txt}{c |}{res}         1 
{txt}       382 {c |}{res}         0          0          1          0          0          0          0          0          0 {txt}{c |}{res}         1 
{txt}       396 {c |}{res}         0          0          0          1          0          0          0          0          0 {txt}{c |}{res}         1 
{txt}       446 {c |}{res}         0          0          0          0          0          0          1          0          0 {txt}{c |}{res}         1 
{txt}       538 {c |}{res}         0          0          0          0          0          0          0          1          1 {txt}{c |}{res}         2 
{txt}{hline 11}{c +}{hline 99}{c +}{hline 10}
     Total {c |}{res}         1          1          1          1          1          1          1          1          1 {txt}{c |}{res}         9 
{txt}
{com}. 
. plot annual_total_admissions_T1318 YearOfService
{res}
     538 {txt}+  
    {res}a    {txt}|  
    {res}n    {txt}|                                                         *       *
    {res}n    {txt}|  
    {res}u    {txt}|  
    {res}a    {txt}|  
    {res}l    {txt}|  
    {res}_    {txt}|  
    {res}t    {txt}|                                                 *
    {res}o    {txt}|  
    {res}t    {txt}|  
    {res}a    {txt}|                         *
    {res}l    {txt}|                 *
    {res}_    {txt}|                                         *
    {res}a    {txt}|  
    {res}d    {txt}|  
    {res}m    {txt}|  
    {res}i    {txt}|                                 *
    {res}s    {txt}|         *
    {res}s    {txt}|  
{res}     267 {txt}+ *
          +----------------------------------------------------------------+
         {res}       1                 Year Of Service                        9

{txt}
{com}. 
. reg annual_total_ECMO_T1318

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}         9
{txt}{hline 13}{c +}{hline 34}   F(0, 8)         = {res}     0.00
{txt}       Model {c |} {res}          0         0           .   {txt}Prob > F        ={res}         .
{txt}    Residual {c |} {res} 14.8888889         8  1.86111111   {txt}R-squared       ={res}    0.0000
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0000
{txt}       Total {c |} {res} 14.8888889         8  1.86111111   {txt}Root MSE        =   {res} 1.3642

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}annu~O_T1318{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}_cons {c |}{col 14}{res}{space 2} 2.111111{col 26}{space 2} .4547418{col 37}{space 1}    4.64{col 46}{space 3}0.002{col 54}{space 4} 1.062475{col 67}{space 3} 3.159748
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. reg annual_total_ECMO_T1318 YearOfService

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}         9
{txt}{hline 13}{c +}{hline 34}   F(1, 7)         = {res}     0.07
{txt}       Model {c |} {res}        .15         1         .15   {txt}Prob > F        ={res}    0.7972
{txt}    Residual {c |} {res} 14.7388889         7  2.10555556   {txt}R-squared       ={res}    0.0101
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}   -0.1313
{txt}       Total {c |} {res} 14.8888889         8  1.86111111   {txt}Root MSE        =   {res} 1.4511

{txt}{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}annua~O_T1318{col 15}{c |} Coefficient{col 27}  Std. err.{col 39}      t{col 47}   P>|t|{col 55}     [95% con{col 68}f. interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
YearOfService {c |}{col 15}{res}{space 2}      .05{col 27}{space 2} .1873302{col 38}{space 1}    0.27{col 47}{space 3}0.797{col 55}{space 4}-.3929655{col 68}{space 3} .4929655
{txt}{space 8}_cons {c |}{col 15}{res}{space 2} 1.861111{col 27}{space 2} 1.054166{col 38}{space 1}    1.77{col 47}{space 3}0.121{col 55}{space 4}-.6315948{col 68}{space 3} 4.353817
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. reg annual_total_admissions_T1318

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}         9
{txt}{hline 13}{c +}{hline 34}   F(0, 8)         = {res}     0.00
{txt}       Model {c |} {res}          0         0           .   {txt}Prob > F        ={res}         .
{txt}    Residual {c |} {res} 75128.8889         8  9391.11111   {txt}R-squared       ={res}    0.0000
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0000
{txt}       Total {c |} {res} 75128.8889         8  9391.11111   {txt}Root MSE        =   {res} 96.908

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}annu~s_T1318{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}_cons {c |}{col 14}{res}{space 2} 395.8889{col 26}{space 2} 32.30258{col 37}{space 1}   12.26{col 46}{space 3}0.000{col 54}{space 4}  321.399{col 67}{space 3} 470.3788
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. reg annual_total_admissions_T1318 YearOfService

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}         9
{txt}{hline 13}{c +}{hline 34}   F(1, 7)         = {res}    25.93
{txt}       Model {c |} {res}    59157.6         1     59157.6   {txt}Prob > F        ={res}    0.0014
{txt}    Residual {c |} {res} 15971.2889         7   2281.6127   {txt}R-squared       ={res}    0.7874
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.7570
{txt}       Total {c |} {res} 75128.8889         8  9391.11111   {txt}Root MSE        =   {res} 47.766

{txt}{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}annua~s_T1318{col 15}{c |} Coefficient{col 27}  Std. err.{col 39}      t{col 47}   P>|t|{col 55}     [95% con{col 68}f. interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
YearOfService {c |}{col 15}{res}{space 2}     31.4{col 27}{space 2} 6.166594{col 38}{space 1}    5.09{col 47}{space 3}0.001{col 55}{space 4} 16.81832{col 68}{space 3} 45.98168
{txt}{space 8}_cons {c |}{col 15}{res}{space 2} 238.8889{col 27}{space 2} 34.70136{col 38}{space 1}    6.88{col 47}{space 3}0.000{col 55}{space 4} 156.8332{col 68}{space 3} 320.9446
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. reg annual_total_ECMO_T1318 YearOfService annual_total_admissions_T1318

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}         9
{txt}{hline 13}{c +}{hline 34}   F(2, 6)         = {res}     0.11
{txt}       Model {c |} {res} .522086237         2  .261043119   {txt}Prob > F        ={res}    0.8984
{txt}    Residual {c |} {res} 14.3668027         6  2.39446711   {txt}R-squared       ={res}    0.0351
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}   -0.2866
{txt}       Total {c |} {res} 14.8888889         8  1.86111111   {txt}Root MSE        =   {res} 1.5474

{txt}{hline 30}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}      annual_total_ECMO_T1318{col 31}{c |} Coefficient{col 43}  Std. err.{col 55}      t{col 63}   P>|t|{col 71}     [95% con{col 84}f. interval]
{hline 30}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 16}YearOfService {c |}{col 31}{res}{space 2} .2015589{col 43}{space 2} .4332737{col 54}{space 1}    0.47{col 63}{space 3}0.658{col 71}{space 4}-.8586236{col 84}{space 3} 1.261741
{txt}annual_total_admissions_T1318 {c |}{col 31}{res}{space 2}-.0048267{col 43}{space 2} .0122443{col 54}{space 1}   -0.39{col 63}{space 3}0.707{col 71}{space 4}-.0347875{col 84}{space 3}  .025134
{txt}{space 24}_cons {c |}{col 31}{res}{space 2}  3.01416{col 43}{space 2} 3.133616{col 54}{space 1}    0.96{col 63}{space 3}0.373{col 71}{space 4}-4.653522{col 84}{space 3} 10.68184
{txt}{hline 30}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. restore
{txt}
{com}. 
. *Generating Trauma Admissions - ALL HOSPITALS*
. 
. bysort obsnum: egen total_admissions_trauma = count(DischargeID) if high_risk_group ==1
{txt}(634,339 missing values generated)

{com}. bysort HospitalNumber (total_admissions_trauma): replace total_admissions_trauma = total_admissions_trauma[1]
{txt}(634,339 real changes made)

{com}. 
. **Generating Not High Risk Admissions by Year Trauma - ALL Hospitals**
. **GENERATING TOTAL ADMISSIONS BY YEAR **
. *2016*
. bysort obsnum: egen total_admissions_2016_trauma = count(DischargeID) if high_risk_group ==1 & YearOfService ==1 
{txt}(697,552 missing values generated)

{com}. sort total_admissions_2016_trauma 
{txt}
{com}. replace total_admissions_2016_trauma = total_admissions_2016_trauma[1]
{txt}(697,552 real changes made)

{com}. 
. *2017*
. bysort obsnum: egen total_admissions_2017_trauma = count(DischargeID) if high_risk_group ==1 & YearOfService ==2 
{txt}(696,807 missing values generated)

{com}. sort total_admissions_2017_trauma 
{txt}
{com}. replace total_admissions_2017_trauma = total_admissions_2017_trauma[1]
{txt}(696,807 real changes made)

{com}. 
. *2018*
. bysort obsnum: egen total_admissions_2018_trauma = count(DischargeID) if high_risk_group ==1 & YearOfService ==3 
{txt}(696,912 missing values generated)

{com}. sort total_admissions_2018_trauma 
{txt}
{com}. replace total_admissions_2018_trauma = total_admissions_2018_trauma[1]
{txt}(696,912 real changes made)

{com}. 
. *2019*
. bysort obsnum: egen total_admissions_2019_trauma = count(DischargeID) if high_risk_group ==1 & YearOfService ==4 
{txt}(696,864 missing values generated)

{com}. sort total_admissions_2019_trauma 
{txt}
{com}. replace total_admissions_2019_trauma = total_admissions_2019_trauma[1]
{txt}(696,864 real changes made)

{com}. 
. *2020*
. bysort obsnum: egen total_admissions_2020_trauma = count(DischargeID) if high_risk_group ==1 & YearOfService ==5 
{txt}(697,542 missing values generated)

{com}. sort total_admissions_2020_trauma 
{txt}
{com}. replace total_admissions_2020_trauma = total_admissions_2020_trauma[1]
{txt}(697,542 real changes made)

{com}. 
. *2021*
. bysort obsnum: egen total_admissions_2021_trauma = count(DischargeID) if high_risk_group ==1 & YearOfService ==6 
{txt}(696,920 missing values generated)

{com}. sort total_admissions_2021_trauma 
{txt}
{com}. replace total_admissions_2021_trauma = total_admissions_2021_trauma[1]
{txt}(696,920 real changes made)

{com}. 
. *2022*
. bysort obsnum: egen total_admissions_2022_trauma = count(DischargeID) if high_risk_group ==1 & YearOfService ==7 
{txt}(696,914 missing values generated)

{com}. sort total_admissions_2022_trauma 
{txt}
{com}. replace total_admissions_2022_trauma = total_admissions_2022_trauma[1]
{txt}(696,914 real changes made)

{com}. 
. *2023*
. bysort obsnum: egen total_admissions_2023_trauma = count(DischargeID) if high_risk_group ==1 & YearOfService ==8 
{txt}(696,923 missing values generated)

{com}. sort total_admissions_2023_trauma 
{txt}
{com}. replace total_admissions_2023_trauma = total_admissions_2023_trauma[1]
{txt}(696,923 real changes made)

{com}. 
. *2024*
. bysort obsnum: egen total_admissions_2024_trauma = count(DischargeID) if high_risk_group ==1 & YearOfService ==8 
{txt}(696,923 missing values generated)

{com}. sort total_admissions_2024_trauma 
{txt}
{com}. replace total_admissions_2024_trauma = total_admissions_2024_trauma[1]
{txt}(696,923 real changes made)

{com}. 
. 
. *generating annual total admissions variable trauma*
. gen annual_total_admissions_trauma = .
{txt}(704,947 missing values generated)

{com}. 
. *2016
. bysort DischargeID: replace annual_total_admissions_trauma = total_admissions_2016_trauma if YearOfService ==1 
{txt}(67,480 real changes made)

{com}. bysort DischargeID: replace annual_total_admissions_trauma = annual_total_admissions_trauma[1]
{txt}(0 real changes made)

{com}. 
. *2017*
. bysort DischargeID: replace annual_total_admissions_trauma = total_admissions_2017_trauma if YearOfService ==2 
{txt}(74,313 real changes made)

{com}. bysort DischargeID: replace annual_total_admissions_trauma = annual_total_admissions_trauma[1]
{txt}(0 real changes made)

{com}. 
. *2018
. bysort DischargeID: replace annual_total_admissions_trauma = total_admissions_2018_trauma if YearOfService ==3 
{txt}(78,713 real changes made)

{com}. bysort DischargeID: replace annual_total_admissions_trauma = annual_total_admissions_trauma[1]
{txt}(0 real changes made)

{com}. 
. *2019*
. bysort DischargeID: replace annual_total_admissions_trauma = total_admissions_2019_trauma if YearOfService ==4 
{txt}(83,030 real changes made)

{com}. bysort DischargeID: replace annual_total_admissions_trauma = annual_total_admissions_trauma[1]
{txt}(0 real changes made)

{com}. 
. *2020*
. bysort DischargeID: replace annual_total_admissions_trauma = total_admissions_2020_trauma if YearOfService ==5 
{txt}(62,265 real changes made)

{com}. bysort DischargeID: replace annual_total_admissions_trauma = annual_total_admissions_trauma[1]
{txt}(0 real changes made)

{com}. 
. *2021*
. bysort DischargeID: replace annual_total_admissions_trauma = total_admissions_2021_trauma if YearOfService ==6 
{txt}(79,629 real changes made)

{com}. bysort DischargeID: replace annual_total_admissions_trauma = annual_total_admissions_trauma[1]
{txt}(0 real changes made)

{com}. 
. *2022*
. bysort DischargeID: replace annual_total_admissions_trauma = total_admissions_2022_trauma if YearOfService ==7 
{txt}(89,825 real changes made)

{com}. bysort DischargeID: replace annual_total_admissions_trauma = annual_total_admissions_trauma[1]
{txt}(0 real changes made)

{com}. 
. *2023*
. bysort DischargeID: replace annual_total_admissions_trauma = total_admissions_2023_trauma if YearOfService ==8 
{txt}(86,656 real changes made)

{com}. bysort DischargeID: replace annual_total_admissions_trauma = annual_total_admissions_trauma[1]
{txt}(0 real changes made)

{com}. 
. *2024*
. bysort DischargeID: replace annual_total_admissions_trauma = total_admissions_2024_trauma if YearOfService ==9 
{txt}(83,036 real changes made)

{com}. bysort DischargeID: replace annual_total_admissions_trauma = annual_total_admissions_trauma[1]
{txt}(0 real changes made)

{com}. 
. 
. 
. **GENERATING TOTAL ECMO CASES Trauma BY YEAR - ALL CENTERS**
. *2016 ECMO Cases*
. bysort obsnum: egen total_ECMO_2016_trauma = count(DischargeID) if ECMO_y_n == 1 & high_risk_group ==1 & YearOfService ==1 
{txt}(704,822 missing values generated)

{com}. sort total_ECMO_2016_trauma
{txt}
{com}. replace total_ECMO_2016_trauma = total_ECMO_2016_trauma[1]
{txt}(704,822 real changes made)

{com}. 
. *2017 ECMO Cases*
. bysort obsnum: egen total_ECMO_2017_trauma = count(DischargeID) if ECMO_y_n == 1 & high_risk_group ==1 & YearOfService ==2 
{txt}(704,798 missing values generated)

{com}. sort total_ECMO_2017_trauma
{txt}
{com}. replace total_ECMO_2017_trauma = total_ECMO_2017_trauma[1]
{txt}(704,798 real changes made)

{com}. 
. 
. *2018 ECMO Cases*
. bysort obsnum: egen total_ECMO_2018_trauma = count(DischargeID) if ECMO_y_n == 1 & high_risk_group ==1 & YearOfService ==3 
{txt}(704,766 missing values generated)

{com}. sort total_ECMO_2018_trauma
{txt}
{com}. replace total_ECMO_2018_trauma = total_ECMO_2018_trauma[1]
{txt}(704,766 real changes made)

{com}. 
. *2019 ECMO Cases*
. bysort obsnum: egen total_ECMO_2019_trauma = count(DischargeID) if ECMO_y_n == 1 & high_risk_group ==1 & YearOfService ==4 
{txt}(704,744 missing values generated)

{com}. sort total_ECMO_2019_trauma
{txt}
{com}. replace total_ECMO_2019_trauma = total_ECMO_2019_trauma[1]
{txt}(704,744 real changes made)

{com}. 
. 
. *2020 ECMO Cases*
. bysort obsnum: egen total_ECMO_2020_trauma = count(DischargeID) if ECMO_y_n == 1 & high_risk_group ==1 & YearOfService ==5 
{txt}(704,804 missing values generated)

{com}. sort total_ECMO_2020_trauma
{txt}
{com}. replace total_ECMO_2020_trauma = total_ECMO_2020_trauma[1]
{txt}(704,804 real changes made)

{com}. 
. 
. *2021 ECMO Cases*
. bysort obsnum: egen total_ECMO_2021_trauma = count(DischargeID) if ECMO_y_n == 1 & high_risk_group ==1 & YearOfService ==6 
{txt}(704,780 missing values generated)

{com}. sort total_ECMO_2021_trauma
{txt}
{com}. replace total_ECMO_2021_trauma = total_ECMO_2021_trauma[1]
{txt}(704,780 real changes made)

{com}. 
. 
. *2022 ECMO Cases*
. bysort obsnum: egen total_ECMO_2022_trauma = count(DischargeID) if ECMO_y_n == 1 & high_risk_group ==1 & YearOfService ==7 
{txt}(704,774 missing values generated)

{com}. sort total_ECMO_2022_trauma
{txt}
{com}. replace total_ECMO_2022_trauma = total_ECMO_2022_trauma[1]
{txt}(704,774 real changes made)

{com}. 
. *2023 ECMO Cases*
. bysort obsnum: egen total_ECMO_2023_trauma = count(DischargeID) if ECMO_y_n == 1 & high_risk_group ==1 & YearOfService ==8 
{txt}(704,789 missing values generated)

{com}. sort total_ECMO_2023_trauma
{txt}
{com}. replace total_ECMO_2023_trauma = total_ECMO_2023_trauma[1]
{txt}(704,789 real changes made)

{com}. 
. 
. *2024 ECMO Cases*
. bysort obsnum: egen total_ECMO_2024_trauma = count(DischargeID) if ECMO_y_n == 1 & high_risk_group ==1 & YearOfService ==9 
{txt}(704,820 missing values generated)

{com}. sort total_ECMO_2024_trauma
{txt}
{com}. replace total_ECMO_2024_trauma = total_ECMO_2024_trauma[1]
{txt}(704,820 real changes made)

{com}. 
. 
. 
. 
. **GENERATING TOTAL TRAUMA ECMO CASES BY YEAR**
. gen annual_total_ECMO_trauma =.
{txt}(704,947 missing values generated)

{com}. 
. replace annual_total_ECMO_trauma = total_ECMO_2016_trauma if YearOfService ==1 
{txt}(67,480 real changes made)

{com}. replace annual_total_ECMO_trauma = total_ECMO_2017_trauma if YearOfService ==2 
{txt}(74,313 real changes made)

{com}. replace annual_total_ECMO_trauma = total_ECMO_2018_trauma if YearOfService ==3
{txt}(78,713 real changes made)

{com}. replace annual_total_ECMO_trauma = total_ECMO_2019_trauma if YearOfService ==4 
{txt}(83,030 real changes made)

{com}. replace annual_total_ECMO_trauma = total_ECMO_2020_trauma if YearOfService ==5 
{txt}(62,265 real changes made)

{com}. replace annual_total_ECMO_trauma = total_ECMO_2021_trauma if YearOfService ==6 
{txt}(79,629 real changes made)

{com}. replace annual_total_ECMO_trauma = total_ECMO_2022_trauma if YearOfService ==7 
{txt}(89,825 real changes made)

{com}. replace annual_total_ECMO_trauma = total_ECMO_2023_trauma if YearOfService ==8 
{txt}(86,656 real changes made)

{com}. replace annual_total_ECMO_trauma = total_ECMO_2024_trauma if YearOfService ==9 
{txt}(83,036 real changes made)

{com}. 
. 
. 
. **GENERATING SINGLE VARIABLE REGRESSION FOR ANNUAL TRAUMA TOTAL ECMO - ALL PATIENTS**
. 
. preserve
{txt}
{com}. 
. bysort YearOfService: keep if _n==1
{txt}(704,938 observations deleted)

{com}. browse
{txt}
{com}. 
. drop if annual_total_ECMO_trauma ==.
{txt}(0 observations deleted)

{com}. 
. tab annual_total_ECMO_trauma YearOfService

{txt}annual_tot {c |}
al_ECMO_tr {c |}                                          Year Of Service
      auma {c |}      2016       2017       2018       2019       2020       2021       2022       2023       2024 {c |}     Total
{hline 11}{c +}{hline 99}{c +}{hline 10}
       125 {c |}{res}         1          0          0          0          0          0          0          0          0 {txt}{c |}{res}         1 
{txt}       127 {c |}{res}         0          0          0          0          0          0          0          0          1 {txt}{c |}{res}         1 
{txt}       143 {c |}{res}         0          0          0          0          1          0          0          0          0 {txt}{c |}{res}         1 
{txt}       149 {c |}{res}         0          1          0          0          0          0          0          0          0 {txt}{c |}{res}         1 
{txt}       158 {c |}{res}         0          0          0          0          0          0          0          1          0 {txt}{c |}{res}         1 
{txt}       167 {c |}{res}         0          0          0          0          0          1          0          0          0 {txt}{c |}{res}         1 
{txt}       173 {c |}{res}         0          0          0          0          0          0          1          0          0 {txt}{c |}{res}         1 
{txt}       181 {c |}{res}         0          0          1          0          0          0          0          0          0 {txt}{c |}{res}         1 
{txt}       203 {c |}{res}         0          0          0          1          0          0          0          0          0 {txt}{c |}{res}         1 
{txt}{hline 11}{c +}{hline 99}{c +}{hline 10}
     Total {c |}{res}         1          1          1          1          1          1          1          1          1 {txt}{c |}{res}         9 
{txt}
{com}. tab annual_total_admissions_trauma YearOfService 

{txt}annual_tot {c |}
al_admissi {c |}                                          Year Of Service
ons_trauma {c |}      2016       2017       2018       2019       2020       2021       2022       2023       2024 {c |}     Total
{hline 11}{c +}{hline 99}{c +}{hline 10}
      7395 {c |}{res}         1          0          0          0          0          0          0          0          0 {txt}{c |}{res}         1 
{txt}      7405 {c |}{res}         0          0          0          0          1          0          0          0          0 {txt}{c |}{res}         1 
{txt}      8024 {c |}{res}         0          0          0          0          0          0          0          1          1 {txt}{c |}{res}         2 
{txt}      8027 {c |}{res}         0          0          0          0          0          1          0          0          0 {txt}{c |}{res}         1 
{txt}      8033 {c |}{res}         0          0          0          0          0          0          1          0          0 {txt}{c |}{res}         1 
{txt}      8035 {c |}{res}         0          0          1          0          0          0          0          0          0 {txt}{c |}{res}         1 
{txt}      8083 {c |}{res}         0          0          0          1          0          0          0          0          0 {txt}{c |}{res}         1 
{txt}      8140 {c |}{res}         0          1          0          0          0          0          0          0          0 {txt}{c |}{res}         1 
{txt}{hline 11}{c +}{hline 99}{c +}{hline 10}
     Total {c |}{res}         1          1          1          1          1          1          1          1          1 {txt}{c |}{res}         9 
{txt}
{com}. 
. reg annual_total_ECMO_trauma

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}         9
{txt}{hline 13}{c +}{hline 34}   F(0, 8)         = {res}     0.00
{txt}       Model {c |} {res}          0         0           .   {txt}Prob > F        ={res}         .
{txt}    Residual {c |} {res} 5214.22222         8  651.777778   {txt}R-squared       ={res}    0.0000
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0000
{txt}       Total {c |} {res} 5214.22222         8  651.777778   {txt}Root MSE        =   {res}  25.53

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}ann~O_trauma{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}_cons {c |}{col 14}{res}{space 2} 158.4444{col 26}{space 2}  8.50998{col 37}{space 1}   18.62{col 46}{space 3}0.000{col 54}{space 4} 138.8204{col 67}{space 3} 178.0685
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. reg annual_total_admissions_trauma

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}         9
{txt}{hline 13}{c +}{hline 34}   F(0, 8)         = {res}     0.00
{txt}       Model {c |} {res}          0         0           .   {txt}Prob > F        ={res}         .
{txt}    Residual {c |} {res}     673450         8    84181.25   {txt}R-squared       ={res}    0.0000
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0000
{txt}       Total {c |} {res}     673450         8    84181.25   {txt}Root MSE        =   {res} 290.14

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}ann~s_trauma{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}_cons {c |}{col 14}{res}{space 2} 7907.333{col 26}{space 2} 96.71335{col 37}{space 1}   81.76{col 46}{space 3}0.000{col 54}{space 4} 7684.312{col 67}{space 3} 8130.355
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. reg annual_total_admissions_trauma YearOfService

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}         9
{txt}{hline 13}{c +}{hline 34}   F(1, 7)         = {res}     0.86
{txt}       Model {c |} {res} 74061.0667         1  74061.0667   {txt}Prob > F        ={res}    0.3833
{txt}    Residual {c |} {res} 599388.933         7  85626.9905   {txt}R-squared       ={res}    0.1100
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}   -0.0172
{txt}       Total {c |} {res}     673450         8    84181.25   {txt}Root MSE        =   {res} 292.62

{txt}{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}annu~s_trauma{col 15}{c |} Coefficient{col 27}  Std. err.{col 39}      t{col 47}   P>|t|{col 55}     [95% con{col 68}f. interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
YearOfService {c |}{col 15}{res}{space 2} 35.13333{col 27}{space 2}  37.7772{col 38}{space 1}    0.93{col 47}{space 3}0.383{col 55}{space 4}-54.19554{col 68}{space 3} 124.4622
{txt}{space 8}_cons {c |}{col 15}{res}{space 2} 7731.667{col 27}{space 2} 212.5842{col 38}{space 1}   36.37{col 47}{space 3}0.000{col 55}{space 4} 7228.985{col 68}{space 3} 8234.348
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. reg annual_total_ECMO_trauma YearOfService annual_total_admissions_trauma

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}         9
{txt}{hline 13}{c +}{hline 34}   F(2, 6)         = {res}     1.63
{txt}       Model {c |} {res} 1836.22353         2  918.111765   {txt}Prob > F        ={res}    0.2719
{txt}    Residual {c |} {res} 3377.99869         6  562.999782   {txt}R-squared       ={res}    0.3522
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.1362
{txt}       Total {c |} {res} 5214.22222         8  651.777778   {txt}Root MSE        =   {res} 23.728

{txt}{hline 31}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}      annual_total_ECMO_trauma{col 32}{c |} Coefficient{col 44}  Std. err.{col 56}      t{col 64}   P>|t|{col 72}     [95% con{col 85}f. interval]
{hline 31}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 17}YearOfService {c |}{col 32}{res}{space 2} -2.22537{col 44}{space 2} 3.246959{col 55}{space 1}   -0.69{col 64}{space 3}0.519{col 72}{space 4}-10.17039{col 85}{space 3} 5.719653
{txt}annual_total_admissions_trauma {c |}{col 32}{res}{space 2} .0552762{col 44}{space 2} .0306478{col 55}{space 1}    1.80{col 64}{space 3}0.121{col 72}{space 4}-.0197164{col 85}{space 3} .1302687
{txt}{space 25}_cons {c |}{col 32}{res}{space 2}-267.5159{col 44}{space 2}  237.585{col 55}{space 1}   -1.13{col 64}{space 3}0.303{col 72}{space 4}-848.8654{col 85}{space 3} 313.8336
{txt}{hline 31}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. restore
{txt}
{com}. 
. 
. *Generating Onc Admissions - ALL HOSPITALS*
. 
. bysort obsnum: egen total_admissions_onc = count(DischargeID) if high_risk_group ==2
{txt}(670,279 missing values generated)

{com}. bysort HospitalNumber (total_admissions_onc): replace total_admissions_onc = total_admissions_onc[1]
{txt}(670,279 real changes made)

{com}. 
. **Generating Onc Admissions by Year - ALL Hospitals**
. **Generating Not High Risk Admissions by Year - ALL Hospitals**
. **GENERATING TOTAL ADMISSIONS BY YEAR **
. *2016*
. bysort obsnum: egen total_admissions_2016_onc = count(DischargeID) if high_risk_group ==2 & YearOfService ==1 
{txt}(701,188 missing values generated)

{com}. sort total_admissions_2016_onc 
{txt}
{com}. replace total_admissions_2016_onc = total_admissions_2016_onc[1]
{txt}(701,188 real changes made)

{com}. 
. *2017*
. bysort obsnum: egen total_admissions_2017_onc = count(DischargeID) if high_risk_group ==2 & YearOfService ==2 
{txt}(700,899 missing values generated)

{com}. sort total_admissions_2017_onc 
{txt}
{com}. replace total_admissions_2017_onc = total_admissions_2017_onc[1]
{txt}(700,899 real changes made)

{com}. 
. *2018*
. bysort obsnum: egen total_admissions_2018_onc = count(DischargeID) if high_risk_group ==2 & YearOfService ==3 
{txt}(701,025 missing values generated)

{com}. sort total_admissions_2018_onc 
{txt}
{com}. replace total_admissions_2018_onc = total_admissions_2018_onc[1]
{txt}(701,025 real changes made)

{com}. 
. *2019*
. bysort obsnum: egen total_admissions_2019_onc = count(DischargeID) if high_risk_group ==2 & YearOfService ==4 
{txt}(701,122 missing values generated)

{com}. sort total_admissions_2019_onc 
{txt}
{com}. replace total_admissions_2019_onc = total_admissions_2019_onc[1]
{txt}(701,122 real changes made)

{com}. 
. *2020*
. bysort obsnum: egen total_admissions_2020_onc = count(DischargeID) if high_risk_group ==2 & YearOfService ==5 
{txt}(701,348 missing values generated)

{com}. sort total_admissions_2020_onc 
{txt}
{com}. replace total_admissions_2020_onc = total_admissions_2020_onc[1]
{txt}(701,348 real changes made)

{com}. 
. *2021*
. bysort obsnum: egen total_admissions_2021_onc = count(DischargeID) if high_risk_group ==2 & YearOfService ==6 
{txt}(701,009 missing values generated)

{com}. sort total_admissions_2021_onc 
{txt}
{com}. replace total_admissions_2021_onc = total_admissions_2021_onc[1]
{txt}(701,009 real changes made)

{com}. 
. *2022*
. bysort obsnum: egen total_admissions_2022_onc = count(DischargeID) if high_risk_group ==2 & YearOfService ==7 
{txt}(701,009 missing values generated)

{com}. sort total_admissions_2022_onc 
{txt}
{com}. replace total_admissions_2022_onc = total_admissions_2022_onc[1]
{txt}(701,009 real changes made)

{com}. 
. *2023*
. bysort obsnum: egen total_admissions_2023_onc = count(DischargeID) if high_risk_group ==2 & YearOfService ==8 
{txt}(701,067 missing values generated)

{com}. sort total_admissions_2023_onc 
{txt}
{com}. replace total_admissions_2023_onc = total_admissions_2023_onc[1]
{txt}(701,067 real changes made)

{com}. 
. *2024*
. bysort obsnum: egen total_admissions_2024_onc = count(DischargeID) if high_risk_group ==2 & YearOfService ==8 
{txt}(701,067 missing values generated)

{com}. sort total_admissions_2024_onc 
{txt}
{com}. replace total_admissions_2024_onc = total_admissions_2024_onc[1]
{txt}(701,067 real changes made)

{com}. 
. **generating annual total admissions variable onc**
. gen annual_total_admissions_onc = .
{txt}(704,947 missing values generated)

{com}. 
. *2016
. bysort DischargeID: replace annual_total_admissions_onc = total_admissions_2016_onc if YearOfService ==1 
{txt}(67,480 real changes made)

{com}. bysort DischargeID: replace annual_total_admissions_onc = annual_total_admissions_onc[1]
{txt}(0 real changes made)

{com}. 
. *2017*
. bysort DischargeID: replace annual_total_admissions_onc = total_admissions_2017_onc if YearOfService ==2 
{txt}(74,313 real changes made)

{com}. bysort DischargeID: replace annual_total_admissions_onc = annual_total_admissions_onc[1]
{txt}(0 real changes made)

{com}. 
. *2018
. bysort DischargeID: replace annual_total_admissions_onc = total_admissions_2018_onc if YearOfService ==3
{txt}(78,713 real changes made)

{com}. bysort DischargeID: replace annual_total_admissions_onc = annual_total_admissions_onc[1]
{txt}(0 real changes made)

{com}. 
. *2019*
. bysort DischargeID: replace annual_total_admissions_onc = total_admissions_2019_onc if YearOfService ==4 
{txt}(83,030 real changes made)

{com}. bysort DischargeID: replace annual_total_admissions_onc = annual_total_admissions_onc[1]
{txt}(0 real changes made)

{com}. 
. *2020*
. bysort DischargeID: replace annual_total_admissions_onc = total_admissions_2020_onc if YearOfService ==5 
{txt}(62,265 real changes made)

{com}. bysort DischargeID: replace annual_total_admissions_onc = annual_total_admissions_onc[1]
{txt}(0 real changes made)

{com}. 
. *2021*
. bysort DischargeID: replace annual_total_admissions_onc = total_admissions_2021_onc if YearOfService ==6 
{txt}(79,629 real changes made)

{com}. bysort DischargeID: replace annual_total_admissions_onc = annual_total_admissions_onc[1]
{txt}(0 real changes made)

{com}. 
. *2022*
. bysort DischargeID: replace annual_total_admissions_onc = total_admissions_2022_onc if YearOfService ==7 
{txt}(89,825 real changes made)

{com}. bysort DischargeID: replace annual_total_admissions_onc = annual_total_admissions_onc[1]
{txt}(0 real changes made)

{com}. 
. *2023*
. bysort DischargeID: replace annual_total_admissions_onc = total_admissions_2023_onc if YearOfService ==8 
{txt}(86,656 real changes made)

{com}. bysort DischargeID: replace annual_total_admissions_onc = annual_total_admissions_onc[1]
{txt}(0 real changes made)

{com}. 
. *2024*
. bysort DischargeID: replace annual_total_admissions_onc = total_admissions_2024_onc if YearOfService ==9 
{txt}(83,036 real changes made)

{com}. bysort DischargeID: replace annual_total_admissions_onc = annual_total_admissions_onc[1]
{txt}(0 real changes made)

{com}. 
. **GENERATING TOTAL ECMO CASES ONC BY YEAR - ALL CENTERS**
. *2016 ECMO Cases*
. bysort obsnum: egen total_ECMO_2016_onc = count(DischargeID) if ECMO_y_n == 1 & high_risk_group ==2 & YearOfService ==1 
{txt}(704,936 missing values generated)

{com}. sort total_ECMO_2016_onc
{txt}
{com}. replace total_ECMO_2016_onc = total_ECMO_2016_onc[1]
{txt}(704,936 real changes made)

{com}. 
. *2017 ECMO Cases*
. bysort obsnum: egen total_ECMO_2017_onc = count(DischargeID) if ECMO_y_n == 1 & high_risk_group ==2 & YearOfService ==2 
{txt}(704,936 missing values generated)

{com}. sort total_ECMO_2017_onc
{txt}
{com}. replace total_ECMO_2017_onc = total_ECMO_2017_onc[1]
{txt}(704,936 real changes made)

{com}. 
. 
. *2018 ECMO Cases*
. bysort obsnum: egen total_ECMO_2018_onc = count(DischargeID) if ECMO_y_n == 1 & high_risk_group ==2 & YearOfService ==3 
{txt}(704,942 missing values generated)

{com}. sort total_ECMO_2018_onc
{txt}
{com}. replace total_ECMO_2018_onc = total_ECMO_2018_onc[1]
{txt}(704,942 real changes made)

{com}. 
. *2019 ECMO Cases*
. bysort obsnum: egen total_ECMO_2019_onc = count(DischargeID) if ECMO_y_n == 1 & high_risk_group ==2 & YearOfService ==4 
{txt}(704,935 missing values generated)

{com}. sort total_ECMO_2019_onc
{txt}
{com}. replace total_ECMO_2019_onc = total_ECMO_2019_onc[1]
{txt}(704,935 real changes made)

{com}. 
. 
. *2020 ECMO Cases*
. bysort obsnum: egen total_ECMO_2020_onc = count(DischargeID) if ECMO_y_n == 1 & high_risk_group ==2 & YearOfService ==5 
{txt}(704,936 missing values generated)

{com}. sort total_ECMO_2020_onc
{txt}
{com}. replace total_ECMO_2020_onc = total_ECMO_2020_onc[1]
{txt}(704,936 real changes made)

{com}. 
. 
. *2021 ECMO Cases*
. bysort obsnum: egen total_ECMO_2021_onc = count(DischargeID) if ECMO_y_n == 1 & high_risk_group ==2 & YearOfService ==6 
{txt}(704,938 missing values generated)

{com}. sort total_ECMO_2021_onc
{txt}
{com}. replace total_ECMO_2021_onc = total_ECMO_2021_onc[1]
{txt}(704,938 real changes made)

{com}. 
. 
. *2022 ECMO Cases*
. bysort obsnum: egen total_ECMO_2022_onc = count(DischargeID) if ECMO_y_n == 1 & high_risk_group ==2 & YearOfService ==7 
{txt}(704,929 missing values generated)

{com}. sort total_ECMO_2022_onc
{txt}
{com}. replace total_ECMO_2022_onc = total_ECMO_2022_onc[1]
{txt}(704,929 real changes made)

{com}. 
. *2023 ECMO Cases*
. bysort obsnum: egen total_ECMO_2023_onc = count(DischargeID) if ECMO_y_n == 1 & high_risk_group ==2 & YearOfService ==8 
{txt}(704,932 missing values generated)

{com}. sort total_ECMO_2023_onc
{txt}
{com}. replace total_ECMO_2023_onc = total_ECMO_2023_onc[1]
{txt}(704,932 real changes made)

{com}. 
. 
. *2024 ECMO Cases*
. bysort obsnum: egen total_ECMO_2024_onc = count(DischargeID) if ECMO_y_n == 1 & high_risk_group ==2 & YearOfService ==9 
{txt}(704,934 missing values generated)

{com}. sort total_ECMO_2024_onc
{txt}
{com}. replace total_ECMO_2024_onc = total_ECMO_2024_onc[1]
{txt}(704,934 real changes made)

{com}. 
. 
. 
. 
. **GENERATING TOTAL ONC ECMO CASES BY YEAR**
. gen annual_total_ECMO_onc =.
{txt}(704,947 missing values generated)

{com}. 
. replace annual_total_ECMO_onc = total_ECMO_2016_onc if YearOfService ==1 
{txt}(67,480 real changes made)

{com}. replace annual_total_ECMO_onc = total_ECMO_2017_onc if YearOfService ==2 
{txt}(74,313 real changes made)

{com}. replace annual_total_ECMO_onc = total_ECMO_2018_onc if YearOfService ==3
{txt}(78,713 real changes made)

{com}. replace annual_total_ECMO_onc = total_ECMO_2019_onc if YearOfService ==4 
{txt}(83,030 real changes made)

{com}. replace annual_total_ECMO_onc = total_ECMO_2020_onc if YearOfService ==5 
{txt}(62,265 real changes made)

{com}. replace annual_total_ECMO_onc = total_ECMO_2021_onc if YearOfService ==6 
{txt}(79,629 real changes made)

{com}. replace annual_total_ECMO_onc = total_ECMO_2022_onc if YearOfService ==7 
{txt}(89,825 real changes made)

{com}. replace annual_total_ECMO_onc = total_ECMO_2023_onc if YearOfService ==8 
{txt}(86,656 real changes made)

{com}. replace annual_total_ECMO_onc = total_ECMO_2024_onc if YearOfService ==9 
{txt}(83,036 real changes made)

{com}. 
. 
. 
. 
. **GENERATING SINGLE VARIABLE REGRESSION FOR ANNUAL ONC TOTAL ECMO - ALL PATIENTS**
. 
. preserve
{txt}
{com}. 
. bysort YearOfService: keep if _n==1
{txt}(704,938 observations deleted)

{com}. browse
{txt}
{com}. 
. drop if annual_total_ECMO_onc ==.
{txt}(0 observations deleted)

{com}. 
. tab annual_total_ECMO_onc YearOfService

{txt}annual_tot {c |}
al_ECMO_on {c |}                                          Year Of Service
         c {c |}      2016       2017       2018       2019       2020       2021       2022       2023       2024 {c |}     Total
{hline 11}{c +}{hline 99}{c +}{hline 10}
         5 {c |}{res}         0          0          1          0          0          0          0          0          0 {txt}{c |}{res}         1 
{txt}         9 {c |}{res}         0          0          0          0          0          1          0          0          0 {txt}{c |}{res}         1 
{txt}        11 {c |}{res}         1          1          0          0          1          0          0          0          0 {txt}{c |}{res}         3 
{txt}        12 {c |}{res}         0          0          0          1          0          0          0          0          0 {txt}{c |}{res}         1 
{txt}        13 {c |}{res}         0          0          0          0          0          0          0          0          1 {txt}{c |}{res}         1 
{txt}        15 {c |}{res}         0          0          0          0          0          0          0          1          0 {txt}{c |}{res}         1 
{txt}        18 {c |}{res}         0          0          0          0          0          0          1          0          0 {txt}{c |}{res}         1 
{txt}{hline 11}{c +}{hline 99}{c +}{hline 10}
     Total {c |}{res}         1          1          1          1          1          1          1          1          1 {txt}{c |}{res}         9 
{txt}
{com}. tab annual_total_admissions_onc YearOfService

{txt}annual_tot {c |}
al_admissi {c |}                                          Year Of Service
   ons_onc {c |}      2016       2017       2018       2019       2020       2021       2022       2023       2024 {c |}     Total
{hline 11}{c +}{hline 99}{c +}{hline 10}
      3599 {c |}{res}         0          0          0          0          1          0          0          0          0 {txt}{c |}{res}         1 
{txt}      3759 {c |}{res}         1          0          0          0          0          0          0          0          0 {txt}{c |}{res}         1 
{txt}      3825 {c |}{res}         0          0          0          1          0          0          0          0          0 {txt}{c |}{res}         1 
{txt}      3880 {c |}{res}         0          0          0          0          0          0          0          1          1 {txt}{c |}{res}         2 
{txt}      3922 {c |}{res}         0          0          1          0          0          0          0          0          0 {txt}{c |}{res}         1 
{txt}      3938 {c |}{res}         0          0          0          0          0          1          1          0          0 {txt}{c |}{res}         2 
{txt}      4048 {c |}{res}         0          1          0          0          0          0          0          0          0 {txt}{c |}{res}         1 
{txt}{hline 11}{c +}{hline 99}{c +}{hline 10}
     Total {c |}{res}         1          1          1          1          1          1          1          1          1 {txt}{c |}{res}         9 
{txt}
{com}. 
. reg annual_total_admissions_onc

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}         9
{txt}{hline 13}{c +}{hline 34}   F(0, 8)         = {res}     0.00
{txt}       Model {c |} {res}          0         0           .   {txt}Prob > F        ={res}         .
{txt}    Residual {c |} {res} 131436.222         8  16429.5278   {txt}R-squared       ={res}    0.0000
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0000
{txt}       Total {c |} {res} 131436.222         8  16429.5278   {txt}Root MSE        =   {res} 128.18

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}annual~s_onc{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}_cons {c |}{col 14}{res}{space 2} 3865.444{col 26}{space 2} 42.72591{col 37}{space 1}   90.47{col 46}{space 3}0.000{col 54}{space 4} 3766.918{col 67}{space 3} 3963.971
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. reg annual_total_admissions_onc YearOfService

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}         9
{txt}{hline 13}{c +}{hline 34}   F(1, 7)         = {res}     0.01
{txt}       Model {c |} {res} 260.416667         1  260.416667   {txt}Prob > F        ={res}    0.9095
{txt}    Residual {c |} {res} 131175.806         7  18739.4008   {txt}R-squared       ={res}    0.0020
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}   -0.1406
{txt}       Total {c |} {res} 131436.222         8  16429.5278   {txt}Root MSE        =   {res} 136.89

{txt}{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}annual_~s_onc{col 15}{c |} Coefficient{col 27}  Std. err.{col 39}      t{col 47}   P>|t|{col 55}     [95% con{col 68}f. interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
YearOfService {c |}{col 15}{res}{space 2} 2.083333{col 27}{space 2} 17.67267{col 38}{space 1}    0.12{col 47}{space 3}0.909{col 55}{space 4} -39.7059{col 68}{space 3} 43.87256
{txt}{space 8}_cons {c |}{col 15}{res}{space 2} 3855.028{col 27}{space 2} 99.44968{col 38}{space 1}   38.76{col 47}{space 3}0.000{col 55}{space 4} 3619.867{col 68}{space 3} 4090.189
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. reg annual_total_ECMO_onc

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}         9
{txt}{hline 13}{c +}{hline 34}   F(0, 8)         = {res}     0.00
{txt}       Model {c |} {res}          0         0           .   {txt}Prob > F        ={res}         .
{txt}    Residual {c |} {res}        106         8       13.25   {txt}R-squared       ={res}    0.0000
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0000
{txt}       Total {c |} {res}        106         8       13.25   {txt}Root MSE        =   {res} 3.6401

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}annual~O_onc{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}_cons {c |}{col 14}{res}{space 2} 11.66667{col 26}{space 2} 1.213352{col 37}{space 1}    9.62{col 46}{space 3}0.000{col 54}{space 4} 8.868673{col 67}{space 3} 14.46466
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. reg annual_total_ECMO_onc YearOfService annual_total_admissions_onc

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}         9
{txt}{hline 13}{c +}{hline 34}   F(2, 6)         = {res}     1.23
{txt}       Model {c |} {res} 30.8194916         2  15.4097458   {txt}Prob > F        ={res}    0.3568
{txt}    Residual {c |} {res} 75.1805084         6  12.5300847   {txt}R-squared       ={res}    0.2907
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0543
{txt}       Total {c |} {res}        106         8       13.25   {txt}Root MSE        =   {res} 3.5398

{txt}{hline 28}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}      annual_total_ECMO_onc{col 29}{c |} Coefficient{col 41}  Std. err.{col 53}      t{col 61}   P>|t|{col 69}     [95% con{col 82}f. interval]
{hline 28}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 14}YearOfService {c |}{col 29}{res}{space 2} .7169724{col 41}{space 2} .4574378{col 52}{space 1}    1.57{col 61}{space 3}0.168{col 69}{space 4}-.4023376{col 82}{space 3} 1.836282
{txt}annual_total_admissions_onc {c |}{col 29}{res}{space 2}-.0001467{col 41}{space 2} .0097735{col 52}{space 1}   -0.02{col 61}{space 3}0.989{col 69}{space 4}-.0240616{col 82}{space 3} .0237681
{txt}{space 22}_cons {c |}{col 29}{res}{space 2} 8.649057{col 41}{space 2} 37.76477{col 52}{space 1}    0.23{col 61}{space 3}0.826{col 69}{space 4}-83.75801{col 82}{space 3} 101.0561
{txt}{hline 28}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. restore
{txt}
{com}. 
. 
. order HospitalCity HospitalNumber DischargeID RaceCode Ethnicity Gender YearOfService YearOfService AdmitAgeInDays admitageyears ECMO_dx_y_n ECMO_y_n ecmo_type1 high_risk_group center_admissions center_admissions_2016 center_admissions_2017 center_admissions_2018 center_admissions_2019 center_admissions_2020 center_admissions_2021 center_admissions_2022 center_admissions_2023 center_admissions_2024 center_totalecmo center_total_ecmo_2016 ecmo_cases_not_high_risk_2016 ecmo_cases_onc_2016 ecmo_cases_trauma_2016 ecmo_cases_trisomy_2016 center_total_ecmo_2017 ecmo_cases_not_high_risk_2017 ecmo_cases_onc_2017 ecmo_cases_trauma_2017 ecmo_cases_trisomy_2017 center_total_ecmo_2018 ecmo_cases_not_high_risk_2018 ecmo_cases_onc_2018 ecmo_cases_trauma_2018 ecmo_cases_trisomy_2018 center_total_ecmo_2019 ecmo_cases_not_high_risk_2019 ecmo_cases_onc_2019 ecmo_cases_trauma_2019 ecmo_cases_trisomy_2019 center_total_ecmo_2020 ecmo_cases_not_high_risk_2020 ecmo_cases_onc_2020 ecmo_cases_trauma_2020 ecmo_cases_trisomy_2020 center_total_ecmo_2021 ecmo_cases_not_high_risk_2021 ecmo_cases_onc_2021 ecmo_cases_trauma_2021 ecmo_cases_trisomy_2021 center_total_ecmo_2022 ecmo_cases_not_high_risk_2022 ecmo_cases_onc_2022 ecmo_cases_trauma_2022 ecmo_cases_trisomy_2022 center_total_ecmo_2023 ecmo_cases_not_high_risk_2023 ecmo_cases_onc_2023 ecmo_cases_trauma_2023 ecmo_cases_trisomy_2023 center_total_ecmo_2024 ecmo_cases_not_high_risk_2024 ecmo_cases_onc_2024 ecmo_cases_trauma_2024 ecmo_cases_trisomy_2024
{txt}
{com}. 
. drop if HospitalNumber ==.
{txt}(0 observations deleted)

{com}. drop if DischargeID ==.
{txt}(0 observations deleted)

{com}. 
. **Table 1 data**
. preserve
{txt}
{com}. bysort YearOfService: keep if _n ==1
{txt}(704,938 observations deleted)

{com}. browse YearOfService annual_total_ECMO annual_total_ECMO_T1318 annual_total_ECMO_T1318 annual_total_ECMO_trauma annual_total_ECMO_onc annual_total_ECMO_not_hr
{txt}
{com}. browse YearOfService annual_total_admissions annual_total_admissions_T1318 annual_total_admissions_trauma annual_total_admissions_onc annual_total_admissions_not_hr
{txt}
{com}. 
. restore
{txt}
{com}. 
. **Table 1 Data All Hospital Data**
. preserve
{txt}
{com}. 
. 
. bysort YearOfService(obsnum): keep if _n==1
{txt}(704,938 observations deleted)

{com}. 
. tab annual_total_ECMO YearOfService, chi2

{txt}annual_tot {c |}                                          Year Of Service
   al_ECMO {c |}      2016       2017       2018       2019       2020       2021       2022       2023       2024 {c |}     Total
{hline 11}{c +}{hline 99}{c +}{hline 10}
       902 {c |}{res}         1          0          0          0          0          0          0          0          0 {txt}{c |}{res}         1 
{txt}      1073 {c |}{res}         0          1          0          0          0          0          0          0          0 {txt}{c |}{res}         1 
{txt}      1088 {c |}{res}         0          0          0          0          1          0          0          0          0 {txt}{c |}{res}         1 
{txt}      1141 {c |}{res}         0          0          0          0          0          0          0          0          1 {txt}{c |}{res}         1 
{txt}      1167 {c |}{res}         0          0          0          1          0          0          0          0          0 {txt}{c |}{res}         1 
{txt}      1195 {c |}{res}         0          0          1          0          0          0          0          0          0 {txt}{c |}{res}         1 
{txt}      1328 {c |}{res}         0          0          0          0          0          1          0          0          0 {txt}{c |}{res}         1 
{txt}      1348 {c |}{res}         0          0          0          0          0          0          0          1          0 {txt}{c |}{res}         1 
{txt}      1477 {c |}{res}         0          0          0          0          0          0          1          0          0 {txt}{c |}{res}         1 
{txt}{hline 11}{c +}{hline 99}{c +}{hline 10}
     Total {c |}{res}         1          1          1          1          1          1          1          1          1 {txt}{c |}{res}         9 

{txt}         Pearson chi2({res}64{txt}) = {res} 72.0000  {txt} Pr = {res}0.230
{txt}
{com}. tab annual_total_admissions YearOfService, chi2

{txt}annual_tot {c |}
al_admissi {c |}                                          Year Of Service
       ons {c |}      2016       2017       2018       2019       2020       2021       2022       2023       2024 {c |}     Total
{hline 11}{c +}{hline 99}{c +}{hline 10}
     62265 {c |}{res}         0          0          0          0          1          0          0          0          0 {txt}{c |}{res}         1 
{txt}     67480 {c |}{res}         1          0          0          0          0          0          0          0          0 {txt}{c |}{res}         1 
{txt}     74313 {c |}{res}         0          1          0          0          0          0          0          0          0 {txt}{c |}{res}         1 
{txt}     78713 {c |}{res}         0          0          1          0          0          0          0          0          0 {txt}{c |}{res}         1 
{txt}     79629 {c |}{res}         0          0          0          0          0          1          0          0          0 {txt}{c |}{res}         1 
{txt}     83030 {c |}{res}         0          0          0          1          0          0          0          0          0 {txt}{c |}{res}         1 
{txt}     83036 {c |}{res}         0          0          0          0          0          0          0          0          1 {txt}{c |}{res}         1 
{txt}     86656 {c |}{res}         0          0          0          0          0          0          0          1          0 {txt}{c |}{res}         1 
{txt}     89825 {c |}{res}         0          0          0          0          0          0          1          0          0 {txt}{c |}{res}         1 
{txt}{hline 11}{c +}{hline 99}{c +}{hline 10}
     Total {c |}{res}         1          1          1          1          1          1          1          1          1 {txt}{c |}{res}         9 

{txt}         Pearson chi2({res}64{txt}) = {res} 72.0000  {txt} Pr = {res}0.230
{txt}
{com}. tab annual_total_ECMO annual_total_admissions, exact

{text}Enumerating sample-space combinations:
{text}stage 9:{col 11}enumerations = 1
{text}stage 8:{col 11}enumerations = 0
{text}stage 7:{col 11}enumerations = 0
{text}stage 6:{col 11}enumerations = 0
{text}stage 5:{col 11}enumerations = 0
{text}stage 4:{col 11}enumerations = 0
{text}stage 3:{col 11}enumerations = 0
{text}stage 2:{col 11}enumerations = 0
{text}stage 1:{col 11}enumerations = 0

annual_tot {c |}                                      annual_total_admissions
   al_ECMO {c |}     62265      67480      74313      78713      79629      83030      83036      86656      89825 {c |}     Total
{hline 11}{c +}{hline 99}{c +}{hline 10}
       902 {c |}{res}         0          1          0          0          0          0          0          0          0 {txt}{c |}{res}         1 
{txt}      1073 {c |}{res}         0          0          1          0          0          0          0          0          0 {txt}{c |}{res}         1 
{txt}      1088 {c |}{res}         1          0          0          0          0          0          0          0          0 {txt}{c |}{res}         1 
{txt}      1141 {c |}{res}         0          0          0          0          0          0          1          0          0 {txt}{c |}{res}         1 
{txt}      1167 {c |}{res}         0          0          0          0          0          1          0          0          0 {txt}{c |}{res}         1 
{txt}      1195 {c |}{res}         0          0          0          1          0          0          0          0          0 {txt}{c |}{res}         1 
{txt}      1328 {c |}{res}         0          0          0          0          1          0          0          0          0 {txt}{c |}{res}         1 
{txt}      1348 {c |}{res}         0          0          0          0          0          0          0          1          0 {txt}{c |}{res}         1 
{txt}      1477 {c |}{res}         0          0          0          0          0          0          0          0          1 {txt}{c |}{res}         1 
{txt}{hline 11}{c +}{hline 99}{c +}{hline 10}
     Total {c |}{res}         1          1          1          1          1          1          1          1          1 {txt}{c |}{res}         9 

{txt}           Fisher's exact =                 {res}1.000
{txt}
{com}. 
. codebook annual_total_admissions

{txt}{hline}
{res}annual_total_admissions{right:(unlabeled)}
{txt}{hline}

{col 19}Type: Numeric ({res}float{txt})

{col 18}Range: [{res}62265{txt},{res}89825{txt}]{col 55}Units: {res}1
{col 10}{txt}Unique values: {res}9{col 51}{txt}Missing .: {res}0{txt}/{res}9

{txt}{col 13}Tabulation: Freq.  Value
{col 20}{res}         1{col 32}62265
{col 20}         1{col 32}67480
{col 20}         1{col 32}74313
{col 20}         1{col 32}78713
{col 20}         1{col 32}79629
{col 20}         1{col 32}83030
{col 20}         1{col 32}83036
{col 20}         1{col 32}86656
{col 20}         1{col 32}89825
{txt}
{com}. codebook annual_total_ECMO

{txt}{hline}
{res}annual_total_ECMO{right:(unlabeled)}
{txt}{hline}

{col 19}Type: Numeric ({res}float{txt})

{col 18}Range: [{res}902{txt},{res}1477{txt}]{col 55}Units: {res}1
{col 10}{txt}Unique values: {res}9{col 51}{txt}Missing .: {res}0{txt}/{res}9

{txt}{col 13}Tabulation: Freq.  Value
{col 20}{res}         1{col 32}902
{col 20}         1{col 32}1073
{col 20}         1{col 32}1088
{col 20}         1{col 32}1141
{col 20}         1{col 32}1167
{col 20}         1{col 32}1195
{col 20}         1{col 32}1328
{col 20}         1{col 32}1348
{col 20}         1{col 32}1477
{txt}
{com}. 
. sum annual_total_admissions

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
annual_tot~s {c |}{res}          9    78327.44    8940.573      62265      89825
{txt}
{com}. sum annual_total_ECMO

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
annual_tot~O {c |}{res}          9        1191    171.8866        902       1477
{txt}
{com}. 
. reg annual_total_admissions

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}         9
{txt}{hline 13}{c +}{hline 34}   F(0, 8)         = {res}     0.00
{txt}       Model {c |} {res}          0         0           .   {txt}Prob > F        ={res}         .
{txt}    Residual {c |} {res}  639470782         8  79933847.8   {txt}R-squared       ={res}    0.0000
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0000
{txt}       Total {c |} {res}  639470782         8  79933847.8   {txt}Root MSE        =   {res} 8940.6

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}annual_tot~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}_cons {c |}{col 14}{res}{space 2} 78327.44{col 26}{space 2} 2980.191{col 37}{space 1}   26.28{col 46}{space 3}0.000{col 54}{space 4} 71455.11{col 67}{space 3} 85199.78
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. reg annual_total_admissions YearOfService

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}         9
{txt}{hline 13}{c +}{hline 34}   F(1, 7)         = {res}     4.00
{txt}       Model {c |} {res}  232365696         1   232365696   {txt}Prob > F        ={res}    0.0858
{txt}    Residual {c |} {res}  407105086         7  58157869.4   {txt}R-squared       ={res}    0.3634
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.2724
{txt}       Total {c |} {res}  639470782         8  79933847.8   {txt}Root MSE        =   {res} 7626.1

{txt}{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}annual_tota~s{col 15}{c |} Coefficient{col 27}  Std. err.{col 39}      t{col 47}   P>|t|{col 55}     [95% con{col 68}f. interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
YearOfService {c |}{col 15}{res}{space 2} 1967.933{col 27}{space 2} 984.5292{col 38}{space 1}    2.00{col 47}{space 3}0.086{col 55}{space 4}-360.1084{col 68}{space 3} 4295.975
{txt}{space 8}_cons {c |}{col 15}{res}{space 2} 68487.78{col 27}{space 2} 5540.256{col 38}{space 1}   12.36{col 47}{space 3}0.000{col 55}{space 4} 55387.16{col 68}{space 3}  81588.4
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. reg annual_total_ECMO

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}         9
{txt}{hline 13}{c +}{hline 34}   F(0, 8)         = {res}     0.00
{txt}       Model {c |} {res}          0         0           .   {txt}Prob > F        ={res}         .
{txt}    Residual {c |} {res}     236360         8       29545   {txt}R-squared       ={res}    0.0000
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0000
{txt}       Total {c |} {res}     236360         8       29545   {txt}Root MSE        =   {res} 171.89

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}annual_tot~O{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}_cons {c |}{col 14}{res}{space 2}     1191{col 26}{space 2} 57.29553{col 37}{space 1}   20.79{col 46}{space 3}0.000{col 54}{space 4} 1058.876{col 67}{space 3} 1323.124
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. reg annual_total_ECMO YearOfService annual_total_admissions

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}         9
{txt}{hline 13}{c +}{hline 34}   F(2, 6)         = {res}     6.32
{txt}       Model {c |} {res} 160295.952         2  80147.9758   {txt}Prob > F        ={res}    0.0333
{txt}    Residual {c |} {res} 76064.0484         6  12677.3414   {txt}R-squared       ={res}    0.6782
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.5709
{txt}       Total {c |} {res}     236360         8       29545   {txt}Root MSE        =   {res} 112.59

{txt}{hline 24}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}      annual_total_ECMO{col 25}{c |} Coefficient{col 37}  Std. err.{col 49}      t{col 57}   P>|t|{col 65}     [95% con{col 78}f. interval]
{hline 24}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}YearOfService {c |}{col 25}{res}{space 2}  18.7625{col 37}{space 2} 18.21778{col 48}{space 1}    1.03{col 57}{space 3}0.343{col 65}{space 4}-25.81481{col 78}{space 3} 63.33981
{txt}annual_total_admissions {c |}{col 25}{res}{space 2} .0116895{col 37}{space 2} .0055803{col 48}{space 1}    2.09{col 57}{space 3}0.081{col 65}{space 4}-.0019651{col 78}{space 3} .0253441
{txt}{space 18}_cons {c |}{col 25}{res}{space 2} 181.5784{col 37}{space 2} 390.8406{col 48}{space 1}    0.46{col 57}{space 3}0.659{col 65}{space 4}-774.7741{col 78}{space 3} 1137.931
{txt}{hline 24}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. restore
{txt}
{com}. 
. **Table 1 Data All Hospital Data - Not High Risk**
. preserve
{txt}
{com}. 
. bysort YearOfService(obsnum): keep if _n==1
{txt}(704,938 observations deleted)

{com}. 
. tab annual_total_ECMO_not_hr YearOfService, chi2

{txt}annual_tot {c |}
al_ECMO_no {c |}                                          Year Of Service
      t_hr {c |}      2016       2017       2018       2019       2020       2021       2022       2023       2024 {c |}     Total
{hline 11}{c +}{hline 99}{c +}{hline 10}
       765 {c |}{res}         1          0          0          0          0          0          0          0          0 {txt}{c |}{res}         1 
{txt}       913 {c |}{res}         0          1          0          0          0          0          0          0          0 {txt}{c |}{res}         1 
{txt}       931 {c |}{res}         0          0          0          0          1          0          0          0          0 {txt}{c |}{res}         1 
{txt}       951 {c |}{res}         0          0          0          1          0          0          0          0          0 {txt}{c |}{res}         1 
{txt}      1000 {c |}{res}         0          0          0          0          0          0          0          0          1 {txt}{c |}{res}         1 
{txt}      1005 {c |}{res}         0          0          1          0          0          0          0          0          0 {txt}{c |}{res}         1 
{txt}      1148 {c |}{res}         0          0          0          0          0          1          0          0          0 {txt}{c |}{res}         1 
{txt}      1172 {c |}{res}         0          0          0          0          0          0          0          1          0 {txt}{c |}{res}         1 
{txt}      1285 {c |}{res}         0          0          0          0          0          0          1          0          0 {txt}{c |}{res}         1 
{txt}{hline 11}{c +}{hline 99}{c +}{hline 10}
     Total {c |}{res}         1          1          1          1          1          1          1          1          1 {txt}{c |}{res}         9 

{txt}         Pearson chi2({res}64{txt}) = {res} 72.0000  {txt} Pr = {res}0.230
{txt}
{com}. tab annual_total_admissions_not_hr YearOfService, chi2

{txt}annual_tot {c |}
al_admissi {c |}                                          Year Of Service
ons_not_hr {c |}      2016       2017       2018       2019       2020       2021       2022       2023       2024 {c |}     Total
{hline 11}{c +}{hline 99}{c +}{hline 10}
     50951 {c |}{res}         0          0          0          0          1          0          0          0          0 {txt}{c |}{res}         1 
{txt}     56059 {c |}{res}         1          0          0          0          0          0          0          0          0 {txt}{c |}{res}         1 
{txt}     61817 {c |}{res}         0          1          0          0          0          0          0          0          0 {txt}{c |}{res}         1 
{txt}     66374 {c |}{res}         0          0          1          0          0          0          0          0          0 {txt}{c |}{res}         1 
{txt}     67286 {c |}{res}         0          0          0          0          0          1          0          0          0 {txt}{c |}{res}         1 
{txt}     70726 {c |}{res}         0          0          0          1          0          0          0          0          0 {txt}{c |}{res}         1 
{txt}     74214 {c |}{res}         0          0          0          0          0          0          0          1          1 {txt}{c |}{res}         2 
{txt}     77408 {c |}{res}         0          0          0          0          0          0          1          0          0 {txt}{c |}{res}         1 
{txt}{hline 11}{c +}{hline 99}{c +}{hline 10}
     Total {c |}{res}         1          1          1          1          1          1          1          1          1 {txt}{c |}{res}         9 

{txt}         Pearson chi2({res}56{txt}) = {res} 63.0000  {txt} Pr = {res}0.243
{txt}
{com}. tab annual_total_ECMO_not_hr annual_total_admissions_not_hr, exact

{text}Enumerating sample-space combinations:
{text}stage 9:{col 11}enumerations = 1
{text}stage 8:{col 11}enumerations = 0
{text}stage 7:{col 11}enumerations = 0
{text}stage 6:{col 11}enumerations = 0
{text}stage 5:{col 11}enumerations = 0
{text}stage 4:{col 11}enumerations = 0
{text}stage 3:{col 11}enumerations = 0
{text}stage 2:{col 11}enumerations = 0
{text}stage 1:{col 11}enumerations = 0

annual_tot {c |}
al_ECMO_no {c |}                             annual_total_admissions_not_hr
      t_hr {c |}     50951      56059      61817      66374      67286      70726      74214      77408 {c |}     Total
{hline 11}{c +}{hline 88}{c +}{hline 10}
       765 {c |}{res}         0          1          0          0          0          0          0          0 {txt}{c |}{res}         1 
{txt}       913 {c |}{res}         0          0          1          0          0          0          0          0 {txt}{c |}{res}         1 
{txt}       931 {c |}{res}         1          0          0          0          0          0          0          0 {txt}{c |}{res}         1 
{txt}       951 {c |}{res}         0          0          0          0          0          1          0          0 {txt}{c |}{res}         1 
{txt}      1000 {c |}{res}         0          0          0          0          0          0          1          0 {txt}{c |}{res}         1 
{txt}      1005 {c |}{res}         0          0          0          1          0          0          0          0 {txt}{c |}{res}         1 
{txt}      1148 {c |}{res}         0          0          0          0          1          0          0          0 {txt}{c |}{res}         1 
{txt}      1172 {c |}{res}         0          0          0          0          0          0          1          0 {txt}{c |}{res}         1 
{txt}      1285 {c |}{res}         0          0          0          0          0          0          0          1 {txt}{c |}{res}         1 
{txt}{hline 11}{c +}{hline 88}{c +}{hline 10}
     Total {c |}{res}         1          1          1          1          1          1          2          1 {txt}{c |}{res}         9 

{txt}           Fisher's exact =                 {res}1.000
{txt}
{com}. 
. codebook annual_total_admissions_not_hr

{txt}{hline}
{res}annual_total_admissions_not_hr{right:(unlabeled)}
{txt}{hline}

{col 19}Type: Numeric ({res}float{txt})

{col 18}Range: [{res}50951{txt},{res}77408{txt}]{col 55}Units: {res}1
{col 10}{txt}Unique values: {res}8{col 51}{txt}Missing .: {res}0{txt}/{res}9

{txt}{col 13}Tabulation: Freq.  Value
{col 20}{res}         1{col 32}50951
{col 20}         1{col 32}56059
{col 20}         1{col 32}61817
{col 20}         1{col 32}66374
{col 20}         1{col 32}67286
{col 20}         1{col 32}70726
{col 20}         2{col 32}74214
{col 20}         1{col 32}77408
{txt}
{com}. codebook annual_total_ECMO_not_hr

{txt}{hline}
{res}annual_total_ECMO_not_hr{right:(unlabeled)}
{txt}{hline}

{col 19}Type: Numeric ({res}float{txt})

{col 18}Range: [{res}765{txt},{res}1285{txt}]{col 55}Units: {res}1
{col 10}{txt}Unique values: {res}9{col 51}{txt}Missing .: {res}0{txt}/{res}9

{txt}{col 13}Tabulation: Freq.  Value
{col 20}{res}         1{col 32}765
{col 20}         1{col 32}913
{col 20}         1{col 32}931
{col 20}         1{col 32}951
{col 20}         1{col 32}1000
{col 20}         1{col 32}1005
{col 20}         1{col 32}1148
{col 20}         1{col 32}1172
{col 20}         1{col 32}1285
{txt}
{com}. 
. sum annual_total_admissions_not_hr

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
ann~s_not_hr {c |}{res}          9       66561    8868.284      50951      77408
{txt}
{com}. sum annual_total_ECMO_not_hr

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
ann~O_not_hr {c |}{res}          9    1018.889    157.9093        765       1285
{txt}
{com}. 
. reg annual_total_admissions_not_hr

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}         9
{txt}{hline 13}{c +}{hline 34}   F(0, 8)         = {res}     0.00
{txt}       Model {c |} {res}          0         0           .   {txt}Prob > F        ={res}         .
{txt}    Residual {c |} {res}  629171686         8  78646460.8   {txt}R-squared       ={res}    0.0000
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0000
{txt}       Total {c |} {res}  629171686         8  78646460.8   {txt}Root MSE        =   {res} 8868.3

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}ann~s_not_hr{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}_cons {c |}{col 14}{res}{space 2}    66561{col 26}{space 2} 2956.095{col 37}{space 1}   22.52{col 46}{space 3}0.000{col 54}{space 4} 59744.23{col 67}{space 3} 73377.77
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. reg annual_total_admissions YearOfService

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}         9
{txt}{hline 13}{c +}{hline 34}   F(1, 7)         = {res}     4.00
{txt}       Model {c |} {res}  232365696         1   232365696   {txt}Prob > F        ={res}    0.0858
{txt}    Residual {c |} {res}  407105086         7  58157869.4   {txt}R-squared       ={res}    0.3634
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.2724
{txt}       Total {c |} {res}  639470782         8  79933847.8   {txt}Root MSE        =   {res} 7626.1

{txt}{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}annual_tota~s{col 15}{c |} Coefficient{col 27}  Std. err.{col 39}      t{col 47}   P>|t|{col 55}     [95% con{col 68}f. interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
YearOfService {c |}{col 15}{res}{space 2} 1967.933{col 27}{space 2} 984.5292{col 38}{space 1}    2.00{col 47}{space 3}0.086{col 55}{space 4}-360.1084{col 68}{space 3} 4295.975
{txt}{space 8}_cons {c |}{col 15}{res}{space 2} 68487.78{col 27}{space 2} 5540.256{col 38}{space 1}   12.36{col 47}{space 3}0.000{col 55}{space 4} 55387.16{col 68}{space 3}  81588.4
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. reg annual_total_ECMO_not_hr

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}         9
{txt}{hline 13}{c +}{hline 34}   F(0, 8)         = {res}     0.00
{txt}       Model {c |} {res}          0         0           .   {txt}Prob > F        ={res}         .
{txt}    Residual {c |} {res} 199482.889         8  24935.3611   {txt}R-squared       ={res}    0.0000
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0000
{txt}       Total {c |} {res} 199482.889         8  24935.3611   {txt}Root MSE        =   {res} 157.91

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}ann~O_not_hr{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}_cons {c |}{col 14}{res}{space 2} 1018.889{col 26}{space 2} 52.63645{col 37}{space 1}   19.36{col 46}{space 3}0.000{col 54}{space 4}  897.509{col 67}{space 3} 1140.269
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. reg annual_total_ECMO_not_hr YearOfService annual_total_admissions_not_hr

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}         9
{txt}{hline 13}{c +}{hline 34}   F(2, 6)         = {res}     5.25
{txt}       Model {c |} {res} 126943.349         2  63471.6744   {txt}Prob > F        ={res}    0.0481
{txt}    Residual {c |} {res} 72539.5402         6  12089.9234   {txt}R-squared       ={res}    0.6364
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.5151
{txt}       Total {c |} {res} 199482.889         8  24935.3611   {txt}Root MSE        =   {res} 109.95

{txt}{hline 31}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}      annual_total_ECMO_not_hr{col 32}{c |} Coefficient{col 44}  Std. err.{col 56}      t{col 64}   P>|t|{col 72}     [95% con{col 85}f. interval]
{hline 31}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 17}YearOfService {c |}{col 32}{res}{space 2}  23.2743{col 44}{space 2} 18.91816{col 55}{space 1}    1.23{col 64}{space 3}0.265{col 72}{space 4}-23.01677{col 85}{space 3} 69.56536
{txt}annual_total_admissions_not_hr {c |}{col 32}{res}{space 2} .0083895{col 44}{space 2} .0058421{col 55}{space 1}    1.44{col 64}{space 3}0.201{col 72}{space 4}-.0059056{col 85}{space 3} .0226847
{txt}{space 25}_cons {c |}{col 32}{res}{space 2} 344.1022{col 44}{space 2} 335.9617{col 55}{space 1}    1.02{col 64}{space 3}0.345{col 72}{space 4}-477.9664{col 85}{space 3} 1166.171
{txt}{hline 31}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. restore
{txt}
{com}. 
. **Table 1 Data All Hospital Data  Trisomy 13/18**
. preserve
{txt}
{com}. 
. help duplicates
{txt}
{com}. 
. bysort YearOfService(obsnum): keep if _n==1
{txt}(704,938 observations deleted)

{com}. 
. tab annual_total_ECMO_T1318 YearOfService, chi2

{txt}annual_tot {c |}
al_ECMO_T1 {c |}                                          Year Of Service
       318 {c |}      2016       2017       2018       2019       2020       2021       2022       2023       2024 {c |}     Total
{hline 11}{c +}{hline 99}{c +}{hline 10}
         1 {c |}{res}         1          1          0          1          0          0          1          0          1 {txt}{c |}{res}         5 
{txt}         3 {c |}{res}         0          0          0          0          1          0          0          1          0 {txt}{c |}{res}         2 
{txt}         4 {c |}{res}         0          0          1          0          0          1          0          0          0 {txt}{c |}{res}         2 
{txt}{hline 11}{c +}{hline 99}{c +}{hline 10}
     Total {c |}{res}         1          1          1          1          1          1          1          1          1 {txt}{c |}{res}         9 

{txt}         Pearson chi2({res}16{txt}) = {res} 18.0000  {txt} Pr = {res}0.324
{txt}
{com}. tab annual_total_admissions_T1318 YearOfService, chi2

{txt}annual_tot {c |}
al_admissi {c |}                                          Year Of Service
 ons_T1318 {c |}      2016       2017       2018       2019       2020       2021       2022       2023       2024 {c |}     Total
{hline 11}{c +}{hline 99}{c +}{hline 10}
       267 {c |}{res}         1          0          0          0          0          0          0          0          0 {txt}{c |}{res}         1 
{txt}       308 {c |}{res}         0          1          0          0          0          0          0          0          0 {txt}{c |}{res}         1 
{txt}       310 {c |}{res}         0          0          0          0          1          0          0          0          0 {txt}{c |}{res}         1 
{txt}       378 {c |}{res}         0          0          0          0          0          1          0          0          0 {txt}{c |}{res}         1 
{txt}       382 {c |}{res}         0          0          1          0          0          0          0          0          0 {txt}{c |}{res}         1 
{txt}       396 {c |}{res}         0          0          0          1          0          0          0          0          0 {txt}{c |}{res}         1 
{txt}       446 {c |}{res}         0          0          0          0          0          0          1          0          0 {txt}{c |}{res}         1 
{txt}       538 {c |}{res}         0          0          0          0          0          0          0          1          1 {txt}{c |}{res}         2 
{txt}{hline 11}{c +}{hline 99}{c +}{hline 10}
     Total {c |}{res}         1          1          1          1          1          1          1          1          1 {txt}{c |}{res}         9 

{txt}         Pearson chi2({res}56{txt}) = {res} 63.0000  {txt} Pr = {res}0.243
{txt}
{com}. tab annual_total_ECMO_T1318 annual_total_admissions_T1318, exact

{text}Enumerating sample-space combinations:
{text}stage 8:{col 11}enumerations = 1
{text}stage 7:{col 11}enumerations = 0
{text}stage 6:{col 11}enumerations = 0
{text}stage 5:{col 11}enumerations = 0
{text}stage 4:{col 11}enumerations = 0
{text}stage 3:{col 11}enumerations = 0
{text}stage 2:{col 11}enumerations = 0
{text}stage 1:{col 11}enumerations = 0

annual_tot {c |}
al_ECMO_T1 {c |}                              annual_total_admissions_T1318
       318 {c |}       267        308        310        378        382        396        446        538 {c |}     Total
{hline 11}{c +}{hline 88}{c +}{hline 10}
         1 {c |}{res}         1          1          0          0          0          1          1          1 {txt}{c |}{res}         5 
{txt}         3 {c |}{res}         0          0          1          0          0          0          0          1 {txt}{c |}{res}         2 
{txt}         4 {c |}{res}         0          0          0          1          1          0          0          0 {txt}{c |}{res}         2 
{txt}{hline 11}{c +}{hline 88}{c +}{hline 10}
     Total {c |}{res}         1          1          1          1          1          1          1          2 {txt}{c |}{res}         9 

{txt}           Fisher's exact =                 {res}1.000
{txt}
{com}. 
. codebook annual_total_admissions_T1318

{txt}{hline}
{res}annual_total_admissions_T1318{right:(unlabeled)}
{txt}{hline}

{col 19}Type: Numeric ({res}float{txt})

{col 18}Range: [{res}267{txt},{res}538{txt}]{col 55}Units: {res}1
{col 10}{txt}Unique values: {res}8{col 51}{txt}Missing .: {res}0{txt}/{res}9

{txt}{col 13}Tabulation: Freq.  Value
{col 20}{res}         1{col 32}267
{col 20}         1{col 32}308
{col 20}         1{col 32}310
{col 20}         1{col 32}378
{col 20}         1{col 32}382
{col 20}         1{col 32}396
{col 20}         1{col 32}446
{col 20}         2{col 32}538
{txt}
{com}. codebook annual_total_ECMO_T1318

{txt}{hline}
{res}annual_total_ECMO_T1318{right:(unlabeled)}
{txt}{hline}

{col 19}Type: Numeric ({res}float{txt})

{col 18}Range: [{res}1{txt},{res}4{txt}]{col 55}Units: {res}1
{col 10}{txt}Unique values: {res}3{col 51}{txt}Missing .: {res}0{txt}/{res}9

{txt}{col 13}Tabulation: Freq.  Value
{col 20}{res}         5{col 32}1
{col 20}         2{col 32}3
{col 20}         2{col 32}4
{txt}
{com}. 
. sum annual_total_admissions_T1318

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
annu~s_T1318 {c |}{res}          9    395.8889    96.90775        267        538
{txt}
{com}. sum annual_total_ECMO_T1318

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
annu~O_T1318 {c |}{res}          9    2.111111    1.364225          1          4
{txt}
{com}. 
. reg annual_total_admissions_T1318

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}         9
{txt}{hline 13}{c +}{hline 34}   F(0, 8)         = {res}     0.00
{txt}       Model {c |} {res}          0         0           .   {txt}Prob > F        ={res}         .
{txt}    Residual {c |} {res} 75128.8889         8  9391.11111   {txt}R-squared       ={res}    0.0000
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0000
{txt}       Total {c |} {res} 75128.8889         8  9391.11111   {txt}Root MSE        =   {res} 96.908

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}annu~s_T1318{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}_cons {c |}{col 14}{res}{space 2} 395.8889{col 26}{space 2} 32.30258{col 37}{space 1}   12.26{col 46}{space 3}0.000{col 54}{space 4}  321.399{col 67}{space 3} 470.3788
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. reg annual_total_admissions YearOfService

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}         9
{txt}{hline 13}{c +}{hline 34}   F(1, 7)         = {res}     4.00
{txt}       Model {c |} {res}  232365696         1   232365696   {txt}Prob > F        ={res}    0.0858
{txt}    Residual {c |} {res}  407105086         7  58157869.4   {txt}R-squared       ={res}    0.3634
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.2724
{txt}       Total {c |} {res}  639470782         8  79933847.8   {txt}Root MSE        =   {res} 7626.1

{txt}{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}annual_tota~s{col 15}{c |} Coefficient{col 27}  Std. err.{col 39}      t{col 47}   P>|t|{col 55}     [95% con{col 68}f. interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
YearOfService {c |}{col 15}{res}{space 2} 1967.933{col 27}{space 2} 984.5292{col 38}{space 1}    2.00{col 47}{space 3}0.086{col 55}{space 4}-360.1084{col 68}{space 3} 4295.975
{txt}{space 8}_cons {c |}{col 15}{res}{space 2} 68487.78{col 27}{space 2} 5540.256{col 38}{space 1}   12.36{col 47}{space 3}0.000{col 55}{space 4} 55387.16{col 68}{space 3}  81588.4
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. reg annual_total_ECMO_T1318

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}         9
{txt}{hline 13}{c +}{hline 34}   F(0, 8)         = {res}     0.00
{txt}       Model {c |} {res}          0         0           .   {txt}Prob > F        ={res}         .
{txt}    Residual {c |} {res} 14.8888889         8  1.86111111   {txt}R-squared       ={res}    0.0000
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0000
{txt}       Total {c |} {res} 14.8888889         8  1.86111111   {txt}Root MSE        =   {res} 1.3642

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}annu~O_T1318{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}_cons {c |}{col 14}{res}{space 2} 2.111111{col 26}{space 2} .4547418{col 37}{space 1}    4.64{col 46}{space 3}0.002{col 54}{space 4} 1.062475{col 67}{space 3} 3.159748
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. reg annual_total_ECMO_T1318 YearOfService annual_total_admissions_T1318

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}         9
{txt}{hline 13}{c +}{hline 34}   F(2, 6)         = {res}     0.11
{txt}       Model {c |} {res} .522086237         2  .261043119   {txt}Prob > F        ={res}    0.8984
{txt}    Residual {c |} {res} 14.3668027         6  2.39446711   {txt}R-squared       ={res}    0.0351
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}   -0.2866
{txt}       Total {c |} {res} 14.8888889         8  1.86111111   {txt}Root MSE        =   {res} 1.5474

{txt}{hline 30}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}      annual_total_ECMO_T1318{col 31}{c |} Coefficient{col 43}  Std. err.{col 55}      t{col 63}   P>|t|{col 71}     [95% con{col 84}f. interval]
{hline 30}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 16}YearOfService {c |}{col 31}{res}{space 2} .2015589{col 43}{space 2} .4332737{col 54}{space 1}    0.47{col 63}{space 3}0.658{col 71}{space 4}-.8586236{col 84}{space 3} 1.261741
{txt}annual_total_admissions_T1318 {c |}{col 31}{res}{space 2}-.0048267{col 43}{space 2} .0122443{col 54}{space 1}   -0.39{col 63}{space 3}0.707{col 71}{space 4}-.0347875{col 84}{space 3}  .025134
{txt}{space 24}_cons {c |}{col 31}{res}{space 2}  3.01416{col 43}{space 2} 3.133616{col 54}{space 1}    0.96{col 63}{space 3}0.373{col 71}{space 4}-4.653522{col 84}{space 3} 10.68184
{txt}{hline 30}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. restore
{txt}
{com}. 
. **Table 1 Data All Hospital Data  Trauma**
. preserve
{txt}
{com}. 
. bysort YearOfService(obsnum): keep if _n==1
{txt}(704,938 observations deleted)

{com}. 
. tab annual_total_ECMO_trauma YearOfService, chi2

{txt}annual_tot {c |}
al_ECMO_tr {c |}                                          Year Of Service
      auma {c |}      2016       2017       2018       2019       2020       2021       2022       2023       2024 {c |}     Total
{hline 11}{c +}{hline 99}{c +}{hline 10}
       125 {c |}{res}         1          0          0          0          0          0          0          0          0 {txt}{c |}{res}         1 
{txt}       127 {c |}{res}         0          0          0          0          0          0          0          0          1 {txt}{c |}{res}         1 
{txt}       143 {c |}{res}         0          0          0          0          1          0          0          0          0 {txt}{c |}{res}         1 
{txt}       149 {c |}{res}         0          1          0          0          0          0          0          0          0 {txt}{c |}{res}         1 
{txt}       158 {c |}{res}         0          0          0          0          0          0          0          1          0 {txt}{c |}{res}         1 
{txt}       167 {c |}{res}         0          0          0          0          0          1          0          0          0 {txt}{c |}{res}         1 
{txt}       173 {c |}{res}         0          0          0          0          0          0          1          0          0 {txt}{c |}{res}         1 
{txt}       181 {c |}{res}         0          0          1          0          0          0          0          0          0 {txt}{c |}{res}         1 
{txt}       203 {c |}{res}         0          0          0          1          0          0          0          0          0 {txt}{c |}{res}         1 
{txt}{hline 11}{c +}{hline 99}{c +}{hline 10}
     Total {c |}{res}         1          1          1          1          1          1          1          1          1 {txt}{c |}{res}         9 

{txt}         Pearson chi2({res}64{txt}) = {res} 72.0000  {txt} Pr = {res}0.230
{txt}
{com}. tab annual_total_admissions_trauma YearOfService, chi2

{txt}annual_tot {c |}
al_admissi {c |}                                          Year Of Service
ons_trauma {c |}      2016       2017       2018       2019       2020       2021       2022       2023       2024 {c |}     Total
{hline 11}{c +}{hline 99}{c +}{hline 10}
      7395 {c |}{res}         1          0          0          0          0          0          0          0          0 {txt}{c |}{res}         1 
{txt}      7405 {c |}{res}         0          0          0          0          1          0          0          0          0 {txt}{c |}{res}         1 
{txt}      8024 {c |}{res}         0          0          0          0          0          0          0          1          1 {txt}{c |}{res}         2 
{txt}      8027 {c |}{res}         0          0          0          0          0          1          0          0          0 {txt}{c |}{res}         1 
{txt}      8033 {c |}{res}         0          0          0          0          0          0          1          0          0 {txt}{c |}{res}         1 
{txt}      8035 {c |}{res}         0          0          1          0          0          0          0          0          0 {txt}{c |}{res}         1 
{txt}      8083 {c |}{res}         0          0          0          1          0          0          0          0          0 {txt}{c |}{res}         1 
{txt}      8140 {c |}{res}         0          1          0          0          0          0          0          0          0 {txt}{c |}{res}         1 
{txt}{hline 11}{c +}{hline 99}{c +}{hline 10}
     Total {c |}{res}         1          1          1          1          1          1          1          1          1 {txt}{c |}{res}         9 

{txt}         Pearson chi2({res}56{txt}) = {res} 63.0000  {txt} Pr = {res}0.243
{txt}
{com}. tab annual_total_ECMO_trauma annual_total_admissions_trauma, exact

{text}Enumerating sample-space combinations:
{text}stage 9:{col 11}enumerations = 1
{text}stage 8:{col 11}enumerations = 0
{text}stage 7:{col 11}enumerations = 0
{text}stage 6:{col 11}enumerations = 0
{text}stage 5:{col 11}enumerations = 0
{text}stage 4:{col 11}enumerations = 0
{text}stage 3:{col 11}enumerations = 0
{text}stage 2:{col 11}enumerations = 0
{text}stage 1:{col 11}enumerations = 0

annual_tot {c |}
al_ECMO_tr {c |}                             annual_total_admissions_trauma
      auma {c |}      7395       7405       8024       8027       8033       8035       8083       8140 {c |}     Total
{hline 11}{c +}{hline 88}{c +}{hline 10}
       125 {c |}{res}         1          0          0          0          0          0          0          0 {txt}{c |}{res}         1 
{txt}       127 {c |}{res}         0          0          1          0          0          0          0          0 {txt}{c |}{res}         1 
{txt}       143 {c |}{res}         0          1          0          0          0          0          0          0 {txt}{c |}{res}         1 
{txt}       149 {c |}{res}         0          0          0          0          0          0          0          1 {txt}{c |}{res}         1 
{txt}       158 {c |}{res}         0          0          1          0          0          0          0          0 {txt}{c |}{res}         1 
{txt}       167 {c |}{res}         0          0          0          1          0          0          0          0 {txt}{c |}{res}         1 
{txt}       173 {c |}{res}         0          0          0          0          1          0          0          0 {txt}{c |}{res}         1 
{txt}       181 {c |}{res}         0          0          0          0          0          1          0          0 {txt}{c |}{res}         1 
{txt}       203 {c |}{res}         0          0          0          0          0          0          1          0 {txt}{c |}{res}         1 
{txt}{hline 11}{c +}{hline 88}{c +}{hline 10}
     Total {c |}{res}         1          1          2          1          1          1          1          1 {txt}{c |}{res}         9 

{txt}           Fisher's exact =                 {res}1.000
{txt}
{com}. 
. codebook annual_total_admissions_trauma

{txt}{hline}
{res}annual_total_admissions_trauma{right:(unlabeled)}
{txt}{hline}

{col 19}Type: Numeric ({res}float{txt})

{col 18}Range: [{res}7395{txt},{res}8140{txt}]{col 55}Units: {res}1
{col 10}{txt}Unique values: {res}8{col 51}{txt}Missing .: {res}0{txt}/{res}9

{txt}{col 13}Tabulation: Freq.  Value
{col 20}{res}         1{col 32}7395
{col 20}         1{col 32}7405
{col 20}         2{col 32}8024
{col 20}         1{col 32}8027
{col 20}         1{col 32}8033
{col 20}         1{col 32}8035
{col 20}         1{col 32}8083
{col 20}         1{col 32}8140
{txt}
{com}. codebook annual_total_ECMO_trauma

{txt}{hline}
{res}annual_total_ECMO_trauma{right:(unlabeled)}
{txt}{hline}

{col 19}Type: Numeric ({res}float{txt})

{col 18}Range: [{res}125{txt},{res}203{txt}]{col 55}Units: {res}1
{col 10}{txt}Unique values: {res}9{col 51}{txt}Missing .: {res}0{txt}/{res}9

{txt}{col 13}Tabulation: Freq.  Value
{col 20}{res}         1{col 32}125
{col 20}         1{col 32}127
{col 20}         1{col 32}143
{col 20}         1{col 32}149
{col 20}         1{col 32}158
{col 20}         1{col 32}167
{col 20}         1{col 32}173
{col 20}         1{col 32}181
{col 20}         1{col 32}203
{txt}
{com}. 
. sum annual_total_admissions_trauma

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
ann~s_trauma {c |}{res}          9    7907.333    290.1401       7395       8140
{txt}
{com}. sum annual_total_ECMO_trauma

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
ann~O_trauma {c |}{res}          9    158.4444    25.52994        125        203
{txt}
{com}. 
. reg annual_total_admissions_trauma

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}         9
{txt}{hline 13}{c +}{hline 34}   F(0, 8)         = {res}     0.00
{txt}       Model {c |} {res}          0         0           .   {txt}Prob > F        ={res}         .
{txt}    Residual {c |} {res}     673450         8    84181.25   {txt}R-squared       ={res}    0.0000
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0000
{txt}       Total {c |} {res}     673450         8    84181.25   {txt}Root MSE        =   {res} 290.14

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}ann~s_trauma{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}_cons {c |}{col 14}{res}{space 2} 7907.333{col 26}{space 2} 96.71335{col 37}{space 1}   81.76{col 46}{space 3}0.000{col 54}{space 4} 7684.312{col 67}{space 3} 8130.355
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. reg annual_total_admissions YearOfService

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}         9
{txt}{hline 13}{c +}{hline 34}   F(1, 7)         = {res}     4.00
{txt}       Model {c |} {res}  232365696         1   232365696   {txt}Prob > F        ={res}    0.0858
{txt}    Residual {c |} {res}  407105086         7  58157869.4   {txt}R-squared       ={res}    0.3634
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.2724
{txt}       Total {c |} {res}  639470782         8  79933847.8   {txt}Root MSE        =   {res} 7626.1

{txt}{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}annual_tota~s{col 15}{c |} Coefficient{col 27}  Std. err.{col 39}      t{col 47}   P>|t|{col 55}     [95% con{col 68}f. interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
YearOfService {c |}{col 15}{res}{space 2} 1967.933{col 27}{space 2} 984.5292{col 38}{space 1}    2.00{col 47}{space 3}0.086{col 55}{space 4}-360.1084{col 68}{space 3} 4295.975
{txt}{space 8}_cons {c |}{col 15}{res}{space 2} 68487.78{col 27}{space 2} 5540.256{col 38}{space 1}   12.36{col 47}{space 3}0.000{col 55}{space 4} 55387.16{col 68}{space 3}  81588.4
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. reg annual_total_ECMO_trauma

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}         9
{txt}{hline 13}{c +}{hline 34}   F(0, 8)         = {res}     0.00
{txt}       Model {c |} {res}          0         0           .   {txt}Prob > F        ={res}         .
{txt}    Residual {c |} {res} 5214.22222         8  651.777778   {txt}R-squared       ={res}    0.0000
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0000
{txt}       Total {c |} {res} 5214.22222         8  651.777778   {txt}Root MSE        =   {res}  25.53

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}ann~O_trauma{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}_cons {c |}{col 14}{res}{space 2} 158.4444{col 26}{space 2}  8.50998{col 37}{space 1}   18.62{col 46}{space 3}0.000{col 54}{space 4} 138.8204{col 67}{space 3} 178.0685
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. reg annual_total_ECMO_trauma YearOfService annual_total_admissions_trauma

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}         9
{txt}{hline 13}{c +}{hline 34}   F(2, 6)         = {res}     1.63
{txt}       Model {c |} {res} 1836.22353         2  918.111765   {txt}Prob > F        ={res}    0.2719
{txt}    Residual {c |} {res} 3377.99869         6  562.999782   {txt}R-squared       ={res}    0.3522
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.1362
{txt}       Total {c |} {res} 5214.22222         8  651.777778   {txt}Root MSE        =   {res} 23.728

{txt}{hline 31}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}      annual_total_ECMO_trauma{col 32}{c |} Coefficient{col 44}  Std. err.{col 56}      t{col 64}   P>|t|{col 72}     [95% con{col 85}f. interval]
{hline 31}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 17}YearOfService {c |}{col 32}{res}{space 2} -2.22537{col 44}{space 2} 3.246959{col 55}{space 1}   -0.69{col 64}{space 3}0.519{col 72}{space 4}-10.17039{col 85}{space 3} 5.719653
{txt}annual_total_admissions_trauma {c |}{col 32}{res}{space 2} .0552762{col 44}{space 2} .0306478{col 55}{space 1}    1.80{col 64}{space 3}0.121{col 72}{space 4}-.0197164{col 85}{space 3} .1302687
{txt}{space 25}_cons {c |}{col 32}{res}{space 2}-267.5159{col 44}{space 2}  237.585{col 55}{space 1}   -1.13{col 64}{space 3}0.303{col 72}{space 4}-848.8654{col 85}{space 3} 313.8336
{txt}{hline 31}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. restore
{txt}
{com}. 
. **Table 1 Data All Hospital Data Onc/HSCT**
. preserve
{txt}
{com}. 
. bysort YearOfService(obsnum): keep if _n==1
{txt}(704,938 observations deleted)

{com}. 
. tab annual_total_ECMO_onc YearOfService, chi2

{txt}annual_tot {c |}
al_ECMO_on {c |}                                          Year Of Service
         c {c |}      2016       2017       2018       2019       2020       2021       2022       2023       2024 {c |}     Total
{hline 11}{c +}{hline 99}{c +}{hline 10}
         5 {c |}{res}         0          0          1          0          0          0          0          0          0 {txt}{c |}{res}         1 
{txt}         9 {c |}{res}         0          0          0          0          0          1          0          0          0 {txt}{c |}{res}         1 
{txt}        11 {c |}{res}         1          1          0          0          1          0          0          0          0 {txt}{c |}{res}         3 
{txt}        12 {c |}{res}         0          0          0          1          0          0          0          0          0 {txt}{c |}{res}         1 
{txt}        13 {c |}{res}         0          0          0          0          0          0          0          0          1 {txt}{c |}{res}         1 
{txt}        15 {c |}{res}         0          0          0          0          0          0          0          1          0 {txt}{c |}{res}         1 
{txt}        18 {c |}{res}         0          0          0          0          0          0          1          0          0 {txt}{c |}{res}         1 
{txt}{hline 11}{c +}{hline 99}{c +}{hline 10}
     Total {c |}{res}         1          1          1          1          1          1          1          1          1 {txt}{c |}{res}         9 

{txt}         Pearson chi2({res}48{txt}) = {res} 54.0000  {txt} Pr = {res}0.256
{txt}
{com}. tab annual_total_admissions_onc YearOfService, chi2

{txt}annual_tot {c |}
al_admissi {c |}                                          Year Of Service
   ons_onc {c |}      2016       2017       2018       2019       2020       2021       2022       2023       2024 {c |}     Total
{hline 11}{c +}{hline 99}{c +}{hline 10}
      3599 {c |}{res}         0          0          0          0          1          0          0          0          0 {txt}{c |}{res}         1 
{txt}      3759 {c |}{res}         1          0          0          0          0          0          0          0          0 {txt}{c |}{res}         1 
{txt}      3825 {c |}{res}         0          0          0          1          0          0          0          0          0 {txt}{c |}{res}         1 
{txt}      3880 {c |}{res}         0          0          0          0          0          0          0          1          1 {txt}{c |}{res}         2 
{txt}      3922 {c |}{res}         0          0          1          0          0          0          0          0          0 {txt}{c |}{res}         1 
{txt}      3938 {c |}{res}         0          0          0          0          0          1          1          0          0 {txt}{c |}{res}         2 
{txt}      4048 {c |}{res}         0          1          0          0          0          0          0          0          0 {txt}{c |}{res}         1 
{txt}{hline 11}{c +}{hline 99}{c +}{hline 10}
     Total {c |}{res}         1          1          1          1          1          1          1          1          1 {txt}{c |}{res}         9 

{txt}         Pearson chi2({res}48{txt}) = {res} 54.0000  {txt} Pr = {res}0.256
{txt}
{com}. tab annual_total_ECMO_onc annual_total_admissions_onc, exact

{text}Enumerating sample-space combinations:
{text}stage 7:{col 11}enumerations = 1
{text}stage 6:{col 11}enumerations = 0
{text}stage 5:{col 11}enumerations = 0
{text}stage 4:{col 11}enumerations = 0
{text}stage 3:{col 11}enumerations = 0
{text}stage 2:{col 11}enumerations = 0
{text}stage 1:{col 11}enumerations = 0

annual_tot {c |}
al_ECMO_on {c |}                         annual_total_admissions_onc
         c {c |}      3599       3759       3825       3880       3922       3938       4048 {c |}     Total
{hline 11}{c +}{hline 77}{c +}{hline 10}
         5 {c |}{res}         0          0          0          0          1          0          0 {txt}{c |}{res}         1 
{txt}         9 {c |}{res}         0          0          0          0          0          1          0 {txt}{c |}{res}         1 
{txt}        11 {c |}{res}         1          1          0          0          0          0          1 {txt}{c |}{res}         3 
{txt}        12 {c |}{res}         0          0          1          0          0          0          0 {txt}{c |}{res}         1 
{txt}        13 {c |}{res}         0          0          0          1          0          0          0 {txt}{c |}{res}         1 
{txt}        15 {c |}{res}         0          0          0          1          0          0          0 {txt}{c |}{res}         1 
{txt}        18 {c |}{res}         0          0          0          0          0          1          0 {txt}{c |}{res}         1 
{txt}{hline 11}{c +}{hline 77}{c +}{hline 10}
     Total {c |}{res}         1          1          1          2          1          2          1 {txt}{c |}{res}         9 

{txt}           Fisher's exact =                 {res}1.000
{txt}
{com}. 
. codebook annual_total_admissions_onc

{txt}{hline}
{res}annual_total_admissions_onc{right:(unlabeled)}
{txt}{hline}

{col 19}Type: Numeric ({res}float{txt})

{col 18}Range: [{res}3599{txt},{res}4048{txt}]{col 55}Units: {res}1
{col 10}{txt}Unique values: {res}7{col 51}{txt}Missing .: {res}0{txt}/{res}9

{txt}{col 13}Tabulation: Freq.  Value
{col 20}{res}         1{col 32}3599
{col 20}         1{col 32}3759
{col 20}         1{col 32}3825
{col 20}         2{col 32}3880
{col 20}         1{col 32}3922
{col 20}         2{col 32}3938
{col 20}         1{col 32}4048
{txt}
{com}. codebook annual_total_ECMO_onc

{txt}{hline}
{res}annual_total_ECMO_onc{right:(unlabeled)}
{txt}{hline}

{col 19}Type: Numeric ({res}float{txt})

{col 18}Range: [{res}5{txt},{res}18{txt}]{col 55}Units: {res}1
{col 10}{txt}Unique values: {res}7{col 51}{txt}Missing .: {res}0{txt}/{res}9

{txt}{col 13}Tabulation: Freq.  Value
{col 20}{res}         1{col 32}5
{col 20}         1{col 32}9
{col 20}         3{col 32}11
{col 20}         1{col 32}12
{col 20}         1{col 32}13
{col 20}         1{col 32}15
{col 20}         1{col 32}18
{txt}
{com}. 
. sum annual_total_admissions_onc

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
annual~s_onc {c |}{res}          9    3865.444    128.1777       3599       4048
{txt}
{com}. sum annual_total_ECMO_onc

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
annual~O_onc {c |}{res}          9    11.66667    3.640055          5         18
{txt}
{com}. 
. reg annual_total_admissions_onc

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}         9
{txt}{hline 13}{c +}{hline 34}   F(0, 8)         = {res}     0.00
{txt}       Model {c |} {res}          0         0           .   {txt}Prob > F        ={res}         .
{txt}    Residual {c |} {res} 131436.222         8  16429.5278   {txt}R-squared       ={res}    0.0000
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0000
{txt}       Total {c |} {res} 131436.222         8  16429.5278   {txt}Root MSE        =   {res} 128.18

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}annual~s_onc{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}_cons {c |}{col 14}{res}{space 2} 3865.444{col 26}{space 2} 42.72591{col 37}{space 1}   90.47{col 46}{space 3}0.000{col 54}{space 4} 3766.918{col 67}{space 3} 3963.971
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. reg annual_total_admissions YearOfService

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}         9
{txt}{hline 13}{c +}{hline 34}   F(1, 7)         = {res}     4.00
{txt}       Model {c |} {res}  232365696         1   232365696   {txt}Prob > F        ={res}    0.0858
{txt}    Residual {c |} {res}  407105086         7  58157869.4   {txt}R-squared       ={res}    0.3634
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.2724
{txt}       Total {c |} {res}  639470782         8  79933847.8   {txt}Root MSE        =   {res} 7626.1

{txt}{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}annual_tota~s{col 15}{c |} Coefficient{col 27}  Std. err.{col 39}      t{col 47}   P>|t|{col 55}     [95% con{col 68}f. interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
YearOfService {c |}{col 15}{res}{space 2} 1967.933{col 27}{space 2} 984.5292{col 38}{space 1}    2.00{col 47}{space 3}0.086{col 55}{space 4}-360.1084{col 68}{space 3} 4295.975
{txt}{space 8}_cons {c |}{col 15}{res}{space 2} 68487.78{col 27}{space 2} 5540.256{col 38}{space 1}   12.36{col 47}{space 3}0.000{col 55}{space 4} 55387.16{col 68}{space 3}  81588.4
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. reg annual_total_ECMO_onc

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}         9
{txt}{hline 13}{c +}{hline 34}   F(0, 8)         = {res}     0.00
{txt}       Model {c |} {res}          0         0           .   {txt}Prob > F        ={res}         .
{txt}    Residual {c |} {res}        106         8       13.25   {txt}R-squared       ={res}    0.0000
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0000
{txt}       Total {c |} {res}        106         8       13.25   {txt}Root MSE        =   {res} 3.6401

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}annual~O_onc{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}_cons {c |}{col 14}{res}{space 2} 11.66667{col 26}{space 2} 1.213352{col 37}{space 1}    9.62{col 46}{space 3}0.000{col 54}{space 4} 8.868673{col 67}{space 3} 14.46466
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. reg annual_total_ECMO_onc YearOfService annual_total_admissions_onc

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}         9
{txt}{hline 13}{c +}{hline 34}   F(2, 6)         = {res}     1.23
{txt}       Model {c |} {res} 30.8194916         2  15.4097458   {txt}Prob > F        ={res}    0.3568
{txt}    Residual {c |} {res} 75.1805084         6  12.5300847   {txt}R-squared       ={res}    0.2907
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0543
{txt}       Total {c |} {res}        106         8       13.25   {txt}Root MSE        =   {res} 3.5398

{txt}{hline 28}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}      annual_total_ECMO_onc{col 29}{c |} Coefficient{col 41}  Std. err.{col 53}      t{col 61}   P>|t|{col 69}     [95% con{col 82}f. interval]
{hline 28}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 14}YearOfService {c |}{col 29}{res}{space 2} .7169724{col 41}{space 2} .4574378{col 52}{space 1}    1.57{col 61}{space 3}0.168{col 69}{space 4}-.4023376{col 82}{space 3} 1.836282
{txt}annual_total_admissions_onc {c |}{col 29}{res}{space 2}-.0001467{col 41}{space 2} .0097735{col 52}{space 1}   -0.02{col 61}{space 3}0.989{col 69}{space 4}-.0240616{col 82}{space 3} .0237681
{txt}{space 22}_cons {c |}{col 29}{res}{space 2} 8.649057{col 41}{space 2} 37.76477{col 52}{space 1}    0.23{col 61}{space 3}0.826{col 69}{space 4}-83.75801{col 82}{space 3} 101.0561
{txt}{hline 28}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. restore
{txt}
{com}. 
. 
. 
. **REGRESSION**
. *creation of empty model*
. logistic ECMO_y_n
{res}
{txt}{col 1}Logistic regression{col 56}{lalign 13:Number of obs}{col 69} = {res}{ralign 7:704,947}
{txt}{col 56}{lalign 13:LR chi2({res:0})}{col 69} = {res}{ralign 7:-0.00}
{txt}{col 56}{lalign 13:Prob > chi2}{col 69} = {res}{ralign 7:.}
{txt}{col 1}{lalign 14:Log likelihood}{col 15} = {res}{ralign 10:-55507.947}{txt}{col 56}{lalign 13:Pseudo R2}{col 69} = {res}{ralign 7:-0.0000}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    ECMO_y_n{col 14}{c |}       Odds{col 26}   Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}_cons {c |}{col 14}{res}{space 2} .0154402{col 26}{space 2} .0001503{col 37}{space 1} -428.52{col 46}{space 3}0.000{col 54}{space 4} .0151484{col 67}{space 3} .0157375
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. estimates store modele1 
{txt}
{com}. 
. *creation of level 1 model*
. logistic ECMO_y_n ib3.high_risk_group ib0.ECMO_dx_y_n Ethnicity Gender admitageyears YearOfService 
{res}
{txt}{col 1}Logistic regression{col 56}{lalign 13:Number of obs}{col 69} = {res}{ralign 7:704,947}
{txt}{col 56}{lalign 13:LR chi2({res:8})}{col 69} = {res}{ralign 7:3056.30}
{txt}{col 56}{lalign 13:Prob > chi2}{col 69} = {res}{ralign 7:0.0000}
{txt}{col 1}{lalign 14:Log likelihood}{col 15} = {res}{ralign 10:-53979.797}{txt}{col 56}{lalign 13:Pseudo R2}{col 69} = {res}{ralign 7:0.0275}

{txt}{hline 16}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       ECMO_y_n{col 17}{c |} Odds ratio{col 29}   Std. err.{col 41}      z{col 49}   P>|z|{col 57}     [95% con{col 70}f. interval]
{hline 16}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
high_risk_group {c |}
{space 8}T13/18  {c |}{col 17}{res}{space 2}  .335727{col 29}{space 2}  .079461{col 40}{space 1}   -4.61{col 49}{space 3}0.000{col 57}{space 4} .2111159{col 70}{space 3} .5338897
{txt}{space 8}Trauma  {c |}{col 17}{res}{space 2} 2.593413{col 29}{space 2} .0758868{col 40}{space 1}   32.57{col 49}{space 3}0.000{col 57}{space 4} 2.448862{col 70}{space 3} 2.746496
{txt}{space 6}Onc/HSCT  {c |}{col 17}{res}{space 2} .6727585{col 29}{space 2} .0665341{col 40}{space 1}   -4.01{col 49}{space 3}0.000{col 57}{space 4} .5542141{col 70}{space 3} .8166592
{txt}{space 15} {c |}
{space 2}1.ECMO_dx_y_n {c |}{col 17}{res}{space 2} 140.5932{col 29}{space 2} 44.63427{col 40}{space 1}   15.58{col 49}{space 3}0.000{col 57}{space 4} 75.46273{col 70}{space 3} 261.9366
{txt}{space 6}Ethnicity {c |}{col 17}{res}{space 2}  1.26525{col 29}{space 2} .0255058{col 40}{space 1}   11.67{col 49}{space 3}0.000{col 57}{space 4} 1.216235{col 70}{space 3} 1.316242
{txt}{space 9}Gender {c |}{col 17}{res}{space 2} 1.167956{col 29}{space 2} .0228006{col 40}{space 1}    7.95{col 49}{space 3}0.000{col 57}{space 4} 1.124112{col 70}{space 3}  1.21351
{txt}{space 2}admitageyears {c |}{col 17}{res}{space 2} .9726161{col 29}{space 2} .0015738{col 40}{space 1}  -17.16{col 49}{space 3}0.000{col 57}{space 4} .9695364{col 70}{space 3} .9757057
{txt}{space 2}YearOfService {c |}{col 17}{res}{space 2} 1.013226{col 29}{space 2} .0038575{col 40}{space 1}    3.45{col 49}{space 3}0.001{col 57}{space 4} 1.005694{col 70}{space 3} 1.020815
{txt}{space 10}_cons {c |}{col 17}{res}{space 2} .0000614{col 29}{space 2} .0000198{col 40}{space 1}  -30.11{col 49}{space 3}0.000{col 57}{space 4} .0000327{col 70}{space 3} .0001155
{txt}{hline 16}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 2}Note: {bf:_cons} estimates baseline odds{txt}.{p_end}

{com}. estimates store model1a
{txt}
{com}. 
. *creation of empty model with fixed effects*
. melogit ECMO_y_n||HospitalNumber: , or
{res}{txt}
Fitting fixed-effects model:

Iteration 0:{space 2}Log likelihood = {res:-89001.407}  
Iteration 1:{space 2}Log likelihood = {res:-55588.957}  
Iteration 2:{space 2}Log likelihood = {res:-55508.196}  
Iteration 3:{space 2}Log likelihood = {res:-55507.947}  
Iteration 4:{space 2}Log likelihood = {res:-55507.947}  

Refining starting values:

Grid node 0:{space 2}Log likelihood = {res:-54771.239}

Fitting full model:
{res}
{txt}Iteration 0:{space 2}Log likelihood = {res:-54771.239}  (not concave)
Iteration 1:{space 2}Log likelihood = {res:-54766.673}  (not concave)
Iteration 2:{space 2}Log likelihood = {res:-54762.425}  (backed up)
Iteration 3:{space 2}Log likelihood = {res:-54760.728}  
Iteration 4:{space 2}Log likelihood = {res:-54759.705}  
Iteration 5:{space 2}Log likelihood = {res:-54759.665}  
Iteration 6:{space 2}Log likelihood = {res:-54759.665}  
{res}
{txt}Mixed-effects logistic regression{col 49}{txt}Number of obs{col 67}={res}{col 69}   704,947
{txt}Group variable: {res}HospitalNumber{col 49}{txt}Number of groups{col 67}={res}{col 69}        48

{col 49}{txt}Obs per group:
{col 63}{txt}min{col 67}={res}{col 69}     1,057
{col 63}{txt}avg{col 67}={res}{col 69}  14,686.4
{col 63}{txt}max{col 67}={res}{col 69}    46,624

{txt}Integration method: {res}mvaghermite{col 49}{txt}Integration pts.{col 67}={col 78}{res}7

{col 49}{txt}Wald chi2({res}0{txt}){col 67}={res}{col 70}        .
{txt}Log likelihood = {res}-54759.665{col 49}{txt}Prob > chi2{col 67}={res}{col 73}     .
{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}      ECMO_y_n{col 16}{c |}       Odds{col 28}   Std. err.{col 40}      z{col 48}   P>|z|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}_cons {c |}{col 16}{res}{space 2}  .013414{col 28}{space 2} .0010774{col 39}{space 1}  -53.68{col 48}{space 3}0.000{col 56}{space 4}   .01146{col 69}{space 3}  .015701
{txt}{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}{res}HospitalNumber{col 16}{txt}{c |}
{space 5}var(_cons){c |}{col 16}{res}{space 2}  .297889{col 28}{space 2} .0668201{col 56}{space 4} .1919198{col 69}{space 3} .4623695
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 2}Note: {help eform_option:Estimates are transformed} only in the first equation to odds.{p_end}
{txt}LR test vs. logistic model: {txt}{help j_chibar##|_new:chibar2(01) =}{res} 1496.56{col 55}{txt}Prob >= chibar2 = {res}{col 73}0.0000
{txt}
{com}. estimates store modele2
{txt}
{com}. 
. *creation of multilevel model, fixed effects*
. melogit ECMO_y_n ib3.high_risk_group ib0.ECMO_dx_y_n Ethnicity Gender admitageyears YearOfService center_admissions center_totalecmo number_of_casesonc number_of_casest1318 number_of_casestrauma ||HospitalNumber: , or
{res}{txt}
Fitting fixed-effects model:

Iteration 0:{space 2}Log likelihood = {res:-88789.373}  
Iteration 1:{space 2}Log likelihood = {res: -54467.65}  
Iteration 2:{space 2}Log likelihood = {res:-53507.045}  
Iteration 3:{space 2}Log likelihood = {res:-53348.311}  
Iteration 4:{space 2}Log likelihood = {res: -53324.42}  
Iteration 5:{space 2}Log likelihood = {res:-53323.118}  
Iteration 6:{space 2}Log likelihood = {res:-53323.107}  
Iteration 7:{space 2}Log likelihood = {res:-53323.107}  

Refining starting values:

Grid node 0:{space 2}Log likelihood = {res:-53281.279}

Fitting full model:
{res}
{txt}Iteration 0:{space 2}Log likelihood = {res:-53281.279}  (not concave)
Iteration 1:{space 2}Log likelihood = {res:-53253.183}  (not concave)
Iteration 2:{space 2}Log likelihood = {res:-53244.141}  (backed up)
Iteration 3:{space 2}Log likelihood = {res:-53240.765}  
Iteration 4:{space 2}Log likelihood = {res:    -53240}  
Iteration 5:{space 2}Log likelihood = {res: -53239.98}  
Iteration 6:{space 2}Log likelihood = {res: -53239.98}  
{res}
{txt}Mixed-effects logistic regression{col 49}{txt}Number of obs{col 67}={res}{col 69}   704,947
{txt}Group variable: {res}HospitalNumber{col 49}{txt}Number of groups{col 67}={res}{col 69}        48

{col 49}{txt}Obs per group:
{col 63}{txt}min{col 67}={res}{col 69}     1,057
{col 63}{txt}avg{col 67}={res}{col 69}  14,686.4
{col 63}{txt}max{col 67}={res}{col 69}    46,624

{txt}Integration method: {res}mvaghermite{col 49}{txt}Integration pts.{col 67}={col 78}{res}7

{col 49}{txt}Wald chi2({res}13{txt}){col 67}={res}{col 70}  1808.68
{txt}Log likelihood = {res}-53239.98{col 49}{txt}Prob > chi2{col 67}={res}{col 73}0.0000
{txt}{hline 22}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}             ECMO_y_n{col 23}{c |} Odds ratio{col 35}   Std. err.{col 47}      z{col 55}   P>|z|{col 63}     [95% con{col 76}f. interval]
{hline 22}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}high_risk_group {c |}
{space 14}T13/18  {c |}{col 23}{res}{space 2}  .330824{col 35}{space 2}  .078361{col 46}{space 1}   -4.67{col 55}{space 3}0.000{col 63}{space 4} .2079583{col 76}{space 3} .5262811
{txt}{space 14}Trauma  {c |}{col 23}{res}{space 2} 2.613735{col 35}{space 2} .0770581{col 46}{space 1}   32.59{col 55}{space 3}0.000{col 63}{space 4} 2.466985{col 76}{space 3} 2.769215
{txt}{space 12}Onc/HSCT  {c |}{col 23}{res}{space 2} .6632001{col 35}{space 2}  .065665{col 46}{space 1}   -4.15{col 55}{space 3}0.000{col 63}{space 4} .5462169{col 76}{space 3} .8052376
{txt}{space 21} {c |}
{space 8}1.ECMO_dx_y_n {c |}{col 23}{res}{space 2} 138.0203{col 35}{space 2} 43.82392{col 46}{space 1}   15.52{col 55}{space 3}0.000{col 63}{space 4} 74.07491{col 76}{space 3} 257.1667
{txt}{space 12}Ethnicity {c |}{col 23}{res}{space 2} 1.213305{col 35}{space 2} .0259099{col 46}{space 1}    9.05{col 55}{space 3}0.000{col 63}{space 4}  1.16357{col 76}{space 3} 1.265165
{txt}{space 15}Gender {c |}{col 23}{res}{space 2} 1.164636{col 35}{space 2} .0227699{col 46}{space 1}    7.80{col 55}{space 3}0.000{col 63}{space 4} 1.120852{col 76}{space 3}  1.21013
{txt}{space 8}admitageyears {c |}{col 23}{res}{space 2} .9727579{col 35}{space 2} .0015783{col 46}{space 1}  -17.02{col 55}{space 3}0.000{col 63}{space 4} .9696694{col 76}{space 3} .9758562
{txt}{space 8}YearOfService {c |}{col 23}{res}{space 2} 1.013329{col 35}{space 2} .0038819{col 46}{space 1}    3.46{col 55}{space 3}0.001{col 63}{space 4} 1.005749{col 76}{space 3} 1.020966
{txt}{space 4}center_admissions {c |}{col 23}{res}{space 2} .9999362{col 35}{space 2} .0000118{col 46}{space 1}   -5.40{col 55}{space 3}0.000{col 63}{space 4}  .999913{col 76}{space 3} .9999593
{txt}{space 5}center_totalecmo {c |}{col 23}{res}{space 2} 1.004866{col 35}{space 2} .0003992{col 46}{space 1}   12.22{col 55}{space 3}0.000{col 63}{space 4} 1.004084{col 76}{space 3} 1.005649
{txt}{space 3}number_of_casesonc {c |}{col 23}{res}{space 2} 1.000047{col 35}{space 2} .0000924{col 46}{space 1}    0.51{col 55}{space 3}0.613{col 63}{space 4} .9998656{col 76}{space 3} 1.000228
{txt}{space 1}number_of_casest1318 {c |}{col 23}{res}{space 2} 1.000408{col 35}{space 2} .0009403{col 46}{space 1}    0.43{col 55}{space 3}0.664{col 63}{space 4} .9985666{col 76}{space 3} 1.002252
{txt}number_of_casestrauma {c |}{col 23}{res}{space 2} 1.000059{col 35}{space 2} .0000916{col 46}{space 1}    0.64{col 55}{space 3}0.522{col 63}{space 4} .9998791{col 76}{space 3} 1.000238
{txt}{space 16}_cons {c |}{col 23}{res}{space 2} .0000446{col 35}{space 2}  .000015{col 46}{space 1}  -29.88{col 55}{space 3}0.000{col 63}{space 4} .0000231{col 76}{space 3} .0000861
{txt}{hline 22}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}{res}HospitalNumber       {col 23}{txt}{c |}
{space 12}var(_cons){c |}{col 23}{res}{space 2} .0463809{col 35}{space 2} .0135304{col 63}{space 4} .0261832{col 76}{space 3}  .082159
{txt}{hline 22}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 2}Note: {help eform_option:Estimates are transformed} only in the first equation to odds ratios.{p_end}
{p 0 6 2}Note: {bf:_cons} estimates baseline odds (conditional on zero random effects){txt}.{p_end}
{txt}LR test vs. logistic model: {txt}{help j_chibar##|_new:chibar2(01) =}{res} 166.25{col 55}{txt}Prob >= chibar2 = {res}{col 73}0.0000
{txt}
{com}. estimates store model2a
{txt}
{com}. 
. 
. **MARGINS T1318**
. *margins center admissions*
. margins, at (center_admissions = (10000(1000)30000) high_risk_group = 0 ECMO_dx_y_n = 1 center_totalecmo = 361.6644 number_of_casesonc = 930.8248 number_of_casest1318 = 98.29036  number_of_casestrauma = 1803.592)
{err}{p}default prediction  is a function of possibly stochastic quantities other than {bf:e(b)}{p_end}
{txt}{search r(498), local:r(498);}

end of do-file

{search r(498), local:r(498);}

{com}. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\laxfr\Desktop\All-Comers\Analysis\Final Analysis Log.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}20 Jan 2026, 07:01:59
{txt}{.-}
{smcl}
{txt}{sf}{ul off}